Repository: geographika/MapServer-documentation
Catalog: translated/*/environment_variables.po
Languages: fr

source: Environment Variables
fr: Variables d'environnement

source: A number of environment variables can be used to control MapServer's behavior or specify the location of some resources.
fr: Un certain nombre de variables d'environnement peut être utilisé pour contrôler le comportement de Mapserver ou spécifier l'emplacement de certaines ressources

source: Used to specify the location of the Certificate Authority (CA) bundle file to be used by Curl when using HTTPS connections in WMS/WFS client layers. Curl comes bundled with its own CA bundle by default, so this variable is not required unless you have an unusual installation::
fr: Utilisé pour spécifier l'emplacement d'un fichier d'une Autorité de certification (CA) qui sera utilisé par Curl quand on utilise des connexions HTTPS pour accéder à des couches via les clients WMS/WFS. Curl est fourni avec son propre fichier de CA par défaut, ainsi cette variable n'est pas nécessaire à moins que vous ayiez une installation inhabituelle::

source: A default `DEBUG` level value can be set using the `MS_DEBUGLEVEL` environment variable in combination with the `MS_ERRORFILE` variable.
fr: Un niveau de `DEBUG` par défaut peut être défini en utilisant la variable d'environnement `MS_DEBUGLEVEL` en combinaison avec la variable `MS_ERRORFILE`.

source: When set, this value is used as the default debug level value for all map and layer objects as they are loaded by the mapfile parser. This option also sets the debug level for any msDebug() call located outside of the context of a map or layer object, for instance for debug statements relating to initialization before a map is loaded. If a `DEBUG` value is also specified in the mapfile in some map or layer objects then the local value (in the mapfile) takes precedence over the value of the environment variable.
fr: Quand elle est définie, cette valeur est utilisée comme la valeur de debug par défaut pour tous les objets MAP et LAYER quand ils sont chargés par le parseur de mapfile. Cette option définit aussi le niveau de debug pour n'importe quel appel msDebug() effectué en dehors du contexte d'un objet MAP ou LAYER, par exemple, pour des instructions de debug relative à l'initialisation avant qu'un mapfile soit chargé. Si une valeur `DEBUG` est spécifiée aussi dans le mapfile au niveau d'un objet MAP ou LAYER alors la valeur locale (dans le mapfile) a la précédence sur la valeur provenant de la variable d'environnement.

source: This option is mostly useful when tuning applications by enabling timing/debug output before the map is loaded, to capture the full process initialization and map loading time, for instance.
fr: Cette option est principalement utile quand on optimise les applications en permettant une sortie de timing/debug avant que la carte soit chargée, pour décompter tout le temps pris par le processus complet d'initialisation et de chargement de la carte, par exemple.

source: The `MS_ERRORFILE` environment variable specifies the location of the logging/debug output, with possible values being either a file path on disk, or one of the following special values:
fr: La variable d'environnement `MS_ERRORFILE` spécifie l'emplacement de la sortie de log/debug, avec des valeurs pouvant être autant un chemin vers un fichier sur un disque qu'une des valeurs spéciales suivantes:

source: "stderr" to send output to standard error. Under Apache stderr is the Apache error_log file. Under IIS stderr goes to stdout so its use is discouraged. With IIS it is recommended to do direct output to a file on disk instead.
fr: "stderr" pour envoyer la sortie vers l'erreur standard. Sous Apache, stderr est le fichier error_log de Apache. Sous IIS stderr va vers stdout (la sortie standard) ainsi son usage est à éviter. Avec IIS il est recommandé de diriger la sortie vers un fichier sur le disque à la place.

source: "stdout" to send output to standard output, combined with the rest of MapServer’s output.
fr: "stdout" pour envoyer la sortie vers la sortie standard, combinée avec le reste de la sortie MapServer.

source: "windowsdebug" to send output to the Windows OutputDebugString API, allowing the use of external programs like SysInternals debugview to display the debug output.
fr: "windowsdebug" pour envoyer la sortie vers l'API OutputDebugString de Windows, qui permet l'utilisation de programmes externes comme debugview fourni par SysInternals pour afficher la sortie de debug.

source: It is possible to specify `MS_ERRORFILE` either as an environment variable or via a `CONFIG` directive inside a mapfile::
fr: Il est possible de spécifier `MS_ERRORFILE` soit comme une variable d'environnement ou via une directive `CONFIG` dans un mapfile::

source: or::
fr: ou::

source: If both the `MS_ERRORFILE` environment variable is set and a `CONFIG` `MS_ERRORFILE` is set, then the `CONFIG` directive takes precedence.
fr: Si à la fois la variable d'environnement `MS_ERRORFILE` est définie et qu'un `CONFIG` `MS_ERRORFILE` est défini, alors la directive `CONFIG` prend la précédence.

source: If `MS_ERRORFILE` is not set, then error/debug logging is disabled. During parsing of a mapfile, error/debug logging may become available only after the `MS_ERRORFILE` directive has been parsed.
fr: Si `MS_ERRORFILE` n'est pas défini, alors le suivi de log des erreurs/debug est désactivé. Pendant le parsage d'un mapfile, le log des erreurs/debug risque de devenir disponible seulement après que la directive `MS_ERRORFILE` ait été parsé.

source: The `MS_MAP_NO_PATH` environment variable can be set to any value to forbid the use of explicit paths in the map=... URL parameter. Setting `MS_MAP_NO_PATH` to **any value** forces the use of the map=<env_variable_name> mechanism in mapserv CGI URLs.
fr: La variable d'environnement `MS_MAP_NO_PATH` peut être définie à n'importe quelle valeur pour interdire l'utilisation de chemins explicites dans le paramètre d'URL map=... . Définir `MS_MAP_NO_PATH` à **n'importe quelle valeur** force l'utilisation du mécanisme map=<env_variable_name> dans les URL appelant mapserv CGI.

source: If this variable is not set then nothing changes and the mapserv CGI still accepts explicit file paths via the map=... URL parameter.
fr: Si cette variable n'est pas définie alors rien ne change et le programme CGI mapserv accepte toujours les chemins de fichiers explicites via le paramètre d'URL map=... .

source: Example, set set `MS_MAP_NOPATH` and some mapfile paths in Apache's httpd.conf::
fr: Exemple, définir `MS_MAP_NOPATH`et d'autres chemins de mapfile dans le fichier httpd.conf de Apache::

source: and then calls the mapserv CGI must use environment variables for the map=... parameter::
fr: et ensuite les appels vers le programme CGI mapserv doivent utiliser des variables d'environnement pour le paramètre map=... ::

source: The mapfile to use if the map=... URL parameter is not provided.
fr: Le mapfile à utiliser si le paramètre d'URL map=... URL n'est pas fourni.

source: It is also possible to use an environment variable name as the value of the map=... URL parameter. The value of this environment variable will be used as the mapfile path::
fr: Il est aussi possible d'utiliser une nom de variable d'environnement comme valeur du paramètre dans l'URL map=... La valeur de cette variable d'environnement sera utilisée comme chemin de mapfile::

source: `MS_MAPFILE_PATTERN` can be used to override the default regular expression which is used to validate mapfile filename extensions.
fr: `MS_MAPFILE_PATTERN` peut être utilisée pour surcharger l'expression régulière par défaut qui est utilisée pour valider les extensions des noms de fichiers mapfile.

source: The default value for this variable is::
fr: La valeur par défaut pour cette variable est::

source: The `MS_MAP_PATTERN` environment variable can be used to specify a Regular Expression that must be matched by all mapfile paths passed to the mapserv CGI in the map=... URL parameter.
fr: la variable d'environnement `MS_MAP_PATTERN` peut être utilisée pour spécifier une expression régulière qui doit être respectée par tous les chemins de mapfile passés au programme CGI mapserv dans le paramètre de l'URL map=...

source: If `MS_MAP_PATTERN` is not set then any .map file can be loaded.
fr: Si `MS_MAP_PATTERN` n'est pas défini alors n'importe quel fichier .map peut être chargé.

source: Example, use Apache's SetEnv? directive to restrict mapfiles to the /opt/mapserver/ directory and subdirectories::
fr: Example, utilisez la directive SetEnv? de Apache pour restreindre vos mapfiles au répertoire /opt/mapserver/ et à ses sous-répertoires::

source: Default value for the mode=... URL parameter. Setting mode=... in the URL takes precedence over the environment variable.
fr: La valeur par défaut pour le paramètre d'URL mode=... Définir le mode=... dans l'URL prend la précédence sur la variable d'environnement.

source: The URL to the OpenLayers javascript library (can be used when testing WMS services using imagetype application/openlayers), for instance::
fr: L'URL vers la bibliothèque javascript OpenLayers (peut être utilisée quand vous testez des services WMS en utilisant imagetype application/openlayers), par exemple::

source: Set the :ref:`WEB` `TEMPPATH`.
fr: Définir le `TEMPPATH` de :ref:`WEB`.

source: Used to enable XML Mapfile support. Points to the location of the XSLT to use for the XML->text mapfile conversion.
fr: Utilisé pour activer le support des Mapfiles XML. Pointe vers l'emplacement du XSLT à utiliser pour la conversion mapfile XML->mapfile texte.

source: The `PROJ_LIB` environment variable or `CONFIG` directive can be used to specify the directory where the PROJ.4 data files (including the "epsg" file) are located, if they are not in the default directory where PROJ.4 expects them.
fr: La variable d'environnement `PROJ_LIB` ou la directive `CONFIG` peut être utilisé pour spécifier le répertoire où les fichiers de données PROJ.4 (incluant le fichier "epsg") sont situés, s'ils ne sont pas dans le répertoire par défaut où PROJ.4 les attend.

source: `Setting the location of the epsg file` in :ref:`errors`.
fr: `Définir la localisation du fichier epsg` dans :ref:`errors`.

source: Environment variables
fr: Variables d'environnement
