Repository: geographika/MapServer-documentation
Catalog: translated/*/errors.po
Languages: ru

source: Errors
ru: Ошибки

source: drawEPP(): EPPL7 support is not available
ru: drawEPP(): EPPL7 поддержка не доступна

source: Error displayed when not using EPPL7 data.
ru: Выводится ошибка, когда не используются данные EPPL7.

source: This is a confusing error for users who are not even trying to view EPPL7 layers (EPPL7 is a raster format). The full error displayed may appear as follows:
ru: Эта ошибка, вводящая в заблуждение, для пользователей, кто даже не пытается выводить слои в формате EPPL7 (EPPL7 - это растровый формат). Полный текст ошибки может быть следующим:

source: Explanation
ru: Объяснение

source: When MapServer tries to draw a layer, it will attempt to use all of the drivers it knows about, and the EPPL7 driver is the very last driver it will try. This means that if a layer fails to draw for any reason, you will see this error message.
ru: Во время отрисовки слоя MapServer пытается использовать все доступные драйверы, и драйвер EPPL7 самый последний в списке. Это означает, что если произошел сбой в рендеринге слоя, по любой из причин, будет показано это сообщение об ошибке.

source: There are other possible instances when this error can appear however, here are a few:
ru: Есть и другие возможные случаи, когда эта ошибка может появиться, вот некоторые из них:

source: the server is returning either a ServiceException (which MapServer does not yet detect and parse into a reasonable error message) or it is returning an image in an unrecognized format ... for instance it is returning a GIF image and MapServer is not built to support GIF images.
ru: сервер возвращает или исключение ServiceException (которое MapServer не может распознать и разобрать в разумное сообщение об ошибке) или он возвращает изображение в нераспознанном формате... например, возвращает GIF картинку и MapServer собран без поддержки формата GIF.

source: WMS servers often advertise multiple image formats but don't respect them in the getmap request.
ru: Серверы WMS часто оповещают о поддержке множества форматов изображений, но не поддерживают их в запросе getmap.

source: loadLayer(): Unknown identifier. Maximum number of classes reached
ru: loadLayer(): Неизвестный идентификатор. Достигнут предел количества классов

source: Error displayed when attempting to draw a layer with a large number of classes.
ru: Показ ошибки когда пытаются отрисовать слой с большим количеством классов.

source: This error states that MapServer has reached its limit for the maximum number of classes for the layer. This maximum can be modified in the MapServer source, and can then be re-compiled. *map.h* contains the default values, and below are the defaults for MapServer 4.10 and 4.8:
ru: Эта ошибка утверждает, что MapServer достиг своего предела максимального числа классов в слое. Этот максимум может быть изменен в исходниках MapServer, с повторной компиляцией. Файл *map.h* содержит значения по умолчанию, и ниже приведены значения по умолчанию для MapServer 4.10 и 4.8:

source: This limitation was corrected in MapServer 5.0 and should no longer be a problem.
ru: Это ограничение было скорректировано в MapServer 5.0 и не должно больше беспокоить.

source: loadMapInternal(): Given map extent is invalid
ru: loadMapInternal(): Ошибка в охвате карты.

source: When loading your mapfile or one of your layers, MapServer complains about an invalid extent.
ru: Когда загружается ваш map-файл или один из ваших слоёв, MapServer жалуется на ошибку в охвате карты.

source: Beginning in MapServer 4.6, MapServer got more strict about LAYER and MAP extents. If minx is greater than maxx, or miny is greater than maxy, this error will be generated. Check your MAP's EXTENT, LAYER's EXTENT, or wms_extent setting to make sure this is not the case. MapServer **always** takes in extents in the form of:
ru: Начиная с версии MapServer 4.6, MapServer требует строгого указания охвата в разделах LAYER и MAP. Если minx больше, чем maxx, или miny больше, чем maxy, будет выдана ошибка. Проверьте параметры охвата EXTENT в MAP, охват EXTENT в LAYER , или в параметре wms_extent setting нет таких ошибок. MapServer **всегда** получает охват в виде:

source: How to get a file's EXTENT values?
ru: Как задавать значения EXTENT из файла?

source: The easiest way to get a vector file's EXTENT is to use the `ogrinfo`_ utility, that is part of the GDAL/OGR library (for raster files you would use the `gdalinfo`_ utility). Windows users can download the `FWTools`_ package, which includes all of the GDAL and OGR commandline utilities. `MS4W`_ also includes the utilities (in *ms4w/tools/gdal-ogr-utils/*). Linux users will probably already have the GDAL libraries, if not you can also use the `FWTools` package.
ru: Самым легким путем получить охват EXTENT векторного файла - это применение утилиты `ogrinfo`_, которая является частью библиотеки GDAL/OGR (для растровых файлов применяется утилита `gdalinfo`_). Пользователи Windows могут скачать пакет `FWTools`_, который включает все утилиты командной строки GDAL и OGR. `MS4W`_ также включает утилиты (в *ms4w/tools/gdal-ogr-utils/*). У пользователей Linux вероятно, уже есть библиотеки GDAL, если же нет, можете также использовать пакет `FWTools`.

source: For example, here is the results of the ogrinfo command on a shapefile (notice the "Extent" line):
ru: Например, вот результат команды ogrinfo на файле shapefile (обратите внимание на строку с "Extent"):

source: Ogrinfo gives the file's extent in the form of (minx, miny),(maxx, maxy), therefore the EXTENT in a mapfile would be:
ru: Утилита Ogrinfo передает охват файла в форме (minx, miny),(maxx, maxy), поэтому охват EXTENT в файле map будет таким:

source: The EXTENT in a mapfile must be in the same units as the :ref:`MAP` -level :ref:`PROJECTION`.
ru: Охват EXTENT в map файле должен быть таким же и в таких же единицах измерения как проекция :ref:`PROJECTION` в разделе :ref:`MAP`.

source: msGetLabelSize(): Requested font not found
ru: msGetLabelSize(): Запрошенный шрифт не найден.

source: Error displayed when attempting to display a specific font.
ru: Показывать ошибку, когда пытаются отобразить указанный шрифт.

source: This message tells you that MapServer cannot find specified font.
ru: Это сообщение сообщает вам, что MapServer не может найти указанны шрифт.

source: msLoadFontset(): Error opening fontset
ru: msLoadFontset(): ошибка открытия набора шрифтов

source: Error when attempting to display a label.
ru: Ошибка при попытке показать надпись.

source: This message tells you that MapServer cannot find the :ref:`FONTSET` specified in the :ref:`mapfile`.
ru: Это сообщение говорит, что MapServer не может найти шрифты из :ref:`FONTSET` определенного в :ref:`mapfile`.

source: msLoadMap(): Failed to open map file
ru: msLoadMap(): сбой открытия файла map

source: Error displayed when trying to display map image.
ru: Ошибка при попытке показать изображение карты.

source: The message tells you that MapServer cannot find map file or has problems with the map file. Verify that you have specified the correct path to the mapfile. Linux/Unix users should make sure that the web user has access permissions to the mapfile path as well. Verify that the map file using shp2img to make sure that the syntax is correct.
ru: Это сообщение говорит, что MapServer не может найти map файл или есть проблемы с map файлом. Проверьте указанный путь до map файла. Пользователи Linux/Unix должны убедиться, что веб-пользователи обладают правами на доступ к map файлу. Проверьте правильность синтаксиса утилиты shp2img применяемой для создания файла map.

source: The error message states where MapServer thinks the mapfile is:
ru: Сообщение об ошибке, о том где MapServer предполагает найти map файл:

source: msProcessProjection(): no options found in 'init' file
ru: msProcessProjection(): в 'init' файле отсутствуют параметры

source: Error displayed when attempting to use a specific projection.
ru: Ошибка показывается, когда пробуют использовать указанную проекцию.

source: The message tells you that the projection you're trying to use isn't defined in the epsg file. Open your epsg file in a text editor and search for your projection to make sure that it exists.
ru: Это сообщение говорит, что проекция пытаетесь использовать, не определена в файле epsg. Откройте файл epsg в текстовом редакторе и найдите требуемую проекцию, убедитесь, что она существует.

source: On Windows, the default location of the epsg file is *c:\\proj\\nad*. MS4W users will find the epsg file in *\\ms4w\\proj\\nad*.
ru: В Windows, файл epsg по умолчанию расположен в *c:\\proj\\nad*. Пользователи MS4W могут найти файл epsg в *\\ms4w\\proj\\nad*.

source: msProcessProjection(): No such file or directory
ru: msProcessProjection(): нет такого файла или папки

source: Error displayed when trying to refer to an epsg file.
ru: Ошибка показывается, когда пытаются указать путь к файлу epsg.

source: The message tells you that MapServer cannot find the epsg file.
ru: Это сообщение говорит о том, что MapServer не может найти файл epsg.

source: Linux/Unix users should be careful to **specify the correct case** when referring to the epsg file, since filenames are case sensitive on Linux/Unix. "init=epsg:4326" refers to the epsg filename, and therefore "init=EPSG:4326" will not work because it will be looking for an *EPSG* file in uppercase.
ru: Пользователи Linux/Unix должны внимательно указывать путь к файлу epsg, **соблюдая регистр**, так как имена файлов регистрозависимы в ОС Linux/Unix. Параметр "init=epsg:4326" ссылается на файл epsg, поэтому "init=EPSG:4326" не будет работать, сервер будет искать файл *EPSG* в верхнем регистре.

source: Setting the location of the epsg file
ru: Указание расположения файла epsg

source: There are a few options available if you need to set the epsg location:
ru: Для уточнения расположение epsg есть несколько параметров:

source: Use a system variable ("environment variable" on windows) called "PROJ_LIB" and point it to your epsg directory.
ru: Используйте системную переменную ("переменные среды окружения" в windows) с именем "PROJ_LIB" и укажите в ней вашу epsg папку.

source: Use the mapfile parameter CONFIG to force the location of the epsg file. This parameter is specified at the MAP level
ru: Можно использовать параметр CONFIG в map файле для принудительного указания пути к файлу epsg. Этот параметр указывается на уровне MAP.

source: Set an environment variable through your web server. Apache has a SetEnv directive that can set environment variables. Add something like the following to your Apache *httpd.conf* file:
ru: Можно задать переменную окружения в веб-сервере. В Apache есть директива SetEnv, которая может содержать переменные окружения. Добавьте что-то вроде этого в ваш Apache конфигурационный файл *httpd.conf*:

source: msProcessProjection(): Projection library error.major axis or radius = 0 not given
ru: msProcessProjection(): Ошибка в библиотеке проекций. Главная ось или радиус = 0 или не заданы

source: Error displayed when attempting to specify projection parameters.
ru: Ошибка при попытке показать изображение в указанной проекции (параметрах проекции).

source: Since MapServer 4.0, you are required to specify the ellipsoid for the projection. Omitting this ellipsoid parameter in later MapServer versions will cause this error.
ru: Начиная с MapServer 4.0, требуется указать эллипсоид данной проекции. Пропуск параметра о эллипсоиде приведет, в более поздних версиях MapServer, к ошибке.

source: Valid Examples
ru: Правильные примеры:

source: 4.0 and newer:
ru: 4.0 и новее:

source: before MapServer 4.0:
ru: до версии MapServer 4.0:

source: msQueryByPoint: search returned no results
ru: msQueryByPoint: поиск вернул пустой результат

source: Why do I get the message "msQueryByPoint(): Search returned no results. No matching record(s) found" when I query a feature known to exists?
ru: Почему получаю ошибку "msQueryByPoint(): поиск вернул пустой результат. Нет подходящей(их) записи(ей)", когда запрашиваются объекты, о которых точно известно, что существуют?

source: The query feature requires a TEMPLATE object in the CLASS object of your LAYER definition. The value points to a html fragment using MapServer template syntax.
ru: Запрос объекта требует объекта-шаблона TEMPLATE в объекте CLASS вашего описания слоя LAYER. Для значений точек во фрагменте html применяется синтаксис шаблонов MapServer.

source: Example MapFile fragment:
ru: Например, фрагмент из Map-файла:

source: Example Template:
ru: Пример шаблона:

source: The [lrn] is a special keyword that indicates the resulting line number which starts at 1. [PIN] is the name of a feature attribute.
ru: Специальное ключевое слово [lrn] это индикатор строки в результате, начинается с 1. [PIN] - это имя атрибута объекта.

source: msReturnPage(): Web application error. Malformed template name
ru: msReturnPage(): Ошибка веб приложения. Неправильное имя шаблона

source: This error may occur when you are attempting to use a URL template for a query. The issue is that URL templates are only allowed for query modes that return only one result (e.g. query or itemquery)
ru: Может возникнуть ошибка, когда пытаетесь использовать шаблон URL для запросов. Проблема в том, что шаблоны URL разрешены только для режимов запросов MODE, возвращающих единственный результат (так как query или itemquery)

source: You can only use a URL template for a query in mode=query or mode=itemquery. If you try it with mode=nquery or mode=itemnquery, you will get the error:
ru: Вы можете использовать шаблоны URL для запросов в режимах mode=query или mode=itemquery. Если попытаться выполнить запрос в режиме mode=nquery или mode=itemnquery, будет выдана ошибка:

source: msSaveImageGD(): Unable to access file
ru: msSaveImageGD(): нет досутпа к файлу

source: Error displayed when attempting to display map image.
ru: Ошибка при попытке показать изображение карты.

source: This error is displayed if MapServer cannot display the map image. There are several things to check:
ru: Ошибка отображается, если MapServer не может показать изображение карты. Вот несколько причин для проверки:

source: IMAGEPATH and IMAGEURL parameters in mapfile are valid
ru: Заданы правильные параметры IMAGEPATH и IMAGEURL в map-файле

source: In CGI mode, any IMAGEPATH and IMAGEURL variables set in the init pages are valid
ru: В режиме CGI, в страницах init, параметры IMAGEPATH и IMAGEURL заданы правильно.

source: Linux/Unix users should verify that the web user has permissions to write to the IMAGEPATH
ru: Пользователи Linux/Unix должны убедиться, что веб-пользователь обладает правами на запись в IMAGEPATH

source: msWMSLoadGetMapParams(): WMS server error. Image Size out of range, WIDTH and HEIGHT must be between 1 and 2048 pixels
ru: msWMSLoadGetMapParams(): ошибка сервера WMS. Размер изображения вышел за пределы, ширина WIDTH и высота HEIGHT должны быть между 1 и 2048 пикселями

source: Error that is returned / displayed when a user has requested a map image (via WMS) that exceeds the maximum width or height that the service allows.
ru: Ошибка, которая возвращается/показывается, когда пользователь запрашивает изображение карты (через WMS), превышающая максимально разрешенные ширину и высоту для этого сервиса.

source: To increase the maximum map width and height for the service, use the MAXSIZE parameter of the :ref:`MAP` object. Producing larger map images requires more processing power and more memory, so take care.
ru: Для увеличения максимально допустимых ширины и высоты карты, создаваемой сервисом, используйте параметр MAXSIZE в объекте :ref:`MAP`. Построение больших карт требует больших мощностей и больше памяти, поэтому будьте внимательны.

source: One of the dll-s could not be loaded that mapscript.dll depends on.
ru: Одна из библиотек dll, от которой зависит mapscript.dll, не может быть загружена.

source: You can get this problem on Windows and in most cases it can be dedicated to a missing or an unloadable shared library. The error message talks about mapscript.dll but surely one or more of the dll-s are missing that libmap.dll depends on. So firstly you might want to check for the dependencies of your libmap.dll in your application directory. You can use the Visual Studio Dependency Walker to accomplish this task. You can also use a file monitoring tool (like SysInternal's filemon) to detect the dll-s that could not be loaded. I propose to store all of the dll-s required by your application in the application folder. If you can run the mapscript sample applications properly your compilation might be correct and all of the dlls are available.
ru: Вы можете получить эту проблему на Windows, и в большинстве случаев может быть связана с отсутствующей или незагружаемой общей библиотекой. Сообщение об ошибке говорит о mapscript.dll, но безусловно отсутствует одна или несколько из DLL библиотек, от которых зависит libmap.dll. Таким образом, в первую очередь вы можете проверить зависимости вашего libmap.dll в каталоге приложения. Для этой задачи вы можете использовать Visual Studio Dependency Walker. Далее вы можете использовать инструмент мониторинга файлов (например SysInternal's filemon), чтобы обнаружить библиотеки DLL, которые не могут быть загружены. Я предлагаю хранить все библиотеки DLL, требуемые вашему приложению, в папке приложения. Если вы можете запускать примеры приложений mapscript правильно, значит ваша сборка правильная и все библиотеки DLL доступны.

source: C#-specific information
ru: C#-специфичная информация

source: You may find that the mapscript C# interface behaves differently for the desktop and the ASP.NET applications. Although you can run the drawmap sample correctly you may encounter the dll loading problem with the ASP.NET applications. When creating an ASP.NET project your application folder will be '\Inetpub\wwwroot\[YourApp]\bin' by default. The host process of the application will aspnet_wp.exe or w3wp.exe depending on your system. The application will run under a different security context than the interactive user (under the context of the ASPNET user by default). When placing the dll-s outside of your application directory you should consider that the PATH environment variable may differ between the interactive and the ASPNET user and/or you may not have enough permission to access a dll outside of your application folder.
ru: Вы можете обнаружить, что интерфейс mapscript C# ведет себя по-разному в приложениях пользователя и приложениях ASP.NET. Хотя вы можете правильно запустить рендеринг карты, вы можете столкнуться с проблемой загрузки библиотек DLL в приложениях ASP.NET. Во время создания проекта ASP.NET ваша папка приложения будет по умолчанию '\Inetpub\wwwroot\[YourApp]\bin'. Хост процесс приложения будет aspnet_wp.exe или w3wp.exe, в зависимости от системы. Приложение будет запущено в другом контексте безопасности, отличном от интерактивного пользователя (по умолчанию, под контекстом пользователя ASPNET). При размещении библиотеки DLL-s вне директории вашего приложения следует учитывать, что переменная окружения PATH может отличаться между интерактивным пользователем и пользователем ASPNET и / или у вас может не хватать разрешений на доступ к DLL за пределами вашей папки приложения.
