Repository: geographika/MapServer-documentation
Catalog: translated/*/faq.po
Languages: fr

source: Where is the MapServer log file?
fr: Où sont les fichiers logs de MapServer ?

source: See :ref:`rfc28`
fr: Voir :ref:`rfc28`

source: What books are available about MapServer?
fr: Quels livres sont disponible sur MapServer ?

source: `"Mapping Hacks" <http://www.oreilly.com/catalog/mappinghks/>`__ by Schuyler Erle, Rich Gibson, and Jo Walsh is available from O'Reilly.
fr: `"Mapping Hacks" <http://www.oreilly.com/catalog/mappinghks/>`__ par Schuyler Erle, Rich Gibson, et Jo Walsh est disponible via O'Reilly.

source: `"Web Mapping Illustrated" <http://oreilly.com/catalog/webmapping>`__ by Tyler Mitchell is available from O'Reilly. Introduces MapServer and many other related technologies including, GDAL/OGR, MapScript, PostGIS, map projections, etc.
fr: `"Web Mapping Illustrated" <http://oreilly.com/catalog/webmapping>`__ par Tyler Mitchell est disponible chez O'Reilly. Introduit MapServer et plusieurs autres outils connexes dont GDAL/OGR, MapScript, PostGIS, les projections cartographiques, etc.

source: `"MapServer: Open Source GIS Development" <http://www.apress.com/book/bookDisplay.html?bID=443>`__ by Bill Kropla.
fr: `"MapServer: Open Source GIS Development" <http://www.apress.com/book/bookDisplay.html?bID=443>`__ par Bill Kropla.

source: How do I compile MapServer for Windows?
fr: Comment je compile MapServer pour Windows ?

source: See :ref:`win32`. Also, you can use the development libraries in :ref:`OSGeo4W <windows>` as a starting point instead of building all of the dependent libraries yourself.
fr: Voir :ref:`win32`. Vous pouvez également utiliser les bibliothèques de développement sur :ref:`OSGeo4W <windows>` comme base de départ au lieu de compiler toutes les dépendances vous même.

source: What do MapServer version numbers mean?
fr: Que signifie les numéros de version de MapServer ?

source: MapServer's version numbering scheme is very similar to Linux's. For example, a MapServer version number of 4.2.5 can be decoded as such:
fr: Le schéma de numérotation des versions de MapServer est très similaire à celui de Linux. Par exemple, un numéro de version de MapServer de 4.2.5 peut être décodé comme cela :

source: 4: Major version number. MapServer releases a major version every two to three years.
fr: 4: Numéro de version majeur. MapServer publie une version majeure tous les deux ou trois ans.

source: 2: Minor version number. Increments in minor version number almost always relate to additions in functionality.
fr: 2 : Numéro de version mineur. L'incrémentation d'un numéro de version mineure est toujours lié à des ajouts de fonctionnalités.

source: 5: Revision number. Revisions are bug fixes only. No new functionality is provided in revisions.
fr: 5 : Numéro de révision. Les révisions sont des corrections de bug seulement. Aucune nouvelle fonctionnalité n'est fournie dans ces révisions.

source: From a developer's standpoint, MapServer version numbering scheme is also like Linux. Even minor version numbers (0..2..4..6) relate to *release* versions, and odd minor versions (1..3..5..7) correspond to developmental versions.
fr: D'un point de vue d'un développeur, le schéma de numérotation des versions de MapServer est identique à celle de Linux. Les numéros de version pairs (0..2..4..6) sont des versions publiées, et les versions impairs (1..3..5..7) correspondent à des versions de développement.

source: Is MapServer Thread-safe?
fr: Est ce que MapServer est Thread-safe?

source: **Q**: Is MapServer thread-safe?
fr: **Q** : Est ce que MapServer est thread-safe?

source: **A**: Generally, no (but see the next question). Many components of MapServer use static or global data that could potentially be modified by another thread. Under heavy load these unlikely events become inevitable, and could result in sporadic errors.
fr: **R** : D'un point de vue générale, non (mais lisez la section suivante). Plusieurs composants de MapServer utilisent des données globales ou statiques qui peuvent être potentiellement modifiées par un autre thread. Sous une charge importante cela devient inévitable et il peut subvenir des erreurs ponctuelles.

source: **Q**: Is it possible to safely use any of MapServer in a multi-threaded application?
fr: **Q** : Est il possible d'utiliser MapServer dans une application multi-threadée en toute sécurité ?

source: **A**: Some of it, yes, with care. Or with Python :) Programmers must either avoid using the unsafe components of MapServer or carefully place locks around them. Python's global interpreter lock immunizes against MapServer threading problems; since no mapscript code ever releases the GIL all mapscript functions or methods are effectively atomic. Users of mapscript and Java, .NET, mod_perl, or mod_php do not have this extra layer of protection.
fr: **R** : Certaines oui, avec une attention particulière. Ou avec Python :) Les développeurs doivent soit éviter d'utiliser des composants non sécurisés de MapServer ou placer soigneusement des blocages sur ceux-ci. Le blocage de l'interpréteur global de Python immunise contre les problèmes de threading de MapServer ; puisque aucun code mapscript ne publie le GIL toutes les fonctions ou méthodes de MapServer sont atomiques. Les utilisateurs de mapscript et de JAVA, .NET, mod_perl, ou mod_php n'ont pas cette couche supplémentaire de protection.

source: **A**: Which components are to be avoided?
fr: **Q** : Quels composants doivent être évités?

source: **Q**: Below are lists of unsafe and unprotected components and unsafe but locked components.
fr: **R** : Voici ci-dessous la liste des composants non protégés ou non sécurisés et les composants non sécurisés mais bloqués.

source: Unsafe:
fr: Non sécurisé :

source: OGR layers: use unsafe CPL services
fr: Couches OGR : utilisation de services CPL non sécurisé

source: Cartoline rendering: static data
fr: Rendu Cartoline : données statiques

source: Imagemap output: static data
fr: Export Imagemap : données statiques

source: SWF output: static data and use of unsafe msGetBasename()
fr: Export SWF : données statiques et utilisation de msGetBasename() non sécurisé

source: SVG output: static data
fr: Export SVG : données statiques

source: WMS/WFS server: static data used for state of dispatcher
fr: Serveur WMS/WFS : données statiques utilisées pour l'état du dispatcher

source: Forcing a temporary file base (an obscure feature): static data
fr: Forcer une base de fichiers temporaires (une fonctionnalité obscure) : données statiques

source: MyGIS: some static data
fr: MyGIS : quelques données statiques

source: Unsafe, but locked:
fr: Non sécurisé, mais bloqué:

source: Map config file loading: global parser
fr: Chargement du fichier map de configuration : parseur global

source: Setting class and and layer filter expressions (global parser)
fr: Définition des expressions de filtre de couche ou de classe (parseur global)

source: Class expression evaluation (global parser)
fr: Évaluation des expressions des classes (parseur global)

source: Setting map and layer projections (PROJ)
fr: Définition des projections des couches et des cartes (PROJ)

source: Raster layer rendering and querying (GDAL)
fr: Requêtage et rendu des couches raster (GDAL)

source: Database Connections (mappool.c)
fr: Connexion aux bases de données (mappool.c)

source: PostGIS support
fr: Gestion de PostGIS

source: Oracle Spatial (use a single environment handle for connection)
fr: Oracle Spatial (utilise une simple prise en charge de l'environnement pour la connexion)

source: SDE support (global layer cache)
fr: Gestion de SDE (cache global des couches)

source: Error handling (static repository of the error objects)
fr: Prise en charge des erreurs (dépôt statique des objets erreur)

source: WMS/WFS client connections: potential race condition in Curl initialization
fr: Connexions cliente de WMS/WFS : condition de course (potential race) potentielle dans l'initialisation de Curl

source: Plugin layers (static repository of the loaded dll-s)
fr: Couches Plugin (dépôt statique de dll-s chargés)

source: Rather coarse locks are in place for the above. Only a single thread can use the global parser at a time, and only one thread can access GDAL raster data at a time. Performance is exchanged for safety.
fr: Des serrures secondaires sont plutôt mis en place pour ce qui précède. Seul un thread peut utiliser un parseur global à la fois, et seul un thread peut accéder à des données raster par GDAL au même moment. La performance est échangée pour la sécurité.

source: What does STATUS mean in a LAYER?
fr: Que signifie STATUS dans une LAYER ?

source: STATUS ON and STATUS OFF set the default status of the layer. If a map is requested, those layers will be ON/OFF unless otherwise specified via the layers parameter. This is particularly the case when using MapScript and MapServer's built-in template mechanism, but is also useful as a hint when writing your own apps and setting up the initial map view.
fr: STATUS ON et STATUS OFF définissent le statut par défaut de la couche. Si une couche est demandée, ces couches seront définies à ON/OFF à moins que cela soit définie différemment via le paramètre LAYER. Cela est particulièrement le cas lorsque vous utilisez MapScript et le mécanisme de template interne de MapServer, mais c'est également utile lorsque vous écrivez vos propres applications et définissez la vue initiale de la carte.

source: STATUS DEFAULT means that the layer is always on, even if not specified in the layers parameter. A layer's status can be changed from DEFAULT to OFF in MapScript, but other than that, it's always on.
fr: STATUS DEFAULT signifie que la couche est toujours affichée, même si elle n'est pas définie dans le paramètre LAYER. Le status de la couche peut être changé de DEFAULT à OFF en MapScript, sinon elle est toujours à ON.

source: :ref:`cgi` turns everything off that is not "STATUS DEFAULT" off so all layers start from the same state (e.g. off) and must be explicitly requested to be drawn or query. That common state made (at least in my mind) implementations easier. I mean, if a layer "lakes" started ON the doing layer=lakes would turn it OFF. So I wanted to remove the ambiguity of a starting state.
fr: :ref:`cgi` modifie toutes les valeurs qui ne sont pas en STATUS DEFAULT à la valeur OFF afin que toutes les couches démarrent dans le même état (c'est à dire à OFF) et doit être explicitement demandée pour être dessinée ou interrogée. Cet état commun rend le développement plus facile (du moins dans mon esprit). Je veux dire que si une couche "lakes" est définie à ON, l'appel de layer=lakes la rendra à OFF. Je veux donc supprimer cette ambiguïté au démarrage.

source: How can I make my maps run faster?
fr: Comment puis rendre le rendu de mes cartes plus rapide ?

source: There are a lot of different approaches to improving the performance of your maps, aside from the obvious and expensive step of buying faster hardware. Here are links to some individual howtos for various optimizations.
fr: Il y a de nombreuses approches différentes pour améliorer les performances de votre carte, à part bien évidemment d'acheter du matériel onéreux et plus rapide. Voici quelques liens de howto individuels de différentes optimisations.

source: :ref:`Tuning your mapfile for performance <mapfile_tuning>`
fr: :ref:`Tunez votre mapfile pour améliorer les performances <mapfile_tuning>`

source: :ref:`Optimizing the performance of vector data sources <vector_optimization>`
fr: :ref:`Optimiser les performances des sources de données vecteurs <vector_optimization>`

source: :ref:`Optimizing the performance of raster data sources <raster_optimization>`
fr: :ref:`Optimiser les performances des sources de données raster <raster_optimization>`

source: :ref:`Tileindexes for mosaicing and performance <tileindex>`
fr: :ref:`Tileindexes pour mosaïquer et améliorer les performances <tileindex>`

source: Some general tips for all cases:
fr: Quelques astuces générales pour tous les cas:

source: First and foremost is hardware. An extra GB of RAM will give your map performance increases beyond anything you're likely to achieve by tweaking your data. With the price of RAM these days, it's cheap and easy to speed up every map with one inexpensive upgrade.
fr: Tout d'abord le matériel. Un barrette de RAM d'un GB améliorera les performances au delà de toutes considérations de tuning de vos données. Au prix de la RAM de nos jours, cela est peu onéreux et facile d'accélérer chaque rendu de carte avec une amélioration matérielle peu coûteuse.

source: Use the scientific method. Change one thing at a time, and see what effect it had. Try disabling all layers and enabling them one at a time until you discover which layer is being problematic.
fr: Utilisez des méthodes scientifique. Changez une chose à la fois, et regardez quel effet cela entraîne. Essayez de désactiver toutes les couches puis activez-les une par une jusqu'à ce que vous trouviez celle qui pose problème.

source: Use :ref:`shp2img` program to time your results. This runs from the command line and draws an image of your entire map. Since it's run from the command line, it is immune to net lag and will give more consistent measurements that your web browser.
fr: Utilisez le programme :ref:`shp2img` pour chronométrer vos résultats. Celui-ci est lancé à partir de la ligne de commande et dessine une image de votre carte entière. Puisqu'il est lancé à partir de la ligne de commande, il ne subit pas les délais d'Internet et vous donnera des mesures plus cohérentes que votre navigateur.

source: What does Polyline mean in MapServer?
fr: Que signifie Polyline dans MapServer ?

source: There's confusion over what POLYLINE means in MapServer and via ESRI. In MapServer POLYLINE simply means a linear representation of POLYGON data. With ESRI polyline means multi-line. Old versions of the Shapefile techical description don't even refer to polyline shapefiles, just line. So, ESRI polyline shapefiles are just linework and can only be drawn and labeled as LINE layers. Those shapefiles don't have feature closure enforced as polygon shapefiles do which is why the distinction is so important. I suppose there is a better choice than POLYLINE but I don't know what it would be.
fr: Il y a des confusions entre la signification de POLYLINE dans MapServer et ESRI. Dans MapServer POLYLINE signifie simplement une représentation linéaire de données POLYGON. Avec ESRI les polylignes signifie multi-ligne. Les anciennes versions de la description technique du Shapefile ne parlent même pas des polylignes, juste des lignes. Les Shapefiles polyligne d'ESRI sont juste des lignes et peuvent seulement être dessinés comme des couches LINE. Ces shapefiles n'ont pas de contraintes de fermeture géométrique comme les Shapefiles polygonaux, c'est pourquoi la distinction est si importante. Je suppose qu'il y a un meilleur choix que POLYLINE mais je ne vois pas lequel.

source: The only difference between POLYLINE and LINE layers is how they are labeled.
fr: La seule différences entre les couches POLYLINE et LINE est la manière dont les étiquettes sont placées.

source: What is MapScript?
fr: Qu'est ce que MapScript ?

source: MapScript is the scripting interface to MapServer, usually generated by :term:`SWIG` (except in the case of :ref:`phpmapscriptapi`). MapScript allows you to program with MapServer's objects directly instead of interacting with MapServer through its :ref:`cgi` and :ref:`mapfile`.
fr: MapScript est l'interface de script de MapServer, généré habituellement par :term:`SWIG` (sauf pour :ref:`php`). MapScript vous permet de programmer avec les objets de MapServer directement au lieu d'interagire avec MapServer via le script :ref:`cgi` et les :ref:`mapfile`.

source: Does MapServer support reverse geocoding?
fr: Est ce que MapServer gère le reverse-géocoding?

source: No.
fr: Non

source: Reverse geocoding is an activity where you take a list of street features that you already have and generate postal addresses from them. This kind of spatial functionality is provided by proprietary packages such as the ESRI suite of tools, as well as services such as those provided by GDT. MapServer is for *map rendering*, and it does not provide for advanced spatial operations such as this.
fr: Le reverse géocoding est la possibilité de générer des adresses postales à partir d'une liste de géométries. Ce type de fonctionnalité spatiale est fournie par des applications propriétaires telles que la suite ESRI ou par des services tels que ceux fournis par GDT. MapServer sert au *rendu cartographique* et ne fournit pas d'opérations spatiales avancées telle que celle-ci.

source: Does MapServer support geocoding?
fr: Est ce que MapServer gère le géocoding?

source: Geocoding is an activity where you take a list of addresses and generate lat/lon points for them. This kind of spatial functionality is provided by proprietary packages such as the ESRI suite of tools, as well as services such as those provided by GDT. MapServer is for *map rendering*, and it does not provide for advanced spatial operations such as this.
fr: Le géocoding est la possibilité de générer des points en latitude et longitude à partir d'une liste d'adresses.. MapServer sert au *rendu cartographique* et ne fournit pas d'opérations spatiales avancées telle que celle-ci.

source: If you are using MapScript, there is a free geocder available through XMLRPC and SOAP at http://geocoder.us . You could hook you application up to use this service to provide lat/lon pairs for addresses, and then use MapServer to display those points.
fr: Si vous utilisez MapScript, il y a un géocoder libre disponible à travers XMLRPC et SOAP à http://geocoder.us . Vous pouvez lier votre application à ce service pour fournir des coordonnées pour les adresses, puis utiliser MapServer pour afficher ces points.

source: How do I set line width in my maps?
fr: Comment je définis une largeur de ligne dans ma carte ?

source: In the current MapServer version, line width is set using the STYLE parameter WIDTH. For a LINE layer, lines can be made red and 3 pixels wide by using the following style in a CLASS.
fr: Dans la version courante de Mapserver, la largeur de ligne est définie en utilisant le paramètre WIDTH de l'objet STYLE. Pour une couche LINE, les lignes peuvent être rouges et avec 3 pixels de large en utilisant le style suivant dans une CLASS.

source: In earlier versions of MapServer , you could set the symbol for the LAYER to 'circle' and then you can set the symbol SIZE to be the width you want. A 'circle' symbol can be defined as
fr: Dans les versions antérieures de Mapserver, vous pouviez définir le symbole pour une LAYER à 'circle' et ensuite ensuite vous pouviez définir la taille SIZE du symbole à la largeur souhaitée. Un symbole 'circle' peut être défini comme

source: Why do my JPEG input images look crappy via MapServer?
fr: Pourquoi mes images en JPEG sont "moches" via MapServer ?

source: You must be using an old version of MapServer (where GD was the default library for rendering).
fr: Vous devez utiliser une vieille version de Mapserver (où GD était la bibliothèque par défaut pour le rendu).

source: Newer versions of MapServer use AGG for rendering, and the default output formats is 24 bit colour, so there should not be a problem.
fr: Les nouvelles versions de Mapserver utilise AGG pour le rendu, et les formats de sortie par défaut sont en couleurs 24 bits, ainsi il ne devrait pas y avoir de problèmes.

source: The default output format for MapServer with GD was 8bit pseudo-colored PNG or GIF. Inherently there will be some color degradation in converting a 24bit image (16 million colors) image into 8bit (256 colors).
fr: Le format de sortie par défaut pour Mapserver avec GD était le PNG ou le GIF en pseudo-couleurs 8 bits. Par conséquent, il y aura une dégradation des couleurs en convertissant une image 24 bits image (16 million de couleurs ) en image 8 bits (256 couleurs).

source: With GD output, MapServer used quite a simple method to do the transformation, converting pixels to the nearest color in a 175 color colorcube. This would usually result in blotchy color in a fairly smoothly varying image.
fr: Avec la sortie GD, MapServer utilisait une méthode assez simple pour faire la transformation, en convertissant les pixels dans la couleur la plus proche à partir d'un cube de couleurs de 175 couleurs. Cela devait donner une couleur marbrée avec une variation d'image assez douce.

source: For GD, solutions used to be:
fr: Pour GD, les solutionsutiliées étaient de

source: Select 24bit output. This might be as easy as "IMAGETYPE JPEG" in your MAP section.
fr: Sélectionner un rendu en 24 bits. Cela peut être aussi facile que de rajouter "IMAGETYPE JPEG" dans votre objet MAP.

source: Enable dithering (PROCESSING "DITHER=YES") to produce a better color appearance.
fr: Activer le tramage (PROCESSING "DITHER=YES") pour produire une meilleure apparence des couleurs.

source: Preprocess your image to 8bit before using it in MapServer with an external application like the GDAL rgb2pct.py script.
fr: Prétraiter vos images en 8 bit avant de l'utiliser dans MapServer avec une application externe comme le script rgb2pct.py de GDAL.

source: For more information review the :ref:`raster`.
fr: Pour plus d'informations, lisez :ref:`raster`.

source: Which image format should I use?
fr: Quel format d'image doit je utiliser?

source: Although MapScript can generate the map in any desired image format it is sufficient to only consider the three most prevalent ones: JPEG, PNG, and GIF.
fr: Bien que MapScript puisse générer une carte dans n'importe quel format d'image, il est suffisant de considérer les trois plus importants : JPEG, PNG, et GIF.

source: JPEG is an image format that uses a lossy compression algorithm to reduce an image's file size and is mostly used when loss of detail through compression is either not noticeable or negligible, as in most photos. Maps on the other hand mainly consist of fine lines and areas solidly filled in one colour, which is something JPEG is not known for displaying very well. In addition, maps, unless they include some aerial or satellite imagery, generally only use very few different colours. JPEG with its 24bit colour depth capable of displaying around 16.7 million colours is simple not suitable for this purpose. GIF and PNG however use an indexed colour palette which can be optimized for any number (up to 256) of colours which makes them the perfect solution for icons, logos, charts or maps. The following comparison (generated file sizes only; not file generation duration) will therefore only include these two file formats:
fr: JPEG est un format d'image qui utilise un algorithme de compression avec perte pour réduire la taille de l'image et qui est utilisé lorsque la perte de détails à cause de la compression n'est pas visible ou est négligeable comme dans la plupart des photos. Les cartes d'un autre côté consistent principalement en des lignes fines et en surfaces colorées, ce qui n'est pas connu pour être bien affiché par le format JPEG. De plus les cartes, sauf si elles incluent des images aériennes et satellites, utilisent généralement très peu de couleurs. Le format JPEG avec sa profondeur de couleur à 24 bits, capable d'afficher environ 16,7 millions de couleurs n'est simplement pas adapté pour cela. Les formats GIF et PNG, eux, utilisent une palette de couleur indexée qui peut être optimisée pour n'importe quel nombre (jusqu'à 256) de couleurs ce qui les rend pertinents pour les icônes, logos, graphique et cartes. La comparaison suivante (taille des fichiers images générés; et pas la durée de génération des fichiers) incluera donc ces deux formats de fichiers :
