Repository: geographika/MapServer-documentation
Catalog: translated/*/faq.po
Languages: fr

source: The next parameter in the command is "-t_srs EPSG:32130". This command tells ogr2ogr to transform the data to the EPSG code of 32130. After this is declared, all you need to do is declare a file name for your new shape file and to set which file is being used as the input (note: make sure you don’t confuse the order of these two).
fr: Le prochain paramètre dans la commande est "-t_srs EPSG:32130". Cette commande dit à ogr2ogr de transformer la donnée vers le code EPSG 32130. Après que cette déclaration, tout ce qu'il reste à faire est de déclarer un nom de fichier pour votre nouveau fichier shape et de définir quel fichier est utilisé en entrée (attention: assurez-vous de ne pas inverser l'ordre de ces deux derniers).

source: Hit enter, bombs away, and enjoy your new data in meters!
fr: Tapez entrée, laissez mouliner et apprécier votre nouvelle donnée en mètres!

source: How can I help improve the documentation on this site?
fr: Comment puis-je aider à améliorer la documentation sur ce site?

source: New documentation material and corrections to existing documentation are definitely very welcome. These contributions are handled through the same issue tracker used to track software bugs and enhancements.
fr: Des nouveaux contenus pour la documentation et des corrections sur la documentation existante sont particulèrement bienvenues. Ces contributions sont gérées par le même gestionnaire de suivi de problèmes utilisé pour suivre les bugs et les améliorations du logiciel.

source: Follow the directions for submitting bugs at: http://www.mapserver.org/development/bugs.html. When creating a ticket, in the Component field, select `MapServer Documentation`. If our ticket pertains to a specific web page, please include the URL to that page.
fr: Suivre les instructions pour soumettre des bugs à: http://www.mapserver.org/development/bugs.html. Quand vous créez un ticket, dans le champ Component, sélectionnez `MapServer Documentation`. Si votre ticket concerne porte sur une page web spécifique, merci d'inclure l'URL vers cette page.

source: If you have tips or examples that don't really fit the definition of documentation, a good place to put them is the MapServer wiki at: https://github.com/mapserver/mapserver/wiki
fr: Si vous avez des astuces ou des exemples qui ne paraissent pas correspondre au but de cette documentation, un bon endroit pour les partager est le wiki MapServer sur: https://github.com/mapserver/mapserver/wiki

source: What's with MapServer's logo?
fr: Que signifie le logo de MapServer ?

source: The MapServer logo illustrates the confluence of the `Minnesota`_ and `Mississippi`_ rivers, quite near to the home of the `St. Paul Campus`_ of the `University of Minnesota`_, which was the `birthplace of MapServer`_.
fr: Le logo de MapServer illustre la confluence des fleuves `Minnesota`_ et `Mississippi`_, proche de la maison de `St. Paul Campus`_ de l'`Université du Minnesota`_, qui était le `lieu de naissance de MapServer`_.
