Repository: geographika/MapServer-documentation
Catalog: translated/*/faq.po
Languages: fr

source: GIF vs. PNG vs. PNG24 Generated Map File Sizes
fr: Tailles de fichier Map générés GIF vs. PNG vs. PNG24

source: Vector Data only
fr: Données vecteur seulement

source: Vector Data & Satellite Image coloured
fr: Données vecteur et images satellites colorées

source: Vector Data & Satellite Image monochrome
fr: Données vecteur et images satellites monochromes

source: (results based on an average 630x396 map with various colours, symbols, labels/annotations etc.)
fr: (résultats basés sur une carte de 630x396 avec plusieurs couleurs, symboles, étiquettes/annotations, etc.)

source: Although GIF shows a quantitative as well as qualitative advantage over PNG when generating maps that contain full coloured remote sensing imagery, PNG is the clear quantitative winner in terms of generated file sizes for maps with or without additional monochrome imagery and should therefore be the preferred image format. If the mapping application however can also display fullcolour aerial or satellite imagery, the output file format can be changed dynamically to either GIF or even PNG24 to achieve the highest possible image quality.
fr: Bien que le format GIF montre des performances quantitatives ainsi que qualitatives supérieures par rapport au format PNG lors de la génération d'une carte qui contient des images colorées de télédétection, le format PNG est clairement le vainqueur quantitatif en terme de taille de fichiers générés pour les cartes avec ou sans images additionnelles monochromes et doit donc être le format d'image préféré. Si l'application cartographique peut aussi afficher des images satellites ou aériennes en pleine couleur, le format de fichier en sortie peut être changé dynamiquement en format GIF ou format PNG24 pour atteindre la qualité d'image la plus importante possible.

source: Why doesn't PIL (Python Imaging Library) open my PNGs?
fr: Pourquoi la bibliothèque PIL (Python Imaging Library) n'ouvre pas mes PNG?

source: `PIL <http://www.pythonware.com/products/pil/>`__ does not support interlaced PNGs at this time (no timetable on when it actually will either). To be able to read PNGs in PIL, they must not be interlaced. Modify your OUTPUTFORMAT with a FORMATOPTION like so:
fr: `PIL <http://www.pythonware.com/products/pil/>`__ ne gère pas les PNG entrelacés pour l'instant (aucune planification pour cela le sera n'a été définie). Pour lire des PNG dans PIL, ceux-ci ne doivent pas être entrelacés. Modifier l'objet OUTPUTFORMAT avec un paramètre FORMATOPTION comme ceci :

source: Why do my symbols look poor in JPEG output?
fr: Pourquoi mes symboles paraissent fades dans les rendus JPEG?

source: When I render my symbols to an 8bit output (PNG, GIF) they look fine, but in 24bit jpeg output they look very blocky and gross.
fr: Quand je fais un rendu de mes symboles en 8 bit (PNG, GIF) ils sont bien rendus, mais pour un rendu en jpeg en 24 bits ils paraissent vraiment moches.

source: You must be using an old version of MapServer . This should not be problem with newer versions. The following explains the old (GD) behaviour.
fr: Vous devez utiliser une ancienne version de Mapserver. Cela ne devrait plus être un problème avec les nouvelles versions. Ce qui suit explique l'ancien (avec GD) comportement

source: In order to render some classes of symbols properly in 24bit output, such as symbols from true type fonts, it is necessary to force rendering to occur in RGBA. This can be accomplished by including the "TRANSPARENCY ALPHA" line in the layer definition. Don't use this unnecessarily as there is a performance penalty.
fr: Dans le but d'afficher des classes de symboles correctement dans un rendu en 24 bits, tels que les symboles des polices true type, il est nécessaire de forcer le rendu en RGBA. Cela peut être réalisé en rajoutant la ligne "TRANSPARENCY ALPHA" dans la définition de la couche. N'utiliser pas cela d'une manière automatique car il y a une perte de performance.

source: This problem also affects PNG24 output or any RGB output format. 8bit (PC256) or RGBA output types are already ok.
fr: Ce problème affecte également le rendu en PNG24 ou n'importe quel format RVB. Les types de rendu RVBA et 8 bit (PC256) sont déjà corrects.

source: How do I add a copyright notice on the corner of my map?
fr: Comment j'ajoute un copyright dans le coin de ma carte ?

source: You can use an inline feature, with the :ref:`FEATURE` object, to make a point on your map. Use the TEXT parameter of the FEATURE object for the actual text of the notice, and a :ref:`LABEL` object to style the notice.
fr: Vous pouvez utiliser un objet géométrique avec l'objet :ref:`FEATURE`, pour créer un point sur votre carte. Utilisez le paramètre TEXT de l'objet FEATURE pour le texte du copyright, et un objet :ref:`LABEL` pour le styler.

source: Example Layer
fr: Couche exemple

source: Result
fr: Résultat

source: How do I have a polygon that has both a fill and an outline with a width?
fr: Comment puis-je réaliser un polygone qui a, à la fois, un remplissage et un contour avec une taille ?

source: How do I have a polygon that has both a fill and an outline with a width? Whenever I put both a color (fill) and an outlinecolor with a width on a polygon within a single STYLE, the outline width isn't respected.
fr: À chaque fois que je met une couleur (de remplissage) et une couleur de contour avec une largeur sur un polygone dans un seul objet STYLE, la taille du contour n'est pas respectée.

source: For historical reasons, width has two meanings within the context of filling polygons and stroke widths for the outline. If a polygon is filled, then the width defines the width of the symbol *inside* the filled polygon. In this event, the outline width is disregarded, and it is always set to 1. To acheive the effect of *both* a fill and an outline width, you need to use two styles in your class.
fr: Pour des raisons historiques, la largeur a deux significations, avec le remplissage des polygones et avec la largeur des traits pour le contour. Si un polygone est rempli, alors la largeur définit la taille du symbole *à l'intérieur* du polygone rempli. Dans ce cas, la largeur du contour est ignorée et est toujours définie à 1. Pour réaliser à la fois un effet de remplissage et de largeur de contour, vous devez utiliser deux styles dans votre classe.

source: How can I create simple antialiased line features?
fr: Comment je peux créer des objets linéaires avec anticrênelages ?

source: With AGG (used in recent MapServer version), antialiased lines is the default, and can't be turned off.
fr: Avec AGG (utilisé dans les versions récentes de Mapserver), les lignes anticrênelées sont par défaut, et ce fonctionnement ne peut pas être désactivé.

source: With GD, the easiest way to produce antialiased lines is to:
fr: Avec GD, la manière la plus simple de produire des lignes avec anticrênelages est d'

source: use a 24-bit output image type (IMAGEMODE RGB (or RGBA))
fr: utiliser un type d'image de 24 bit (IMAGEMODE RGB (ou RGBA))

source: set TRANSPARENCY ALPHA in the layer using antialiased lines
fr: définir TRANSPARENCY ALPHA dans la couche utilisant les lignes avec anticrênelages

source: set ANTIALIAS TRUE in the STYLE element of the CLASS with antialiased lines
fr: définir ANTIALIAS TRUE dans l'élément STYLE de la CLASS avec des lignes avec anticrênelages

source: The following mapfile snippets enable antialiased county borders for GD:
fr: L'exemple de mapfile suivant active les bordures avec anticrênelages sur county:

source: The bdry_counln2 shapefile referenced in the counties layer is a line shapefile. A polygon shapefile could be substituted with roughly the same results, though owing to the nature of shapefiles each border would be rendered twice and the resulting output line would likely appear to be slightly thicker. Alternatively, one could use a polygon shapefile, set TYPE to POLYGON, and use OUTLINECOLOR in place of COLOR in the STYLE element.
fr: Le shapefile bdry_counln2 référencé dans la couche counties est un shapefile linéaire. Un shapefile polygonal peut être substitué avec presque le même résultat, mais en raison de la nature des shapefiles chaque limite serait affichée à deux reprises et la ligne générée en sortie apparaitrait probablement légèrement plus épaisse. Alternativement, on peut utiliser un shapefile polygone, définir le TYPE à POLYGON, et utiliser OUTLINECOLOR à la place de COLOR dans l'élément STYLE.

source: You can tweak the combination of STYLE->WIDTH and SYMBOLSCALE to modify line widths in your output images.
fr: Vous pouvez personnaliser la combinaison de STYLE->WIDTH et SYMBOLSCALE pour modifier la largeur des lignes dans les images de sortie.

source: :ref:`Cartoline <sym_construction>` symbols can be used to achieve fancier effects.
fr: Les symboles :ref:`Cartoline <sym_construction>` peuvent être utilisés pour avoir des effets plus jolis.

source: Which OGC Specifications does MapServer support?
fr: Quelles spécifications OGC sont géré par MapServer ?

source: See: :ref:`ogc_support`.
fr: Voir: :ref:`ogc_support`.

source: Why does my requested WMS layer not align correctly?
fr: Pourquoi ma couche WMS demandée ne s'aligne pas correctement ?

source: Requesting a layer from some ArcIMS WMS connectors results in a map with misalgned data (the aspect ratio of the pixels looks wrong).
fr: Faire une requête vers certains connecteurs WMS ArcIMS entrainent une carte avec des données mal alignées (le ratio des pixels semble incorrect).

source: Some ArcIMS sites are not set up to stretch the returned image to fit the requested envelope by default. This results in a map with data layers that overlay well in the center of the map, but not towards the edges. This can be solved by adding "*reaspect=false*" to the request (by tacking it on to the connection string).
fr: Certains sites ArcIMS ne sont pas configurés par défaut pour étirer l'image renvoyée pour correspondre à l'enveloppe demandée. Cela entraine une carte avec des couches de données qui se superposent correctement au centre de la couche, mais pas vers les bords. Cela peut être corrigé en ajoutant "*reaspect=false*" à la requête (dans la chaîne de connexion).

source: For example, if your mapfile is in a projection other than EPSG:4326, the following layer will not render correctly:
fr: Par exemple si votre mapfile est dans une projection différente de EPSG:4326, la couche suivante ne s'affichera pas correctement :

source: Adding "reaspect=false" to the connection string solves the problem:
fr: En ajoutant "reaspect=false" à la chaîne de connexion cela résoud le problème :

source: When I do a GetCapabilities, why does my browser want to download mapserv.exe/mapserv?
fr: Quand je fais une requête GetCapabilities, pourquoi mon navigateur veut télécharger mapserv.exe/mapserv?

source: A beginner question here... I'm new to MS and to Apache. I've got MS4W up and running with the Itasca demo. Now I want to enable it as a WMS server. mapserv -v at the command line tells me it supports WMS_SERVER. When I point my browser to it, my browser just wants to download mapserv.exe!
fr: Une question de débutant ici .... Je suis débutant sur MapServer et Apache. J'ai MS4W qui fonctionne et qui est lancé avec la démo Itasca. Maintenant je veux l'activer en tant que serveur WMS. ``mapserver -v`` en ligne de commande m'informe qu'il gère le service WMS. Quand je pointe mon navigateur vers celui-ci, il me demande de télécharger mapserv.exe !

source: What am I missing?
fr: Qu'est ce que j'ai loupé?

source: Here is the URL I'm using to issue a GetCapabilities WMS request: http://localhost/cgi-bin/mapserv.exe?map=../htdocs/itasca/demo.map&SERVICE=WMS&VERSION=1.1.1&REQUEST=GetCapabilities
fr: Voici l'URL que j'utilise pour débugger une requête WMS GetCapabilities: http://localhost/cgi-bin/mapserv.exe?map=../htdocs/itasca/demo.map&SERVICE=WMS&VERSION=1.1.1&REQUEST=GetCapabilities

source: The OGC:WMS 1.1.0 and 1.1.1 specifications (which are both supported by MapServer) state that, for GetCapabilities responses, the OGC:WMS server returns a specific MIME type (i.e. application/vnd.ogc.xml (see subclause 6.5.3 of `OGC:WMS 1.1.1 <http://portal.opengeospatial.org/files/?artifact_id=1081&version=1&format=pdf>`__.
fr: Les spécifications OGC:WMS 1.1.0 et 1.1.1 (qui sont tous les deux gérés par MapServer) définissent que pour les réponses GetCapabilities, le serveur OGC:WMS renvoie un type MIME spécifique (i.e. application/vnd.ogc.xml (voir la sous-clause 6.5.3 de `OGC:WMS 1.1.1 <http://portal.opengeospatial.org/files/?artifact_id=1081&version=1&format=pdf>`__.

source: A MIME type is passed from the web server to the client (in your case, a web browser), from which a client can decide how to process it.
fr: Un type MIME est renvoyé du serveur web au client (dans votre cas le navigateur) qui permet au client de décider comment le traiter.

source: Example 1: if using a web browser, if a web server returns an HTTP Header of "Content-type:image/png", then the web browser will know that this is a PNG image and display it accordingly.
fr: Exemple 1 : en utilisant un navigateur web, si un serveur web renvoie un en-tête HTTP "Content-type:image/png", alors le navigateur web saura que c'est une image PNG et l'affichera correctement.

source: Example 2: if using a web browser, if a web server returns an HTTP Header of "Content-type:text/html", then the web browser will know that this is an HTML page and display it accordingly (i.e. tables, divs, etc.)
fr: Exemple 2 : en utilisant un navigateur web, si un serveur web renvoie un en-tête HTTP "Content-type:text/html", alors le navigateur web saura que c'est une page HTML et l'affichera (c'est à dire tables, divs, etc.)

source: Basically, what is happening is that the OGC:WMS is returning, in the headers of the HTTP response, a MIME type which your web browser does not understand, which usually prompts a dialog box on whether to open or download the content (i.e. Content-type:application/vnd.ogc.wms_xml).
fr: Tout simplement, ce qui arrive est que le OGC:WMS renvoie, dans les en-têtes des réponses HTTP, un type MIME que votre navigateur ne comprend pas, ce qui habituellement entraîne l'ouverture d'une boîte de dialogue pour savoir si vous voulez ouvrir ou sauver le contenu (c'est à dire Content-type:application/vnd.ogc.wms_xml).

source: You could configure your web browser to handle the application/vnd.ogc.wms_xml MIME type a certain way (i.e. open in Notepad, etc.).
fr: Vous devez configurer votre navigateur web pour prendre en charge le type MIME application/vnd.ogc.wms_xml d'une certaine façon (c'est à dire ouvrir dans Notepad, etc.).

source: Why do my WMS GetMap requests return exception using MapServer 5.0?
fr: Pourquoi mes requêtes GetMap WMS renvoient des exceptions en utilisant MapServer 5.0 ?

source: Before upgrading to MapServer 5.0, I was able to do quick GetMap tests in the form of: http://wms.example.com/wms?service=WMS&version=1.1.1&request=GetMap&layers=foo
fr: Avant de mettre à jour vers MapServer 5.0, j'étais capable de faire de rapides tests GetMap sos la forme: http://wms.example.com/wms?service=WMS&version=1.1.1&request=GetMap&layers=foo

source: Now when I try the same test, MapServer WMS returns an XML document saying something about missing required parameters. What's going on here?
fr: Maintenant quand je tente le même test, le WMS de MapServer renvoie un document XML disant qu'il manque des paramètres nécessaires. Que se passe t'il?

source: This was a major change for WMS Server support in MapServer 5.0. MapServer WMS Server GetMap requests now require the following additional parameters:
fr: Il y a eu un changement majeur pour la gestion du serveur WMS dans MapServer 5.0. Les requêtes GetMap du serveur WMS de MapServer nécessitent maintenant les paramètres supplémentaires suivants:

source: These parameters were always required in all versions of the WMS specification, but MapServer previously had not required them in a client request (even though most OGC WMS clients would issue them anyway to be consistent with the WMS spec).
fr: Ces paramètres étaient toujours nécessaire pour toutes les versions de la spécification WMS mais MapServer ne les demandaient pas avant dans les requêtes clientes (même si la plupart des clients WMS OGC les délivreront de toutes façon pour être compatibles avec les spec WMS).

source: The request below now constitutes a valid GetMap request:
fr: La requête ci-dessous constitue maintenant une requête GetMap valide :

source: Which is consistent with the WMS specification.
fr: Ce qui est compatible avec la spécification WMS.

source: More information on these parameters can be found in the :ref:`wms_server` and the `OGC WMS 1.1.1 specification <http://portal.opengeospatial.org/files/?artifact_id=1081&version=1&format=pdf>`__
fr: Pour plus d'information sur ces paramètres vous pouvez regarder :ref:`wms_server` et les `spécifications OGC WMS 1.1.1 <http://portal.opengeospatial.org/files/?artifact_id=1081&version=1&format=pdf>`__

source: For more detailed information, see `ticket 1088 <https://github.com/mapserver/mapserver/issues/1088>`__
fr: Pour plus d'informations détaillées, lisez le `ticket 1088 <https://github.com/mapserver/mapserver/issues/1088>`__

source: STYLES, though a required WMS parameter, is now optional again in MapServer. For more detailed information, see `ticket 2427 <https://github.com/mapserver/mapserver/issues/2427#comment:2>`__
fr: STYLES, bien qu'un paramètre WMS nécessaire, est maintenant de nouveau optionnel dans MapServer. Pour plus d'informations détaillées, lisez le `ticket 24277 <https://github.com/mapserver/mapserver/issues/2427#comment:2>`__

source: Using MapServer 6.0, why don't my layers show up in GetCapabilities responses or are not found anymore?
fr: En utilisant MapServer 6.0, pourquoi mes couches ne s'affichent plus dans les réponses de requêtes GetCapabilities ou ne sont plus trouvées du tout?

source: MapServer 6.0 introduces the option of hiding layers against OGC Web Service requests. OGC Web Services can provide powerful access to your geospatial data. It was decided to disable layer level request access as a default. See :ref:`rfc67` provides a full explanation of the changes and implications.
fr: MapServer 6.0 introduit l'option de cacher des couches dans les appels aux Web Service de l'OGC. Les Web Services OGC peuvent fournir des accès très puissants pour vps données géospatiales. Il a été décidé de désactiver l'accès au niveau des couches par défaut. Voir la :ref:`rfc67` qui fournit l'explication complète des changements et de leurs implications.

source: To enable pre-6.0 behaviour, you can add the following to the :ref:`WEB` object's METADATA section in your mapfile:
fr: Pour permettre de revenir au comportement avant la version 6.0, vous pouvez ajouter ce qui suit dans la section METADATA de l'objet :ref:`WEB`de votre mapfile:

source: This will enable access of all layers to all OGC Web Service requests.
fr: Cela permettra l'accès à toutes les couches pour tous les requêtes de Web Service OGC.

source: Where do I find my EPSG code?
fr: Où puis-je trouver mon code EPSG ?

source: There is a text file "epsg" in your PROJ4 installation (e.g. "/usr/local/share/proj/epsg") which contain the EPSG information used by PROJ4. In Windows, this is often located in C:\\proj\\nad or is found with an environment variable called PROJ_LIB.
fr: Il y a un fichier texte "epsg" dans votre installation PROJ4 (par exemple dans "/usr/local/share/proj/epsg") qui contient les informations EPSG utilisées par PROJ4. Sous Windows, il est souvent localisé dans C:\\proj\\nad ou il peut être trouvé dans une variable d'environnement appelée PROJ_LIB.

source: http://spatialreference.org allows you to search for EPSG codes.
fr: http://spatialreference.org vous permet de rechercher des codes EPSG.

source: You can also have a look at: http://ocean.csl.co.uk
fr: Vous pouvez aussi jeter un oeil ici: http://ocean.csl.co.uk

source: More information to EPSG: http://www.epsg.org
fr: Plus d'information sur le code EPSG: http://www.epsg.org

source: More information to PROJ4: http://trac.osgeo.org/proj
fr: Plus d'information sur PROJ4: http://trac.osgeo.org/proj

source: How can I reproject my data using ogr2ogr?
fr: Comment je peux reprojeter mes données en utilisant ogr2ogr

source: With ogr2ogr of course! ogr2ogr is a powerful utility that will transform the projections of your shapefiles when passed the appropriate parameters. In my case, I was using MapServer to serve data in RI State Plane Feet. In order to do so, the data had to first be converted to meters. Here is the command I used:
fr: Avec ogr2ogr bien sûr! ogr2ogr est un utilitaire très puissant qui va transformer les projections de vos shapefiles quand vous lui passez les paramètres appropriés. Dans mon cas, j'utilisais Mapserver pour servir les données en "RI (Rhode Island) State Plane Feet". Por faire ceci, les données devaient d'abord être converties en mètres. Voici les commandes que j'ai utilisé:

source: Since my data already had a projection defined, I did not need to explicitly state a source projection. This command uses the EPSG definition for NAD83 Rhode Island (32130) and performs the feet to meters conversion.
fr: Comme mes données avaient déjà une projection définie, je n'ai pas eu besoin de définir explicitement la projection de la source. Cette commande utilise la définition EPSG pour le "NAD83 Rhode Island (32130)" et fait la conversion des pieds vers les mètres.

source: Now say my data wasn't already projected? Here's how we deal with that:
fr: Maintenant disons que ma donnée n'était pas déjà projetée? Voici comment nous pouvons gérer ce cas avec:

source: Let's examine what is going on here:
fr: Laissez-loi examiner ce qu'il se passe ici:

source: The -s_srs parameter explicitly defines a projection for the data. The parameters used here were taken out of the EPSG definition (in this case, 32130) in the epsg file(see the `projection FAQ <epsg_codes>`__ for more details on locating EPSG definitions). The entry for RI in the epsg file is as follows:
fr: Le paramètre -s_srs définit explicitement une projection pour cette donnée. Les paramètres utilisés ici ont été pris de la définition EPSG (dans ce cas, 32130) dans le fichier epsg (voir la `FAQ sur les projections <epsg_codes>` pour plus de détails sur la localisation des définitions EPSG). L'entrée pour RI (Rhode Island) dans le fichier epsg est comme suivant:

source: You can see how the definition in the initial command is formulated. Notice that the "+units=m" parameter has been changed to “+to_meter=0.3408”. This is important for the conversion. Where did the value of 0.3408 come from you ask? From the EPSG file! It has many goodies buried in it so by simply running 'grep "to_meter" epsg’ you can refresh your memory if you need to.
fr: Vous pouvez voir comment la définition dans la commande initiale est formulée. Notez que le paramètre "+units=m" a été changé à "+to_meter=0.3408". C'est imporant pour la conversion. Vous vous demandez d'où la valeur de 0.3408 vient? Du fichier EPSG! Il y a de nombreux bonus cachés dedans ainsi en lançant simplement un 'grep "to_meter" epsg' vous pourrez rafraîchir votre mémoire si vous en avez besoin.
