Repository: geographika/MapServer-documentation
Catalog: translated/*/index.po
Languages: fr, sq, zh

source: Welcome to MapServer
fr: Bienvenue sur MapServer
sq: Mirë se vini në MapServer
zh: 欢迎来到 MapServer

source: MapServer is an `Open Source`_ platform for publishing spatial data and interactive mapping applications to the web. Originally developed in the mid-1990's at the University of Minnesota, MapServer is released under an :ref:`MIT-style license <license>`, and runs on all major platforms (:ref:`windows`, :ref:`linux`, :ref:`osx`). MapServer is not a full-featured `GIS`_ system, nor does it aspire to be.
fr: MapServer est une plate-forme `Open Source`_ pour mettre en ligne des données spatiales et des applications cartographiques interactives sur le web. Initialement développé au milieu des années 90 à l'université du Minnesota, MapServer est soumis à la licence :ref:`MIT-style license <license>`, et fonctionne sur la plupart des systèmes d'exploitation (:ref:`windows`, :ref:`linux`, :ref:`osx`). MapServer n'est pas un `SIG`_ au sens propre et n'a pas vocation à le devenir.
sq: MapServer është një `Burim i Hapur`_ platformë për publikimin e të dhënave hapësinore dhe aplikacionet hartë interaktive për faqe. Fillimisht i zhvilluar në mesin e viteve-1990 në Universitetin e Minesotës, MapServer është lëshuar nën një :ref:`MIT-style licence <license>`, dhe punon në të gjitha platformat e mëdha (:ref:`windows`, :ref:`linux`, :ref:`osx`). MapServer nuk është i plotë me veçori `GIS`_ sistemi, as nuk aspiron që të jetë.
zh: MapServer 是一个用于在网络上发布空间数据以及交互式地图应用程序 `开源`_ 平台。MapServer 最初在20世纪90年代中期被明尼苏达大学开发， 在:ref:`MIT许可协议 <license>` 框架下发布并在全部的主流平台 (:ref:`windows`, :ref:`linux`, :ref:`osx`) 上运行。MapServer 并不是也不追求成为一个完全的`GIS`_ 系统。

source: The MapServer :ref:`Project Steering Committee (PSC)<rfc23>`, sanctioned by `OSGeo`_, manages and administers the project which is maintained, improved, and supported by developers and users from around the world. See the :ref:`community activities <community>` page for mailing lists, etc.
fr: Le Comité de Gouvernance de Projet (:ref:`Project Steering Committee PSC<rfc23>`) de MapServer, approuvé par `OSGeo`_, gère et administre le projet qui est maintenu, amélioré et géré par des développeurs répartis dans l'ensemble du monde. Voir la page des :ref:`activités communautaires <community>` pour les listes de diffusion, l'irc, etc.
sq: The MapServer :ref:`Projekt Komiteti Drejtues (PSC)<rfc23>`, sanksionuar nga `OSGeo`_, menaxhon dhe administron projektin e cila është ruajtur, përmirësuar, dhe të mbështetur nga zhvilluesit dhe përdoruesit nga e gjithë bota. Shih :ref:`aktivitetet e komunitetit <community>` faqe për listat e postimeve, etj
zh: MapServer 的 :ref:`项目指导委员会 (PSC)<rfc23>` 经营以及管理由开发人员与来自世界各地的用户维护、改善以及支持的项目。 该委员会由 `OSGeo`_ 管理。见 :ref:`社区活动 <community>` 页面以获取地址列表及更多信息。

source: :ref:`More about MapServer <about>`
fr: :ref:`En savoir plus sur MapServer <about>`
sq: :ref:`Më shumë rreth MapServer <about>`
zh: :ref:`关于 MapServer 的更多信息 <about>`

source: MapServer Suite Home
fr: Accueil de MapServer Suite
sq: MapServer Paketë Shtëpi
zh: MapServer Suite 主页

source: :ref:`MapServer, MapCache, TinyOWS home <products>`
fr: :ref:`Accueil des produits MapServer, MapCache, TinyOWS <products>`
sq: :ref:`MapServer, MapCache, TinyOWS shtëpi <products>`
zh: :ref:`MapServer, MapCache, TinyOWS 主页 <products>`

source: Download the MapServer Suite
fr: Télécharger MapServer Suite
sq: Shkarkoni Paketën MapServer
zh: 下载 MapServer Suite

source: :ref:`Download the suite <download>`
fr: :ref:`Télécharger la suite <download>`
sq: :ref:`Shkarkoni paketën <download>`
zh: :ref:`下载套装 <download>`

source: Recent Announcements
fr: Annonces récentes
sq: Njoftime Fundit
zh: 最近公告

source: **2015-02-12 - MapServer 7.0.0-beta1 is released**
fr: **2015-02-12 - MapServer 7.0.0-beta1 est publié**
zh: **2015-02-12 - MapServer 7.0.0-beta1 发布**

source: The first beta for MapServer 7.0 has been released. The list of major changes for this release can be found in the :ref:`7.0 announcement <announce-7-0>`. See the :ref:`changelog <changelog-7-0>` for the full list of changes and head to :ref:`download` to obtain a copy.
fr: La première bêta de MapServer 7.0 a été publiée. La liste des modifications importantes pour cette version peut être trouvée sur la page des :ref:`7.0 annonces <announce-7-0>`. Lisez le :ref:`changelog <changelog-7-0>` pour la liste complète des modifications et dirigez vous sur la page des :ref:`download` pour en obtenir une copie.
zh: MapServer 7.0 的第一个测试版本已经发布。此次发布的主要变化列表可以在:ref:`7.0 公告<announce-7-0>` 里找到。请在:ref:`更改日志 <changelog-7-0>` 查看完全列表，以及在 :ref:`download` 下载文件副本。

source: **2014-01-02 - MapServer 6.4.1, 6.2.2, 6.0.4 and 5.6.9 are released**
fr: **02-01-2014 - MapServer 6.4.1, 6.2.2, 6.0.4 et 5.6.9 ont été publiés**
sq: **2014-01-02 - MapServer 6.4.1, 6.2.2, 6.0.4 dhe 5.6.9 janë lëshuar**
zh: **2014-01-02 - MapServer 6.4.1, 6.2.2, 6.0.4, 5.6.9 发布**

source: Releases for the stable branches of MapServer have been released in order to fix a potential leakage of information through an SQL injection when using TIME filtering in conjunction with postgis backends. More information can be found in the dedicated issue: `#4834 <https://github.com/mapserver/mapserver/issues/4834>`__.
fr: De nouvelles publications pour les branches stables de MapServer ont été réalisées afin de corriger une possible fuite d'informations via une injection SQL quand le filtrage TIME est utilisé en conjonction avec le back-office PostGIS. Plus d'informations peuvent être trouvées dans le suivi de bug dédié : `#4834 <https://github.com/mapserver/mapserver/issues/4834>`__.
zh: MapSever 的各个稳定分支版本已经发布。该版本修复潜在的在连接数据库后台使用 TIME 过滤时可能通过SQL注入式攻击导致的信息泄漏。更多信息请参照专题：`#4834 <https://github.com/mapserver/mapserver/issues/4834>`__

source: Changelogs for each specific version can be found here:
fr: Les logs de changements pour chaque version spécifique peuvent être trouvés ici :
zh: 各版本变更日志可以在此查看

source: :ref:`6.4.0 to 6.4.1 changes <changelog-6-4-1>`
fr: :ref:`changements de la version 6.4.0 à 6.4.1 <changelog-6-4-1>`
sq: :ref:`6.4.0 to 6.4.1 ndryshime <changelog-6-4-1>`
zh: ref:`6.4.0 to 6.4.1 变更<changelog-6-4-1>`

source: :ref:`6.2.1 to 6.2.2 changes <changelog-6-2-2>`
fr: :ref:`changements de la version 6.2.1 à 6.2.2 <changelog-6-2-2>`
sq: :ref:`6.2.1 to 6.2.2 ndryshime <changelog-6-2-2>`
zh: :ref:`6.2.1 to 6.2.2 变更 <changelog-6-2-2>`

source: :ref:`6.0.3 to 6.0.4 changes <changelog-6-0-4>`
fr: :ref:`changements de la version 6.0.3 à 6.0.4 <changelog-6-0-4>`
sq: :ref:`6.0.3 to 6.0.4 ndryshime <changelog-6-0-4>`
zh: :ref:`6.0.3 to 6.0.4 变更 <changelog-6-0-4>`

source: 5.6.9 contains only the fix for #4834
fr: La version 5.6.9 contient seulement la correction pour la le bug #4834
sq: 5.6.9 përmban vetëm rregullime për #4834
zh: 5.6.9 仅包含对 #4834 的修复

source: Head to :ref:`download` to obtain copies.
fr: Rendez-vous sur la page de :ref:`téléchargement <download>` pour obtenir une copie.
zh: 前往： :ref:`下载` 以获得副本.

source: **2014-01-03 - MapCache 1.2.1 is released**
fr: **01-03-2014 - MapCache 1.2.1 est publié**
zh: **2014-01-03 - MapCache 1.2.1 发布**

source: MapCache 1.2.1 has been released. Head to :ref:`download` to obtain a copy.
fr: MapCache 1.2.1 a été publié. Rendez-vous sur la page de :ref:`téléchargement <download>` pour obtenir une copie.
zh: MapCache 1.2.1 现已发布。请到 :ref:`download` 获取副本。

source: **2013-09-17 - MapServer 6.4.0 is released**
fr: **17-09-2013 - MapServer 6.4.0 est publié**
sq: **2013-09-17 - MapServer 6.4.0 is lëshuar**
zh: **2013-09-17 - MapServer 6.4.0 发布**

source: MapServer 6.4.0 has been released. Major changes since 6.2 can be found in the in :ref:`the 6.4 announcement <announce-6-4>`. For the small list of changes since RC1, see :ref:`the final changelog <changelog-6-4-0>`, then head to :ref:`download` to obtain a copy.
fr: MapServer 6.4.0 vient d'être publié. Les changements majeurs depuis la 6.2 peuvent être trouvés dans :ref:`l'annonce de publication <announce-6-4>`. Pour une liste des changements depuis la RC1, allez voir :ref:`le changelog final <changelog-6-4-0>` et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.
sq: MapServer 6.4.0 është lëshuar. Ndryshime të mëdha që nga 6.2 mund të gjenden në :ref:`Shpallja 6.4 <announce-6-4>`. Për listën e vogël të ndryshimeve që RC1, shih:ref:`shënime-ndryshimesh final <changelog-6-4-0>`, pastaj drejtohu në :ref:`shkarko` për të marrë një kopje.
zh: MapServer 6.4.0 现已发布。从版本 6.2 到 6.4 的变化请查阅： :ref:`6.4 公告 <announce-6-4>`。详细变化列表自版本RC1见：:ref:`最终变更日志 <changelog-6-4-0>`，然后前往 :ref:`下载` 以获取副本。

source: **2013-04-19 - MapServer 6.2.1 is released**
fr: **19-04-2013 - MapServer 6.2.1 est publié**
sq: **2013-04-19 - MapServer 6.2.1 është lëshuar**
zh: **2013-04-19 - MapServer 6.2.1 发布**

source: MapServer 6.2.1 has been released. See :ref:`the changelog <changelog-6-2-1>` for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 6.2.1 vient d'être publié. Voir `l'annonce de publication <changelog-6-2-1>` pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.
sq: MapServer 6.2.1 është lëshuar. Shih: ref:`<ndryshimeshënim-6-2-1> ndryshimeshënim` për më shumë detaje dhe koka tek: ref:`Shkarko`për të marrë një kopje.
zh: MapServer 6.2.1 现已发布。见 :ref:`变更日志 <changelog-6-2-1>` 查看更多信息，以及在 :ref:`下载` 以获取副本。

source: **2012-11-14 - MapServer Suite 12.11 is released**
fr: **14-11-2012 - MapServer Suite 12.11 est publié**
sq: **2012-11-14 - MapServer Suite 12.11 është këshuar**
zh: **2012-11-14 - MapServer Suite 12.11 发布**

source: The first MapServer Suite, numbered 12.11, and containing MapServer 6.2.0, MapCache 1.0.0 and TinyOWS 1.1.0 has been released. See :ref:`the release announcement <announce-6-2>` for more details and head to :ref:`download` to obtain a copy.
fr: La première MapServer Suite, numérotée 12.11, et contenant MapServer 6.2.0, MapCache 1.0.0 et TinyOWS 1.1.0 vient d'être publiée. Voir `l'annonce de publication <announce-6-2>` pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.
sq: Paketa MapServer e parë, numëruar 12.11, dhe përmbajnë MapServer 6.2.0, MapCache 1.0.0 dhe TinyOWS 1.1.0 është lëshuar. Shih :ref:`shpallja lëshimit <announce-6-2>` për më shumë detaje drejtohu në :ref:`shkarko` për të marrë një kopje.
zh: 首个 MapServer Suite 编号12.11，现已发布，该版本包含MapServer 6.2.0, MapCache 1.0.0 以及TinyOWS 1.1.0。更多详细信息见 :ref:`版本公告 <announce-6-2>`。请前往 :ref:`下载`以获取副本。

source: **2012-11-14 - MapServer 6.2.0 is released**
fr: **14-11-2012 - MapServer 6.2.0 est publié**
sq: **2012-11-14 - MapServer 6.2.0 është lëshuar**
zh: **2012-11-14 - MapServer 6.2.0 发布**

source: MapServer 6.2.0 has been released. See :ref:`the release announcement <announce-6-2>` for more details, :ref:`the changelog since RC1 <changelog-6-2-0>` and head to :ref:`download` to obtain a copy.
fr: MapServer 6.2.0 vient d'être publié. Voir `l'annonce de publication <announce-6-2>` pour plus de détails, :ref:`le changelog depuis la RC1 <changelog-6-2-0>` et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.
sq: MapServer 6.2.0 është lëshuar. Shih :ref:`shpallja lëshimit <announce-6-2>` për më shumë detaje, :ref:`shënime-ndryshimi që nga RC1 <changelog-6-2-0>` dhe drejtohu në :ref:`shkarko` për të marrë një kopje.
zh: MapServer 6.2.0 现已发布。更详细信息见 :ref:`版本公告 <announce-6-2>` ， :ref:`变更日志自RC1 <changelog-6-2-0>`，以及在 :ref:`下载` 获取副本。

source: **2012-10-10 - MapServer 6.2.0 RC1 is released**
fr: **10-10-2012 - MapServer 6.2.0 RC1 est publié**
sq: **2012-10-10 - MapServer 6.2.0 RC1 është lëshuar**
zh: **2012-10-10- MapServer 6.2.0 RC1 发布**

source: MapServer 6.2.0-RC1 has been released. See :ref:`the changelog <changelog-6-2-0-rc1>` for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 6.2.0-RC1 vient d'être publié. Voir `l'annonce de publication <changelog-6-2-0-rc1>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.
sq: MapServer 6.2.0-RC1 është lëshuar. Shih :ref:`shënime-ndryshimi <changelog-6-2-0-rc1>` për më shumë detaje drejtohu në :ref:`shkarko` për të marrë një kopje.
zh: MapServer 6.2.0-RC1 现已发布。见 :ref:`变更日志 <changelog-6-2-0-rc1>` 查看更多信息，以及前往 :ref:`下载` 以获取副本。

source: **2012-05-18 - MapServer 6.0.3 is released**
fr: **18-05-2012 - MapServer 6.0.3 est publié**
sq: **2012-05-18 - MapServer 6.0.3 është lëshuar**
zh: **2012-05-18 - MapServer 6.0.3 发布**

source: MapServer 6.0.3 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2012-May/072329.html>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 6.0.3 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2012-May/072329.html>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.
sq: MapServer 6.0.3 është lëshuar. Shih `shpallja lëshimit <http://lists.osgeo.org/pipermail/mapserver-users/2012-May/072329.html>`__ për më shumë detaje drejtohu në :ref:`shkarko` për të marrë një kopje.
zh: MapServer 6.0.3 现已发布。见版本公告<http://lists.osgeo.org/pipermail/mapserver-users/2012-May/072329.html>`__ 查看更多信息，以及前往 :ref:`下载` 以获取副本。

source: **2012-02-08 - TinyOWS 1.0.0 is released**
fr: **08-02-2012 - TinyOWS 1.0.0 est publié**
sq: **2012-02-08 - TinyOWS 1.0.0 është lëshuar**
zh: **2012-02-08 - TinyOWS 1.0.0 发布**

source: TinyOWS 1.0.0 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2012-February/071478.html>`__ for more details. (Note that TinyOWS will be part of the MapServer project starting with version 6.2)
fr: TinyOWS 1.0.0 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2012-February/071478.html>`__ pour plus de détails. (Notez aussi que TinyOWS devient partie intégrante du projet MapServer à partir de la version 6.2)
sq: TinyOWS 1.0.0 është lëshuar. Shih `shpallja lëshimit <http://lists.osgeo.org/pipermail/mapserver-users/2012-February/071478.html>`__ për më shumë detaje. (Vini re se TinyOWS do të jetë pjesë e projektit MapServer duke filluar nga versioni 6.2)
zh: TinyOWS 1.0.0 现已发布。见 `版本公告<http://lists.osgeo.org/pipermail/mapserver-users/2012-February/071478.html>`__ 查看更多信息，以及前往 :ref:`下载` 以获取副本。

source: View all :ref:`Announcements`.
fr: Voir toutes les :ref:`Announcements`.
sq: Shiko të gjithë :ref:`Njoftime`.
zh: 查看全部 :ref:`公告`.

source: **2015-07-24 - MapServer 7.0.0 and MapCache 1.4 are released**
sq: **2015-07-24 - MapServer 7.0.0 dhe MapCache 1.4 janë lëshuar**

source: Head to :ref:`download` to obtain a copy.
sq: Shkoni tek :ref:`shkarko` për të përfituar një kopje.
