Repository: geographika/MapServer-documentation
Catalog: translated/*/installation.po
Languages: fr

source: .NET MapScript Compilation
fr: Compilation de MapScript .NET

source: Before compiling C# MapScript you should compile MapServer with the options for your requirements. For more information about the compilation of MapServer please see :ref:`Win32 Compilation and Installation Guide <win32>`. It is highly recommended to minimize the library dependency of your application, so when compiling MapServer enable only the features really needed. To compile the C# binding SWIG 1.3.31 or later is required.
fr: Avant de compiler MapScript C#, vous devez compiler MapServer avec les options selon vos besoins. Pour plus d'informations sur la compilation de MapServer, merci de lire :ref:`le guide de compilation et d'installation Win32 <win32>`. Il est fortement recommandé de limiter les dépendances de la bibliothèque de votre application, ainsi quand vous compilez MapServer activez seulement les fonctionnalités vraiment nécessaires. Pour compiler les bindings C#, SWIG 1.3.31 ou plus récent est requis.

source: This document may refer to older library versions. You may want to try to use more recent library versions for your build.
fr: Ce document peut se référer à des versions de bibliothèques un peu anciennes. Vous voudrez peut être essayer d'utiliser des versions plus récentes des bibliothèques pour votre compilation.

source: Win32 compilation targeting the MS.NET framework 1.1
fr: Compilation Win32 pour le framework 1.1 de MS.NET

source: You should compile MapServer, MapScript and all of the subsequent libraries using Visual Studio 2003. Download and uncompress the latest SWIGWIN package that contains the precompiled swig.exe Open the Visual Studio .NET 2003 Command Prompt and step into the /mapscript/csharp directory. Edit makefile.vc and set the SWIG variable to the location of your swig.exe
fr: Vous devez compiler MapServer, MapScript et toutes les bibliothèques associées en utilisant Visual Studio 2003. Téléchargez et décompressez la dernière version de SWIGWIN qui contient le binaire swig.exe précompilé. Ouvrez la ligne de commande de Visual Studio .NET 2003 et allez dans le répertoire /mapscript/csharp. Editer makefile.vc et définissez la variable SWIG à l'emplacement de votre swig.exe

source: Use::
fr: Usage::

source: to compile mapscript.dll and mapscript_csharp.dll.
fr: pour compiler mapscript.dll et mapscript_csharp.dll.

source: Win32 compilation targeting the MS.NET framework 2.0
fr: Compilation Win32 pour le framework 2.0 de MS.NET

source: You should compile MapServer, MapScript and all of the subsequent libraries using Visual Studio 2005. Download and uncompress the latest SWIGWIN package that contains the precompiled swig.exe Open the Visual Studio 2005 Command Prompt and step into the /mapscript/csharp directory Edit makefile.vc and set the SWIG variable to the location of your swig.exe.
fr: Vous devez compiler MapServer, MapScript et toutes les bibliothèques associées en utilisant Visual Studio 2005. Téléchargez et décompressez la dernière version de SWIGWIN qui contient le binaire swig.exe précompilé. Ouvrez la ligne de commande de Visual Studio 2005 et allez dans le répertoire /mapscript/csharp. Editer makefile.vc et définissez la variable SWIG à l'emplacement de votre swig.exe

source: Win32 compilation targeting the MONO framework
fr: Compilation sous Win32 pour le framework MONO

source: Before the compilation you should download and install the recent mono Win32 setup package (eg. mono-1.1.13.2-gtksharp-2.8.1-win32-1.exe) Edit makefile.vc and set the CSC variable to the location of your mcs.exe. Alternatively you can define::
fr: Avant la compilation, vous devez télécharger et installer le paquet d'installation récent mono pour Win32 (comme mono-1.1.13.2-gtksharp-2.8.1-win32-1.exe) Editer makefile.vc et définir la variable CSC à l'emplacement de votre mcs.exe. Alternativement, vous pouvez définir::

source: in your nmake.opt file.
fr: dans votre fichier nmake.opt

source: You should use the same compiler for compiling MapScript as the compiler has been used for the MapServer compilation. To compile MapScript open the Command Prompt supplied with your compiler and use::
fr: Vous devez utiliser le même compilateur pour compiler MapScript que celui utilisé pour la compilation de MapServer. Pour compiler MapScript, ouvrez la ligne de commande fournie par votre compilateur et utilisez::

source: Alternative compilation methods on Windows
fr: Méthodes de compilations alternatives sous Windows

source: Beginning from MapServer 4.8.3 you can invoke the C# compilation from the MapServer directory by uncommenting DOT_NET in nmake.opt::
fr: A partir de la version de MapServer 4.8.3, vous pouvez appeler la compilation C# depuis votre répertoire MapServer en dé-commentant DOT_NET dans nmake.opt::

source: and invoking the compilation by::
fr: et en invoquant la compilation par::

source: You can also use::
fr: Vous pouvez aussi utiliser::

source: for making the compilation an copying the targets into a common output directory.
fr: pour effectuer la compilation et copier les cibles dans un répertoire de sortie commun

source: Testing the compilation
fr: Tester la compilation

source: For testing the compilation and the runtime environment you can use::
fr: Pour tester la compilation et l'environnement d'exécution, vous pouvez utiliser::

source: within the csharp directory for starting the sample applications compiled previously. Before making the test the location of the corresponding libraries should be included in the system PATH.
fr: à l'intérieur du répertoire csharp pour démarrer les applications exemple compilées antérieurement. Avant de faire le test, l'emplacement des bibliothèques correspondantes doivent être incluses dans le PATH système.

source: Linux compilation targeting the MONO framework
fr: Compilation Linux avec le framework MONO

source: Before the compilation you should download and install the recent mono Linux package. Some distributions have pre-compiled binaries to install, but for using the latest version you might want to compile and install it from the source. Download and uncompress the latest SWIG release. You should probably compile it from the source if pre-compiled binaries are not available for your platform.
fr: Avant la compilation, vous devez télécharger et installer le paquet récent de Mono pour Linux. Certaines distributions ont des binaires précompilés à installer, mais pour utiliser la dernière version vous voulez peut-être compiler et installer Mono depuis les sources. Téléchargez et décompressez la dernière version de SWIG. Vous devez probablement l'installer depuis les sources si des binaires précompilés ne sont pas disponibles pour votre plateforme.

source: Before compiling MapScript, MapServer should be configured and compiled. Beginning from MapServer 4.8.2 during configuration the mapscript/csharp/Makefile will be created according to the configuration options. Edit this file and set the SWIG and CSC for the corresponding executable pathes if the files could not be accessed by default. To compile at a console step into the /mapscript/csharp directory use::
fr: Avant de compiler MapScript, MapServer doit être configuré et compilé. À partir de MapServer 4.8.2 pendant la configuration le fichier mapscript/csharp/Makefile sera créé en fonction de vos options de configuration. Éditez le fichier et réglez le SWIG et le CSC pour les chemins des exécutables correspondants si les fichiers ne peuvent pas être accédés par défaut. Pour compiler à l'étape console dans le répertoire /mapscript/csharp, utilisez::

source: to compile libmapscript.so and mapscript_csharp.dll.
fr: pour compiler libmapscript.so et mapscript_csharp.dll.

source: for starting the sample applications compiled previously.
fr: pour démarrer les applications exemples compilés précédemment.

source: OSX compilation targeting the MONO framework
fr: Compilation sous OSX avec le framework MONO

source: Beginning from 4.10.0 the csharp/Makefile supports the OSX builds. Before making the build the recent MONO package should be installed on the system.
fr: À partir de la version 4.10.0, le csharp/Makefile gère la compilation sous Mac OSX. Avant de lancer la compilation, le paquet récent de MONO doit être installé sur votre système.

source: to compile libmapscript.dylib and mapscript_csharp.dll.
fr: pour compiler libmapscript.dylib et mapscript_csharp.dll.

source: To run the applications mapscript_csharp.dll.config is needed along with the mapscript_csharp.dll file. This file is created during the make process
fr: Pour lancer les applications, mapscript_csharp.dll.config est nécessaire avec le fichier mapscript_csharp.dll. Ce fichier est créé pendant le processus make

source: The files required for your application should be manually installed. It is highly recommended to copy the files into the same folder as the executable resides.
fr: Les fichiers requis pour votre application devraient être installés manuellement. Il est fortement recommandé de copier les fichiers dans le même dossier que là où les éxécutables sont présents.

source: Known issues
fr: Problèmes connus

source: Visual Studio 2005 requires a manifest file to load the CRT native assembly wrapper
fr: Visual Studio 2005 nécessite un fichier manifest pour charger le "CRT native assembly wrapper"

source: If you have compiled MapServer for using the CRT libraries and you are using the MS.NET framework 2.0 as the execution runtime you should supply a proper manifest file along with your executable, like::
fr: Si vous avez compilé MapServer pour utiliser les bibliothèques CRT et que vous utilisez le framework MS.NET 2.0 comme "runtime", vous devriez fournir un fichier manifest avec votre exécutable, comme::

source: This will inform the CLR that your exe depends on the CRT and the proper assembly wrapper is to be used. If you are using the IDE the manifest file could be pregenerated by adding a reference to Microsoft.VC80.CRT.manifest within the /Microsoft Visual Studio 8/VC/redist/x86/Microsoft.VC80.CRT directory.
fr: Cela informera le CLR (Common Language Runtime) que votre exécutable dépend du CRT (C Run Time) et que le wrapper de l'assembly est présent pour être utilisé. Si vous utilisez l'IDE, le fichier manifest peut être prégénéré en ajoutant une référence à Microsoft.VC80.CRT.manifest dans le répertoire /Microsoft Visual Studio 8/VC/redist/x86/Microsoft.VC80.CRT.

source: Manifests for the dll-s must be embedded as a resource
fr: Les manifests pour les dlls doivent être encapsulées comme une ressource

source: According to the windows makefile the MapScript compilation target (mapscript.dll) is linked with the /MD option. In this case the VS2005 linker will generate a manifest file containing the unmanaged assembly dependency. The sample contents of the manifest file are::
fr: Selon le makefile windows, la cible de compilation MapScript (mapscript.dll) est liée avec l'option /MD. Dans ce cas, le linker VS2005 générera un fichier manifest contenant la dépendance de l'assembly non managé. Les contenus exemple du fichier manifest sont::

source: Like previously mentioned if you are creating a windows application the common language runtime will search for a manifest file for the application. The name of the manifest file should be the same as the executable append and end with the .manifest extension. However if the host process is not controlled by you (like web mapping applications using aspnet_wp.exe as the host process) you will not be certain if the host process (.exe) will have a manifest containing a reference to the CRT wrapper. In this case you may have to embed the manifest into the dll as a resource using the mt tool like::
fr: Comme mentionné précédemment si vous créez une application windows, le CLR (Common Language Runtime) cherchera un fichier manifest pour l'application. Le nom du fichier manifest devrait être le même comme l'exécutable ajoute et se termine avec une extension .manifest. Cependant, si le processus hôte n'est pas contrôlé par vous (comme une application de cartographie en ligne utilisant aspnet_wp.exe comme processus hôte), vous ne serez pas certain que le processus hôte (.exe) aura un manifest contenant une référence au wrapper CRT. Dans ce cas, vous devrez peut être encapsulé le manifest dans la dll en tant que ressource en utilisant l'outil mt comme::

source: Normally it is enough to load the CRT with the root dll (mapscript.dll), but it is not harmful embedding the manifest into the dependent libraries as well.
fr: Normallement, il est suffisant de charger le CRT avec la dll racine (mapscript.dll), mais ce n'est pas dangereux d'encapsuler le manifest dans les bibliothèques dépendantes également.

source: Issue with regex and Visual Studio 2005
fr: Problème avec regex et Visual Studio 2005

source: When compiling with Microsoft Visual Studio 2005 variable name collision may occur between regex.c and crtdefs.h. For more details see:
fr: Quand vous compilez avec Microsoft Visual Studio 2005, une collision de nom de variable peut avoir lieu entre regex.c et crtdefs.h. Pour plus de détails, voir:

source: C# MapScript library name mapping with MONO
fr: Correspondance de nom de bibliothèque MapScript C# avec MONO

source: Using the MapScript interface created by the SWIG interface generator the communication between the C# wrapper classes (mapscript_csharp.dll) and the C code (mapscript.dll) takes place using platform invoke like::
fr: En utilisant l'interface MapScript créé par le générateur d'interface SWIG, la communication entre les classes du wrapper C# (mapscript_csharp.dll) et le code C (mapscript.dll) a lieu à l'aide d'appel de plateforme comme::

source: The DllImport declaration contains the library name, however to transform the library name into a file name is platform dependent. On Windows the library name is simply appended with the .dll extension (mapscript.dll). On the Unix systems the library file name normally starts with the lib prefix and appended with the .so extension (libmapscript.so).
fr: La déclaration DllImport contient le nom de la bibliothèque, cependant la transformation du nom de la bibliothèque en nom de fichier est fonction du système. Sous Windows au nom de la bibliothèque est simplement ajouté l'extension .dll (mapscript.dll). Sous les systèmes Unix les noms de fichiers des bibliothèques démarrent avec le préfixe lib et se terminent avec l'extension .so (libmapscript.so).

source: Mapping of the library name may be manually controlled using a dll.config file. This simply maps the library file the DllImport is looking for to its unix equivalent. The file normally contains the following information (mapscript_csharp.dll.config)::
fr: L'enregistrement du nom de la bibliothèque au niveau du système peut être manuellement contrôlé en utilisant le fichier dll.config. Cela enregistre simplement le fichier de la bibliothèque que DllImport recherche dans son équivalent unix. Le fichier contient normalement les informations suivantes (mapscript_csharp.dll.config) : ::

source: and with the OSX builds::
fr: et avec les build OSX::

source: The file should be placed along with the corresponding mapscript_csharp.dll file, and created by default during the make process. For more information see:
fr: Le fichier doit être placé en parallèle du fichier mapscript_csharp.dll correspondant, et sera créé par défaut durant le processus de make. Pour plus d'information voir :

source: Localization issues with MONO/Linux
fr: Problèmes avec les locales avec MONO/Linux

source: According to https://github.com/mapserver/mapserver/issues/1762 MapServer may not operate equally well on different locale settings. Especially when the decimal separator is other than "." inside the locale of the process may cause parse errors when the mapfile contains float numbers. Since the MONO process takes over the locale settings of the environment it is worth considering to set the default locale to "C" of the host process, like::
fr: Selon le ticket https://github.com/mapserver/mapserver/issues/1762 MapServer peut ne pas opérer de la même façon sur différents paramétrages régionaux. Spécialement quand le séparateur de décimal est différent de "." dans la locale du processus qui peut entraîner des erreurs de lecture quand le mapfile contient des nombres flottants. Puisque le processus MONO prend en charge les paramètres régionaux de l'environnement, il est utile d'envisager de définir les paramètres régionaux par défaut à "C" du processus hébergé, par exemple :: ::

source: Most frequent errors
fr: Erreurs les plus fréquentes

source: This chapter will summarize the most frequent problems the user can run into. The issues were collected mainly from the -users list and the IRC.
fr: Ce chapitre résume les problèmes les plus fréquents sur lequel l'utilisateur peut tomber. Les problèmes sont collectés principalement de la liste -user et sur IRC.

source: You can get this problem on Windows and in most cases it can be dedicated to a missing or an unloadable shared library. The error message talks about mapscript.dll but surely one or more of the dll-s are missing that libmap.dll depends on. So firstly you might want to check for the dependencies of your libmap.dll in your application directory. You can use the Visual Studio Dependency Walker to accomplish this task. You can also use a file monitoring tool (like SysInternal's filemon) to detect the dll-s that could not be loaded. I propose to store all of the dll-s required by your application in the application folder. If you can run the drawmap C# sample application with your mapfile your compilation might be correct and all of the dlls are available.
fr: Vous pouvez avoir ce problème sous Windows et dans la plupart des cas, il peut être dû à une bibliothèque partagée manquante ou impossible à charger. Le message d'erreur parle de mapscript.dll mais il manque surement une ou plusieurs dll-s dont le fichier libmap.dll dépend. Ainsi en premier lieu, vous devriez vérifier les dépendances de votre fichier libmap.dll dans votre répertoire d'application. Vous pouvez utiliser le logiciel Visual Studio Dependency Walker pour accomplir cette tâche. Vous pouvez aussi utiliser un outil de monitoring de fichiers (comme filemon fourni par SysInternal) pour détecter les dll-s qui ne peuvent pas être chargées. Je propose de stocker toutes les dll-s requises par votre application dans votre répertoire d'application. Si vous pouvez lancer les applications exemples C# drawmap avec votre mapfile, votre compilation devrait être correcte et toutes vos dlls seraient disponibles.

source: You may find that the MapScript C# interface behaves differently for the desktop and the ASP.NET applications. Although you can run the drawmap sample correctly you may encounter the dll loading problem with the ASP.NET applications. When creating an ASP.NET project your application folder will be '\Inetpub\wwwroot\[YourApp]\bin' by default. The host process of the application will aspnet_wp.exe or w3wp.exe depending on your system. The application will run under a different security context than the interactive user (under the context of the ASPNET user by default). When placing the dll-s outside of your application directory you should consider that the PATH environment variable may differ between the interactive and the ASPNET user and/or you may not have enough permission to access a dll outside of your application folder.
fr: Vous allez peut être trouver que l'interface mapscript C# se comporte différemment pour les applications desktop et ASP.NET. Bien que vous puissiez lancer correctement l'exemple drawmap, vous rencontrerez peut-être le problème de chargement de dlls avec les applications ASP.NET. Quand vous créez un projet ASP.NET, votre répertoire d'application sera '\Inetpub\wwwroot\[YourApp]\bin' par défaut. Le processus hôte de l'application sera aspnet_wp.exe ou w3wp.exe en fonction de votre système. L'application tournera dans un context de sécurité différent de l'utilisateur interactif (sous le contexte de l'utilisateur ASPNET par défaut). Quand vous placez les dll-s en dehors de votre répertoire d'application, vous devriez prendre en compte les différences de valeurs de la variable d'environnement PATH entre l'utilisateur interactif et ASPNET et/ou que nous n'ayiez pas assez de droits pour accéder à une dll en dehors de votre répertoire d'application.

source: Bug reports
fr: Rapports de bugs

source: If you find a problem dedicated to the MapScript C# interface feel free to file a bug report to the `Issue Tracker <https://github.com/mapserver/mapserver/issues>`__.
fr: Si vous trouvez un problème associé à l'interface MapScript C# interface, h'ésitez pas à compléter un rapport de bug sur `le gestionnaire de bugs <https://github.com/mapserver/mapserver/issues>`__.

source: IIS Setup for MapServer
fr: Paramétrage de IIS pour MapServer

source: Table of Contents
fr: Table des matières

source: Some help on how to set up MapServer/Chameleon/PhpPgAdmin on Microsoft IIS (v5.0). Contains note on changes to the php.ini file and necessary changes to the MapServer mapfiles. Please contribute or make changes as required.
fr: Un peu d'aide sur comment configurer MapServer/Chameleon/PhpPgAdmin sur Microsoft IIS (v5.0). Elle contient des notes sur les changements dans le fichier php.ini et dans ceux nécessaires dans les mapfiles MapServer. Merci de contribuer ou de faire les changements requis.

source: Base configuration
fr: Configuration de base

source: PhpPgAdmin 3.5.4 (if using postgresql/postgis)
fr: PhpPgAdmin 3.5.4 (si vous utilisez postgresql/postgis)

source: Postgres 8.0.3 (if using postgresql/postgis)
fr: Postgres 8.0.3 (si vous utilisez postgresql/postgis)

source: Postgis 1.0.3 (if using postgresql/postgis)
fr: Postgis 1.0.3 (si vous utilisez postgresql/postgis)

source: This setup assumes that MS4W was unzipped to form c:\\ms4w\\ directory.<br>
fr: Cette configuration assume que MS4W a été décompressé pour avoir le répertoire c:\\ms4w\\.

source: Php.ini file
fr: Fichier php.ini

source: session.save_path (absolute path to your tmp directory)
fr: session.save_path (chemin absolu de votre répertoire tmp)

source: extension_dir (relative path to your php/extensions directory)
fr: extension_dir (chemin relatif à votre répertoire d'extensions php)

source: enable the pg_sql extension (php_pgsql.dll) (for Postgresql)
fr: activez l'extension pg_sql (php_pgsql.dll) (pour Postgresql)

source: Internet Services Manager
fr: Gestionnaire de service Internet

source: Under your website tree, create a new website (e.g. msprojects). View the properties for the new website.
fr: Sous votre arborescence de site web, créer un nouveau site web (nommé msprojects). Voir les propriétés pour le nouveau site web.

source: Web Site Tab
fr: Onglet Site Web

source: set the IP address and under the Advanced tab put the complete Host Header name (e.g.msprojects.gc.ca).
fr: configurer l'adresse IP et sous l'onglet Avancé, met le nom d'entête de l'hôte complet (c'est à dire msprojects.gc.ca).

source: Home Directory Tab
fr: Onglet Répertoire de base

source: content should come from: A directory located on this computer.
fr: le contenu devrait venir: d'un répertoire situé sur cet ordinateur.

source: Local Path: c:\\ms4w\\Apache\\htdocs
fr: Chemin Local : c:\\ms4w\\Apache\\htdocs

source: Read access + whatever else you need
fr: Accès en lecture + et autres éléments dont vous avez besoin

source: Execute Permissions: Scripts only
fr: Permissions d'exécution : seulement les scripts
