Repository: geographika/MapServer-documentation
Catalog: translated/*/installation.po
Languages: fr

source: Configuration button - App Mappings (Add extensions .php and .phtml, Executable is c:\\ms4w\\Apache\\cgi-bin\\php.exe,select All verbs, Script Engine, and check that file exists<br>
fr: Bouton Configuration - routing des applications (Ajoutez les extensions .php et .phtml, l'exécutable est c:\\ms4w\\Apache\\cgi-bin\\php.exe, sélectionnez Tous les verbes, Moteur de script, et vérifiez que ce fichier existe<br>

source: Documents Tab
fr: Onglet documents

source: Add index.phtml and index.html
fr: Ajoutez index.phtml et index.html

source: Directory Security Tab
fr: Onglet Sécurité de répertoire

source: Anonymous access amd authentication control
fr: Accès anonyme et contrôle de l'authentification

source: Select Anonymous access and the edit button should indicate the IUSR_account
fr: Sélectionner Accès anonyme et le bouton d'édition doit indiquer le IUSR_account

source: Server Extensions Tab
fr: Onglet Extensions serveur

source: Enable authoring is selected and client scripting says Javascript
fr: Activation de la création est sélectionnée et script client affiche JavaScript

source: Under the tree for your new website - add virtual directories for
fr: Sous l'arborescence pour votre nouveau site web - ajouter des répertoires virtuels pour

source: Under Properties, virtual directory tab Local Path should point to c:\\ms4w\\apache\\cgi-bin. Select Read. Execute Permissions should say "scripts and executables"
fr: Sous Propriétés, onglet répertoire virtuel Local Path doit pointer vers c:\\ms4w\\apache\\cgi-bin. Sélectionner Read, Les permissions d'exécution doit indiquer "scripts et éxecutables".

source: Under Properties, virtual directory tab Local Path should point to c:\\ms4w\\tmp\\ms_tmp. Select Read, Write. Execute Permissions should say "scripts only". This is where temporary images are written to so in the File system Security tab (use windows explorer), the c:\\ms4w\\tmp\\ms_tmp directory should have permissions set for the Internet Guest Account (Read and execute, Read, Write, List Folder Contents).
fr: Sous Propriétés, onglet répertoire virtuel, Chemin Local doit pointer sur c:\\ms4w\\tmp\\ms_tmp. Sélectionner Lecture, Écriture. Permissions d'exécution doit indiquer "scripts seulement". C'est le répertoire dans lequel les images temporaires sont écrites donc dans l'onglet Sécurité du système de fichiers (utilisez l'explorateur windows), le répertoire c:\\ms4w\\tmp\\ms_tmp doit avoir les permissions définies pour le compte Internet Guest (Lecture et exécution, Lecture, Écriture, Lister les contenus du répertoire).

source: Under Properties, virtual directory tab Local Path should point to c:\\ms4w\\tmp. Select Read, Write. Execute Permissions should say "scripts only". This is where chameleon writes sessions to so in the File system Security tab (use windows explorer), the c:\\ms4w\\tmp directory should have permissions set for the Internet Guest Accounnt (Read and execute, Read, Write, List Folder Contents).
fr: Sous Propriétés, onglet répertoire virtuel, Chemin Local doit pointer sur c:\\ms4w\\tmp. Sélectionner Lecture, Écriture. Permissions d'exécution doit indiquer "scripts seulement". C'est le répertoire dans lequel chameleon écrit les sessions donc dans l'onglet Sécurité du système de fichiers (utilisez l'explorateur windows), le répertoire c:\\ms4w\\tmp doit avoir les permissions définies pour le compte Internet Guest (Lecture et exécution, Lecture, Écriture, Lister les contenus du répertoire).

source: Under Properties, virtual directory tab Local Path should point to C:\\ms4w\\apps\\chameleon\\htdocs. Select Read. Execute Permissions should say "scripts only". Under the Chameleon tree, you can add virtual directories for admin (c:\\ms4w\\apps\\chameleon\\admin\\htdocs), samples (c:\\ms4w\\apps\\chameleon\\samples\\htdocs), cwc2 (c:\\ms4w\\apps\\chameleon\\cwc2\\htdocs)
fr: Sous Propriétés, onglet répertoire virtuel, Chemin Local doit pointer sur C:\\ms4w\\apps\\chameleon\\htdocs. Sélectionner Lecture, Écriture. Permissions d'exécution doit indiquer "scripts seulement". Sous l'arborescence Chameleon, vous pouvez ajouter des répertoires virtuels pour l'administration (c:\\ms4w\\apps\\chameleon\\admin\\htdocs), exemples (c:\\ms4w\\apps\\chameleon\\samples\\htdocs), cwc2 (c:\\ms4w\\apps\\chameleon\\cwc2\\htdocs).

source: If using postgresql/postgis, under Properties, virtual directory tab Local Path should point to C:\\ms4w\\Apache\\htdocs\\phpPgAdmin. Select Read, Write. Execute Permissions should say "scripts and executables". Under Documents - add index.php.
fr: Si vous utilisez PostgreSQL/PostGIS, sous Propriétés, onglet répertoire virtuel Chemin Local doit indiquer C:\\ms4w\\Apache\\htdocs\\phpPgAdmin. Sélectionner Lire, Écrire. Les permissions d'exécution doivent indiquer "scripts et exécutables". Sous Documents - ajoutez index.php.

source: We had to unzip the phppgadmin package into this directory in order to get phppgadmin to show us the login page at http://yourserver/phppgadmin/index.php. You might want additional security on this directory.
fr: Nous devons dézipper le paquet phppgadmin dans ce répertoire afin d'obtenir la page d'identification de phppgadmin sur http://yourserver/phppgadmin/index.php. Vous pourriez vouloir une sécurité supplémentaire sur ce répertoire.

source: Good for testing purposes. Remember to change your mapfiles as discussed in Mapfiles for IIS below. Under Properties, virtual directory tab Local Path should point to C:\\ms4w\\apps\\gmap\\htdocs. Select Read. Execute Permissions should say "scripts only".
fr: Utile pour des phases de tests. Souvenez vous de changer vos mapfiles comme discuter dans Mapfiles pour IIS ci-dessous. Sous Propriétés, onglet répertoire virtuel Chemin Local doit indiquer C:\\ms4w\\apps\\gmap\\htdocs. Sélectionnez Lecture. Les permissions d'exécution doivent indiquer "script seulement".

source: Test PHP
fr: Test de PHP

source: In a command line window, navigate to c:\\ms4w\\apache\\cgi-bin and run php -i. This should return the output that the phpinfo() function returns. I got an error about how it couldn't find ntwdblib.dll. I found this in c:\\ms4w\\apache\\php\\dlls and I copied it to the cgi-bin directory.
fr: Dans une fenêtre de ligne de commande, allez dans c:\\ms4w\\apache\\cgi-bin et lancez php -i. Cela devrait vous retourner la sortie que la fonction phpinfo() retourne. J'obtiens une erreur comme quoi php ne peut pas trouver ntwdblib.dll. Je l'ai trouvé dans c:\\ms4w\\apache\\php\\dlls et je l'ai copié dans le répertoire cgi-bin.

source: Mapfiles for IIS
fr: Les mapfiles pour IIS

source: Add a config line to the MAP level of the mapfile
fr: Ajouter une ligne de configuration au niveau MAP du mapfile

source: change the IMAGEPATH to be an absolute path to your tmp/ms_tmp folder
fr: changer la variable IMAGEPATH pour qu'elle soit un chemin absolu par rapport à votre dossier tmp/ms_tmp

source: Configuration files:
fr: Fichiers de configuration

source: For Chameleon
fr: Pour Chameleon

source: For phppgadmin: (if using postgresql/postgis)
fr: Pour phppgadmin: (si postgresql/postgis est utilisé)

source: Oracle Installation
fr: Installation d'Oracle

source: Preface
fr: Préface

source: This document explains the whole configuration needed to get the connect between MapServer :ref:`cgi` and an Oracle database server on a linux (Ubuntu) box. The aim of this document is just to put a lot of googled knowledge in ONE place. Hopefully it will preserve many of people spending analog amount of time than I did!
fr: Ce document explique la configuration complète nécessaire pour avoir la connexion entre le :ref:`cgi` MapServer et un serveur de base de données Oracle sous une machine linux (Ubuntu). Le but de ce document est juste de compiler une connaissance "google" à UN seul endroit. En espérant qu'il permettra à de nombreuses personnes de passer autant de tant que nous pour cela.

source: This manual was written, because I spent several days googling around to get my UMN having access to an oracle database. I'm NOT an oracle expert, so the aim of this document is just to put a lot of googled knowledge in ONE place. Hopefully it will preserve many of people spending analog amount of time than I did! (Or: If you have the choice: Try :ref:`PostGIS <input_postgis>` ;-))
fr: Ce manuel a été écrit, parce que j'ai perdu plusieurs jours sur Google pour permettre à mon Mapserver d'accéder à une base de données Oracle. Je ne suis PAS un expert Oracle, donc le but du document est juste de concentrer à UN seul endroit cette connaissance éparpillée. En espérant, que cela évitera à d'autres utilisateurs de perdre autant de temps sur ce problème que moi! (Ou si vous avez le choix, essayez :ref:`PostGIS <input_postgis>` ;-))

source: Before we start, some basic knowledge, I didn't know before:
fr: Avant que nous commencions, quelques connaissances basiques que nous ignorions avant:

source: MapServer can access oracle spatial as well as geodata from any oracle locator installation! Oracle locator comes with every oracle instance, there is no need for an extra license.
fr: MapServer peut accéder à de la donnée dans n'importe quelle installation de Oracle Spatial ou de Oracle Locator! Oracle locator est fournit avec chaque instance de Oracle, il n'y a pas de licence supplémentaire pour cela.

source: There is no need for further installation of any packages beside oracle/oracle OCI
fr: Il n'y a pas besoin de faire l'installation d'autres paquets à part oracle/oracle OCI

source: System Assumptions
fr: Suppositions système

source: We assume that Oracle is already installed, there is a database and there is some geodata in the database. The following paths should be known by the reader:
fr: Nous assumons que Oracle est déjà installé, qu'il y a une base de données et qu'elle contient des données géospatiales. Les chemins suivants doivent être connus par le lecteur:

source: We also assume that you have installed **apache2** (our version was 2.0.49) and you are used to work with Linux/UNIX systems. We also think you are able to handle the editor :ref:`vi/vim <vim>`.
fr: Nous supposons aussi que vous avez installé **apache2** (notre version était la 2.0.49) et vous êtes habitués à travailler avec des systèmes Linux/UNIX. Nous présupposons égelement que vous êtes capables d'utiliser l'éditeur :ref:`vi/vim <vim>`.

source: We ensure that the Oracle user who later accesses the database has write-access to the oracle_home directory.
fr: Nous nous assurons que l'utilisateur Oracle qui a accédé plus tôt à la base de données a les droits d'écriture au répertoire oracle_home.

source: We also assume, that you already have setup the tnsnames.ora file. It should look like that:
fr: Bous assumon aussi que vous avez déjà configuré le fichier tnsnames.ora. Il devrait ressembler à ceci:

source: It is important that you know the NAME of the datasource, in this example this is "MY_ORACLE" and will be used further on. Done that, you're fine using ``User/Password@MY_ORACLE`` in your mapfile to connect to the oracle database. But first we have to do some more stuff.
fr: Il est important que vous connaissiez le NOM de votre source de données, dans cet exemple, c'est "MY_ORACLE" et ile sera utilisé plus loin. Après avoir fait cela, vous pouvez définir ``User/Password@MY_ORACLE`` dans votre mapfile pour vous connecter à la base de données Oracle. Mai avant, nous avons encore des choses à faire.

source: Compile MapServer
fr: Compiler Mapserver

source: Compile as normal compilation and set this flag:
fr: Compiler comme une compilation normale et définir ce drapeau:

source: If MapServer configure and make runs well, try
fr: Si le "configure" et le make de MapServer se passent bien, essayez

source: This should at least give this output:
fr: Cela devrait au minimum vous renvoyer cette sortie:

source: If you got that, you're fine from the MapServer point of view.
fr: Si vous avez ça, vous êtes bons du point de vue de Mapserver

source: Set Environment Variables
fr: Définir les variables d'environnement

source: It is important to set all environment variables correctly. There are one the one hand system-wide environment variables to be set, on the other hand there should be set some for the cgi-directory in your Apache configuration.
fr: Il est important de régler correctement toutes les variables d'environnement. ceraines sont pour la configuration complète du système et d'autres sont utilisées pour le répertoire cgi dans votre configuration Apache.

source: System Variables
fr: Variables système

source: On Ubuntu (and on many other systems) there is the file "/etc/profile" which sets environment variables for all users on the system (you may also dedicate user-specific environment variables by editing the users ".profile" file in their home directory, but usually the oracle database users are not users of the system with their own home)
fr: Sur Ubuntu (et de nombreux autres systèmes), il y a un fichier "/etc/profile" qui définit les variables d'environnement pour tous les utilisateurs du système (vous voudrez peut être des variables d'environnement spécifiques en éditant le fichier des utilisateurs ".profile" dans leur répertoire home, mais habituellement les utilisateurs de la base de données Oracle ne sont pas des utilisateurs du système avec leur propre home)

source: Set the following variables:
fr: Définir les variables suivantes

source: The command comes silent, so there is no system output if you didn't mistype anything!
fr: La commande est silencieuse, donc il n'y a pas de sortie système si vous n'avez pas fait d'erreur de frappe!

source: Setting the Apache Environment
fr: Paraméter l'environnement Apache

source: Sometimes it is confusing WHERE to set WHAT in the splitted apache2.conf-files. In the folder "/etc/apache2/sites_available" you find your sites-file. If you did not do sth. Special e.g. installing virtual hosts, the file is named "default". In this file, the apache cgi-directory is defined. Our file looks like this:
fr: Parfois, il est difficile de savoir OÙ définir QUOI dans les fichiers découpés apache2.conf-*. Dans le dossier "/etc/apache2/sites_available" vous trouverez votre fichier de sites. Si vous n'avez rien fait de spécial c'est à dire installer des hôtes virtuels, le fichier se nomme "default". Dans ce fichier, le répertoire cgi de Apache est défini. Votre fichier devrait ressembler à quelque chose comme cela:

source: In this file, the local apache environment variables must be set. We did it within a location-block like this:
fr: Dans ce fichier, les variables d'environnement locales doivent être définies. Nous avons fait cela dans un bloc "location" ressemblant à ceci:

source: Where /cgi-bin/ in the opening location block refers to the script alias /cgi-bin/ and the TNS_ADMIN directory point to the location of the tnsnames.ora file.
fr: Où /cgi-bin/ dans le bloc "location block" se réfère au script alias /cgi-bin/ et le répertoire TNS_ADMIN pointe vers l'emplacement du fichier tnsnames.ora.

source: Then restart apache:
fr: Ensuite, redémarrer apache:

source: Create mapfile
fr: Créer un mapfile

source: Before we start creating our mapfile ensure that you have a your access data (User/Password) and that you know the Oracle SRID, which could be different from the proj-:term:`EPSG`!
fr: Avant de commencer à créer votre mapfile, assurez-vous d'avoir un accès à la base de données (Utilisateur/Mot de passe) et que vous connaissiez le SRID Oracle, qui peut être différent du code :term:`EPSG` de PROJ!

source: The data access parameters:
fr: Les paramètres d'accès aux données

source: Where:
fr: Où:

source: GEOM is the name of the geometry column
fr: GEOM est le nom de colonne géométrique

source: MY_LAYER the name of the table
fr: MY_LAYER le nom de la table

source: 82032 is equivalent to the EPSG code 31468 (German projection system)
fr: 82032 est l'équivalent au code EPSG 31468 (système de projection de l'Allemagne)

source: Testing & Error handling
fr: Tests et gestion dees erreurs

source: So you are fine now. Load the mapfile in your application and try it. If everything goes well: Great, if not, possibly this ugly error-emssage occurs (this one cmae by querying MapServer through the WMS interface as a GetMap-request):
fr: Donc, c'est bien maintenant. Charger le mapfile dans votre application et l'essayer. Si tout se passe bien, Super; sinon, un message d'erreur peut avoir lieu (celui-ci vient d'une requête GetMap interrogeant Mapserver via l'interface WMS):

source: This points us towards, that there might be a problem with the connection to the database. First of all, let's check, if the mapfile is all right. Therefore we use the MapServer utility program :ref:`shp2img`.
fr: Cela nous renvoie qu'il y a peut être un problème avec la connexion à la base de données. Avant tout, vérifions si le mapfile est bon. Poir cela, nous utilisons le programme utilitaire Mapserver :ref:`shp2img`.

source: Let's assume you are in the directory, where you compiled MapServer and run shp2img:
fr: Assumons que vous êtes dans le répertoire où vous avez compilé Mapserver et lancez shp2img :

source: The output of the command should look like this:
fr: La sortie de la commande devrait ressembler à cela

source: If not, this possibly points you towards any error in your mapfile or in the way to access the data directly. In this case, take a look at :ref:`oci`. If there is a problem with your oracle connect, the same message as above (MsDrawMap() ...) occurs. Check your mapfile syntax and/or the environment settings for Oracle.
fr: Si ce n'est pas le cas, cela vous guidera vers n'importe quelle erreur de votre mapfile ou une manière d'accéder à la donnée directement. Dans ce cas, regardez :ref:`oci`. S'il y a un problème avec votre connexion à Oracle, le même message que ci-dessus (MsDrawMap() ...) devrait être renvoyé. Vérifiez la syntaxe de votre mapfile et/ou la configuration de l'environnement pour Oracle.

source: For Debian/Ubuntu it's worth also checking the file "/etc/environment" and test-wise to add the system variables comparable to `System Variables`_
fr: Pour Debian/Ubuntu, ça vaut aussi le coup de vérifier le fichier "/etc/environment" et de tester judicieusement l'ajout de variables système comparables à `System Variables`_

source: If the output is OK, you may have a look at the generated image (output.png). Then your problem reduces to the access of apache to oracle home directory. Carefully check your apache configuration. Please note, that the apache.config file differs in several linux-distributions. For this paper we talk about Ubuntu, which should be the same as Debian.
fr: Si votre sortie est OK, vous devriez regarder aussi l'image générée (output.png). Ensuite, votre problème se réduit aux accès de apache au répertoire home de oracle. Vérifiez avec attention votre configuration apache. Merci de noter que le fichier de configuration de apache diffère selon les distributions linux. Pour ce document, nous parlons de Ubuntu, qui devrait être similaire à celui de Debian.

source: PHP MapScript Installation
fr: Installation de PHP MapScript

source: The PHP/MapScript module is a PHP dynamically loadable module that makes MapServer's MapScript functions and classes available in a PHP environment.
fr: Le module PHP/MapScript est un module PHP chargeable dynamiquement qui met à disposition les fonctions et les classes de MapScript Mapserver dans un environnement PHP.

source: The original version of MapScript (in Perl) uses `SWIG`_, but since SWIG does not support the PHP language, the module has to be maintained separately and may not always be in sync with the Perl version.
fr: La version originale de MapScript (en Perl) utilise `SWIG`_, mais comme SWIG ne supporte pas le langage PHP, le module doit être maintenu séparément et peut ne pas être parfaitement synchronisé avec la version Perl.

source: The PHP module was developed by `DM Solutions Group`_ and is currently maintained by `Mapgears`_.
fr: Le module PHP a été développé par `DM Solutions Group`_ et est maintenu actuellement par `Mapgears`_.

source: This document assumes that you are already familiar with certain aspects of your operating system:
fr: Ce document assume que vous êtes déjà familier avec certains aspects de votre système d'exploitation:

source: For Unix/Linux users, a familiarity with the build environment, notably *make*.
fr: Pour les utilisateurs Unix/Linux, une familiarité avec l'environnement de compilation, particulièrement *make*.

source: For Windows users, some compilation skills if you don't have ready access to a pre-compiled installation and need to compile your own copy of MapServer with the PHP/MapScript module.
fr: Pour les utilisateurs Windows, quelques compétences en compilation si vous n'avez pas accès à une installation précompilée et que vous avez besoin de compiler votre propre version de Mapserver avec le module PHP/MapScript

source: Which version of PHP is supported?
fr: Quelle version de PHP est supportée?

source: PHP MapScript was originally developed for PHP-3.0.14 but after MapServer 3.5 support for PHP3 has been dropped and as of the last update of this document, PHP 4.3.11 or more recent was required (PHP5 is well supported).
fr: PHP MapScript a été initialement été développé pour PHP-3.0.14 mais après MapServer 3.5, le support de PHP3 a été abandonné et lors de la dernière mise à jour de ce document, PHP 4.3.11 ou plus était requis (PHP5 est bien supporté).

source: The best combinations of MapScript and PHP versions are:
fr: Les meilleurs combinaisons entre les versions de MapScript et PHP sont:

source: MapScript 4.10 with PHP 5.2.1 and up
fr: MapScript 4.10 avec PHP 5.2.1 et plus

source: MapScript 4.10 with PHP 4.4.6 and up
fr: MapScript 4.10 avec PHP 4.4.6 et plus

source: How to Get More Information on the PHP/MapScript Module for MapServer
fr: Comment avoir plus d'informations sur le module PHP/MapScript pour MapServer

source: For a list of all classes, properties, and methods available in the module see the :ref:`phpmapscriptapi` reference document.
fr: Pour une liste de toutes les classes, propriétés, et méthodes disponibles dans le module, voir le document de référence :ref:`php_mapscript`.

source: More information on the PHP/MapScript module can be found on the `PHP/MapScript page`_ on MapTools.org.
fr: Plus d'informations sur me module PHP/MapScript peut être trouvée sur la page `PHP/MapScript page`_ sur le site MapTools.org.

source: The `MapServer Wiki`_ also has PHP/MapScript build and installation notes and some php code snippets.
fr: Le `Wiki MapServer`_ a aussi des notes sur la compilation et l'installation de PHP/MapScript et quelques exemples de codes php.

source: Questions regarding the module should be forwarded to the :ref:`MapServer mailing list <lists>`.
fr: Les questions concernant le module doivent être adressées par la :ref:`liste de diffusion MapServer <lists>`.

source: Obtaining, Compiling, and Installing PHP and the PHP/MapScript Module
fr: Obtenir, compiler et installer PHP et le module PHP/MapScript

source: Download PHP and PHP/MapScript
fr: Télécharger PHP et PHP/MapScript

source: The PHP source or the Win32 binaries can be obtained from the `PHP web site`_.
fr: Les sources de PHP ou les binaires Win32 peuvent être obtenus sur le `site web de PHP <PHP web site>`_.

source: Once you have verified that PHP is installed and is running, you need to get the latest :ref:`MapServer source <download>` and compile MapServer and the PHP module.
fr: Une fois vérifié que vous avez PHP installé et fonctionnel, vous avez besoin d'obtenir les dernières :ref:`sources de MapServer <download>` et de compiler MapServer et le module PHP associé.

source: Setting Up PHP on Your Server
fr: Configurer PHP sur votre serveur
