Repository: geographika/MapServer-documentation
Catalog: translated/*/installation.po
Languages: fr

source: However, there can be a variety of reasons to want to build MapServer from source on win32. Reasons include the need to enable specific options, to build with alternate versions of support libraries (such as GDAL), the desire for MapScript support not part of the core builds, the need to debug and fix bugs or even to implement new features in MapServer. To make it easy for users and developers, I've made a list of steps to compile MapServer. Background information is provided in each step, along with examples. Each example is a continuation of the previous one and in the end will produce the MapServer DLL (libmap.dll), the CGI program (the mapserv.exe), and utility programs.
fr: Cependant, il y a plusieurs raison de vouloir compiler MapServer à partir des sources sous win32. Ces raisons inclues la nécessité d'activer des options spécifiques, de le compiler avec des versions différentes de bibliothèques (comme GDAL), la volonté de la gestion de MapScript qui ne fait partie du coeur de la compilation, le besoin de débuguer et de corriger des bugs ou même d'implémenter de nouvelles fonctionnalités dans MapServer. Pour faciliter cela pour les utilisateurs et les développeurs, j'ai réalisé une liste d'étapes, accompagné d'exemples. Chaque exemple est une poursuite du précédent et se terminera par des programmes utilitaires, le programme CGI (mapserv.exe), le DLL MapServer (libmap.dll).

source: If you are new to Windows programming, please follow this document carefully. The compilation steps are fairly simple but I've added a few blurbs in each step to help you understand how MapServer compiles. For the more experienced programmers, perhaps reading the README.Win32 that accompanies the MapServer source code would be more useful. For those who are antsy, compiling MapServer involves download and unpacking the source codes, editing the make files, and invoking Microsoft's Visual C++ compiler from the command prompt. The resulting mapserv.exe is the CGI program that installs in the cgi-bin directory of your web server.
fr: Si vous êtes nouveau à la programmation Windows, s'il vous plaît suivez ce document soigneusement. Les étapes de compilation sont assez simples mais j'ai ajouté quelques textes de présentation à chaque étape pour vous aider à comprendre comment MapServer compile. Pour les programmeurs expérimentés, peut être que la lecture du fichier README.Win32 qui accompagne le code source MapServer sera plus utile. Pour ceux qui sont impatients, compiler MapServer implique le téléchargement et le désarchivage du code source, éditer les fichiers make et invoquer le compiler Visual C++ de Microsoft à partir de la ligne de commande. Le mapserver.exe résultant est le programme CGI qui s'installe dans le répertoire cgi-bin de votre serveur web.

source: For those who are willing to take the time, the compilation steps follow.
fr: Pour ceux qui veulent prendre le temps, les étapes de compilation suivent

source: Set up a Project Directory
fr: Définir un répertoire de projet

source: Before you start to compile MapServer, I recommend creating a directory called "projects" where you can put the source code for MapServer and its supporting libraries. Since you will be working with DOS-style commands, you might as well get used to the Windows command prompt. For Windows 95/98 users the command processor would be called command.com. For Windows NT/2000/XP, it would be cmd.exe. So fire up the old command prompt and go to the drive where you want to create the project directory.
fr: Avant que vous commenciez à compiler MapServer, nous vous recommandons de créer un répertoire nommé "projets" où vous pouvez mettre le code source pour MapServer et ses bibliothèques de support. Comme, vous allez travailler avec des commandes en style DOS, vous devriez également vous habituer à la ligne de commande Windows. Pour les utilisateurs Windows 95/98, le processeur de commande devrait s'appeler command.com. Pour Windows NT/2000/XP, ce serait plutôt cmd.exe. Ainsi, lancez la vieille ligne de commande et allez sur le lecteur disque où vous voulez créer le répertoire du projet.

source: Here is an example of how to create a directory called projects on the C: drive:
fr: Voici un exemple de comment créer un répertoire appelé projects sur le lecteur disque C: :

source: To go to that directory:
fr: Allez à ce répertoire

source: From the projects directory, you can extract the source codes for MapServer and its libraries. Now you're ready to download the source codes.
fr: Depuis le répertoire projects, vous pouvez extraire les codes sources de MapServer et ses bibliothèques associées. Maintenant, vous êtes prêts à télécharger les codes sources.

source: Download MapServer Source Code and Supporting Libraries
fr: Télécharger le code source de Mapserver et les bibliothèques associées

source: After creating a project directory, download the MapServer source code and the codes for the supporting libraries and save the source code packages in the newly created "projects" directory. These source codes are usually packaged as ZIP, or as UNIX TAR and GZIP files. You'll need a software that can unzip these packages. `7-Zip`_ is an example of software that can handle these files.
fr: Après la création d'un répertoire de projet, téléchargez le code source MapServer, les codes pour les bibliothèques support et sauvez les paquets de code source dans le nouveau répertoire créé "projets". Ces codes source sont habituellement fournis sous forme de fichiers ZIP, ou TAR et GZIP UNIX. Vous aurez besoin d'un logiciel pour les décompresser. `7-Zip`_ est un exemple de logiciel qui peut gérer ces fichiers.

source: Cygwin is a free, open-source software package which is a port of these tools on Windows. You can use the gzip and tar utilities from this tool collection. Cygwin is available from http://www.cygwin.com.
fr: Cygwin est un logiciel libre, open-source qui qui est un portage de ces outils sur Windows. Vous pouvez utiliser les utilitaires gzip et tar de cette collection d'outils. Cygwin est disponible depuis le site http://www.cygwin.com.

source: In order to compile the MapServer CGI program, you must download a few required and optional libraries. At its simplest configuration, MapServer only requires the GD (to provide the image output) and REGEX (to provide regular expression support) libraries. This configuration allows the developer/data provider to use shapefiles as input and, depending on the version of GD library used, GIF or PNG images as output. Additional libraries are needed for input data in alternative formats. The libraries that work with MapServer are listed below.
fr: Dans le but de compiler le programme CGI de MapServer, vous devez télécharger quelques bibliothèques requises ou optionnelles. Dans sa configuration la plus simple, MapServer nécessite seulement les bibliothèques GD (pour fournir l'image en sortie) et REGEX (pour fournir la gestion des expressions régulières). Cette configuration permet aux développeurs/fournisseur de données d'utiliser des shapefiles comme entré et, en fonction de la version la bibliothèque GD utilisée, des images GIF ou PNG en sortie. Des bibliothèques supplémentaires sont nécessaires pour les données en entrée dans des formats alternatives. Les bibliothèques qui fonctionnent avec MapServer sont listées ci-dessous.

source: The MapServer source code
fr: Le code source de Mapserver

source: The MapServer source code can be downloaded from the :ref:`download page <download>`. If you'd like to get the current development version of the software, following the nightly snapshot link under the Interim Builds title. The absolute latest copy of the source code can be obtained from :ref:`git`; however, the GitHub respository does not contain several important source files (maplexer.c, mapparser.c and mapparser.h) normally generated on unix, so if possible, using a nightly snaphot is substantially easier than working directly from :ref:`git`.
fr: Le code source de MapServer peut être téléchargé à partir de la :ref:`page de téléchargement <download>`. Si vous désirez obtenir la version en cours de développement, suivez les liens des snapshot journalier sous le titre Compilation intermédiaire. La dernière copie du code source peut être obtenue à partir de :ref:`git` ; cependant, le dépôt GitHub ne contient pas plusieurs fichiers sources importants (maplexer.c, mapparser.c and mapparser.h) normalement généré sous unix, par conséquent, si possible, utilisez le snapshot journalier est certainement le plus facile que de travailler directement à partir de :ref:`git`.

source: **Required Libraries**
fr: **Bibliothèques nécessaires**

source: `GD Library`_:
fr: `Bibliothèque GD <GD Library_>`_:

source: MapServer uses the GD graphics library for rendering map images in GIF, PNG and JPEG format. These map images are displayed in web browser clients using the MapServer CGI. The current official version of GD is 2.0.33. The distributed makefiles are setup to use the prebuilt GD Win32 DLL binaries which include GD, libjpeg, libpng, libz, libgif and FreeType 2 all within one DLL. This package is generally listed as "Windows DLL .zip" and the latest version is normally available at http://www.boutell.com/gd/http/gdwin32.zip.
fr: MapServer utilise la bibliothèque graphique GD pour le rendu des images cartographiques au format GIF, PNG et JPEG. Ces images cartographiques sont affichées dans les navigateurs web clients en utilisant le CGI de MapServer. La version officielle actuelle de GD est la 2.0.33. Le Makefiles distribué est définie pour utiliser les binaires DLL précompilés de GD de Win32 qui inclut GD, libjpeg, libpng, libz et FreeType 2 dans une seule DLL. Ce paquet est généralement listé comme "Windows DLL .zip" et la dernière version est normalement disponible sur http://www.boutell.com/gd/http/gdwin32.zip.

source: Regex is the regular expression library used by MapServer. It can be downloaded at http://ftp.gnu.org/old-gnu/regex/regex-0.12.tar.gz
fr: Regex est une bibliothèque pour les expressions régulières utilisées par MapServer. Elle peut être téléchargée à l'adresse http://ftp.gnu.org/old-gnu/regex/regex-0.12.tar.gz

source: Optional Libraries
fr: Bibliothèques optionnelles

source: `JPEG library`_:
fr: `Bibliothèque JPEG <JPEG library_>`_:

source: This library is required by GD to render JPEG images, if building GD from source. You may download this library at http://www.ijg.org/files/jpegsrc.v6b.tar.gz
fr: Cette bibliothèque est nécessaire par GD pour le rendu des images JPEG, siGD est compilé à partir des sources. Vous pouvez télécharger cette bibliothèque sur http://www.ijg.org/files/jpegsrc.v6b.tar.gz

source: This library is required by GD to render PNG images, if building GD from source. You may download this library at http://sourceforge.net/projects/libpng/
fr: Cette bibliothèque est nécessaire par GD pour le rendu des images PNG, si GD est compilé à partir des sources. Vous pouvez télécharger cette bibliothèque sur http://sourceforge.net/projects/libpng/

source: This library is required by libpng to provide graphics compression support. It can be downloaded along with the PNG library, or at http://www.gzip.org/zlib.zip .
fr: Cette bibliothèque est nécessaire par libpng pour fournir la gestion de la compression graphique. Elle peut être téléchargé avec la bibliothèque PNG ou sur http://www.gzip.org/zlib.zip .

source: FreeType provides TrueType support in MapServer via GD. We only need to build FreeType seperately if building GD from source. It can be downloaded at http://gnuwin32.sourceforge.net/packages/freetype.htm .
fr: FreeType fournie la gestion de TrueType dans MapServer via GD. Nous avons seulement besoin de compiler FreeType séparément si nous compilons GD à partir des sources. Elle peut être téléchargé sur http://gnuwin32.sourceforge.net/packages/freetype.htm .

source: Proj.4 provides on-the-fly projection support to MapServer. Users whose data are in different projection systems can use this library to reproject into a common projection. It is also required for WMS, WFS or WCS services.
fr: Proj.4 fourni la gestion de la reprojection à la volée pour MapServer. Les utilisateurs dont les données sont dans des systèmes de projections différents peuvent utiliser cette bibliothèque pour les reprojeter dans une projection commune. Elle est aussi nécessaire pour les services WMS, WFS ou WCS.

source: The GDAL/OGR library allows MapServer to read a variety of geospatial raster formats (GDAL) and vector formats (OGR). It can be downloaded at http://www.gdal.org/.
fr: La bibliothèque GDAL/OGR permet à MapServer de lire une variété de formats géospatiales raster (GDAL) et des formats vectoriels (OGR). Il peut être téléchargé à http://www.gdal.org/.

source: ArcSDE is an ESRI proprietary spatial database engine. Most users will not have access to it but if you have ArcSDE license, you can use its libraries to give MapServer access to SDE databases.
fr: ArcSDE est le moteur de base de données spatiale propriétaire d'ESRI. La plupart des utilisateurs n'y auront pas accès mais si vous possédez une licence ArcSDE, vous pouvez utiliser ces bibliothèques pour permettre à MapServer d'accéder aux bases de données SDE.

source: This library allows MapServer to read EPPL7 datasets, as well as the older Erdas LAN/GIS files. This library is set as a default library in MapServer so there's no special source code to download.
fr: Cette bibliothèque permet à MapServer de lire les jeux de données EPPL7, ainsi que les fichiers plus vieux Erdas LAN/GIS. Cette bibliothèque est définie comme une par défaut dans MapServer, il n'y a donc pas de code source spécifique à télécharger.

source: Now that you have reviewed the libraries that provide support to MapServer, it is time to decide which ones to compile and use. We will work with the pre-built GD distributed on Boutell.com with PNG, GIF, JPEG, and FreeType "built in". If you want to provide OGC Web Services (ie. WMS, WFS) or want to perform on the fly reprojection then the PROJ.4 library will be needed. If you need additional raster and vector data sources consider including GDAL/OGR support. GDAL is also required for WCS service.
fr: Maintenant que vous avez vue les bibliothèques qui apporte des fonctionnalités à MapServer, il est temps de décider laquelle compiler et utiliser. Nous travaillerons avec la version précompilée de GD distribuée sur Boutell.com avec PNG, GIF, JPEG et FreeType inclues. Si vous désirez fournir des services web OGC (ie. WMS, WFS) ou réaliser la reprojection à la volée alors la bibliothèque Proj.4 sera nécessaire. Si vous désirez des sources de données raster et vecteur supplémentaires considérez l'inclusion de la gestion de GDAL/OGR. GDAL est aussi nécessaire pour les services WCS.

source: Our example calls for the required libraries and on-the-fly projection support so we need to download GD, regex, and Proj.4 libraries. Go ahead and get those libraries.
fr: Notre exemple appelle les bibliothèques requises et le support de reprojection à la volée, en conséquent, nous avons besoin dee bibliothèques GD, regex et Proj.4. Pousuivez et allez chercher ces bibliothèques

source: Set Compilation Options
fr: Définir les options de compilation

source: MapServer, like many of it's support libraries, comes with a Visual C++ makefile called Makefile.vc. It includes the file nmake.opt which contains many of the site specific definitions. We will only need to edit the nmake.opt file to configure the build for our local site options, and support libraries. The Makefile.vc, and nmake.opt template file have been provided by Assefa Yewondwossen, and the DM Solutions folks.
fr: MapServer, comme la plupart de ses dépendances, vient avec un makefile Visual C++ appelé Makefile.vc. Il inclut le fichier nmake.opt qui contient de nombreux définitions spécifiques au site. Nous aurons seulement besoin d'éditer le fichier nmake.opt pour configurer la compilation pour nos options de site local, et nos bibliothèques de dépendances. Le Makefile.vc, et le fichier de template nmake.opt ont été fournis par Assefa Yewondwossen et les gens de DM Solutions.

source: As of MapServer 4.4, the default MapServer build options only include GD, and regex. MapServer is built using the /MD option (which means MSVCRT.DLL should be used), so if any support libraries are being built statically (rather than as DLLs) we need to use /MD when building them as well. By default modern PROJ.4 builds use /MD so we should be able to use the default PROJ.4 build without tweaking.
fr: A partir de MapServer 4.4, les options de compilation par défaut de MapServer incluent seulement GD, et regex. MapServer est compilé en utilisant l'option /MD (ce qui signifie que MSVCRT.DLL doit être utilisé), ainsi à partir du moment où les dépendances sont compilées statiquement (plutôt que comme des DLLs), nous avons besoin d'utiliser /MD quand on les compile également. Par défaut, les versions récentes de PROJ.4 utilisent /MD, ainsi nous devrions être capable d'utiliser les sources par défaut de PROJ.4 build sans ajustement.

source: The example will compile with the GDWin32 pre-built DLL as well as regex-0.12, and PROJ.4. The PROJ.4 support will ensure we can enable MapServer OGC-WMS compatibility. Use notepad or another text editor to open the nmake.opt file and make the following changes.
fr: L'exemple sera compilé aussi bien avec la DLL précompilée GDWin32 que regex-0.12, et PROJ.4. Le support de PROJ.4 assurera que nous puvons activé la compatibilité avec les services OGC-WMS MapServer. Utilisez notepad ou un autre éditeur de texte pour ouvrir le fichier nmake.opt et faites les changements suivants.

source: Comments
fr: Commentaires

source: Use the pound sign ( # ) to comment out the lines that you want to disable, or remove the pound sign to enable an option for NMAKE.
fr: Utiliser le signe dièse ( # ) pour commenter les lignes que vous souhaitez désactiver, ou enlever le signe dièse pour activer une option pour NMAKE.

source: A. Enable PROJ.4 support, and update the path to the PROJ.4 directory. Uncomment the PROJ= line, and the PROJ_DIR= line as follows, and update the PROJ_DIR path to point to your PROJ build.
fr: A. Activer le support de PROJ.4, et mettre à jour le chemin vers le répertoire PROJ.4. Décommenter les lignes PROJ= et PROJ_DIR= comme suivant, et mettre à jour le chemin PROJ_DIR pour pointer vers les fichiers votre compilation de PROJ.

source: If you look down later in the file, you can see that once PROJ is enabled, MapServer will be linked with proj_i.lib, the PROJ.4 stub library, meaning that MapServer will be using the PROJ.DLL as opposed to statically linking in PROJ.4.
fr: Si vous regardez plus bas dans le fichier, vous pouvez voir qu'une fois que PROJ est activé, MapServer sera lié avec proj_i.lib, la bibliothèque bouchon PROJ.4, signifiant que MapServer utilisera PROJ.DLL à l'opposé d'un lien statique dans PROJ.4.

source: Uncomment the WMS option.
fr: Décommenter l'option WMS

source: Update to use GD. Here's what it should look like in our example.
fr: Mise à jour pour utiliser GD. Voici ce à quoi il devrait ressembler dans notre exemple.

source: **Note**: As distributed the GDWin32 binary build does not include the bgd.lib stub library. It is necessary to run the **makemsvcimport.bat** script in the gdwin32 directory first.
fr: **Note**: Comme il distribué, le binaire GDWin32 n'inclut pas la bibliothèque bouchon bgd.lib. Il est nécessaire en premier de lancer le script **makemsvcimport.bat** dans le répertoire gdwin32.

source: D. Make sure the regex path is set correctly. In order for the "delete" command in the "nmake /f makefile.vc clean" target to work properly it is necessary to use backslashes in the REGEX_DIR definition.
fr: D. Assurez-vous que le chemin de regex est correctement défini. Dans le but de faire fonctionner correctement la commande "delete" dans la cible de "nmake /f makefile.vc clean", il est nécessaire d'utiliser les backslashes dans la définition de REGEX_DIR.

source: Your Makefile is now set.
fr: Votre Makefile est maintenant défini.

source: Compile the Libraries
fr: Compiler les bibliothèques

source: Before compiling MapServer, you must first compile its supporting libraries. How this is done varies for each library. For the PROJ.4 library a **nmake /f makefile.vc** command in the proj-4.4.9\src directory should be sufficient. The regex-0.12 code is actually built by the MapServer build process, so you don't need to do anything there.
fr: Avant de compiler MapServer, vous devez en premier compiler les librairies de dépendances. La manière dont cela s'effectue varie selon chaque bibliothèque. Pour la bibliothèque PROJ.4, une commande **nmake /f makefile.vc** dans le répertoire proj-4.4.9\src devrait être suffisant . Le code de regex-0.12 est actuellement compilé lors du processus de compilation de MapServer, donc vous n'avez rien besoin de faire ici.

source: Compiling libcurl
fr: Compiler libcurl

source: Previously, curl libraries can be compiled using the following command:
fr: Auparavant, les bibliothèques curl pouvaient être compilées en utilisant la commande suivante:

source: This creates a static library, libcurl.lib, to which you compile against. Versions newer than version 7.10.x should be compiled as dynamic library. This is accomplished using the command:
fr: Cela crée une bibliothèque statique, libcurl.lib, contre laquelle vous allez compiler. Les versions plus récentes que la version 7.10.x devraient être compilées comme bibliothèque dynamique. Cela se fait en utilisant la commande:

source: You will then need to edit MapServer's nmake.opt to replace the CURL_LIB variable with this line:
fr: Vous aurez besoin d'éditer le nmake.opt de MapServer pour remplacer la variable CURL_LIB avec cette ligne:

source: Once you have compiled the supporting libraries successfully, you are ready to take the final compilation step. If you have not already done so, open a command prompt and set the VC++ environment variables by running the vcvars32.bat usually located in **C:\Program Files\Microsoft Visual Studio\VC98\bin\vcvars32.bat**.
fr: Un fois que vous avez compilé les librairies de dépendances avec succès, vous êtes prêts à passer à l'étape finale de compilation. Si vous ne l'avez pas encore fait, ouvrez une invite de commande et définissez les variables d'environnement VC++ en lançant vcvars32.bat habituellement situé dans **C:\Program Files\Microsoft Visual Studio\VC98\bin\vcvars32.bat**.

source: Now issue the command: **nmake /f Makefile.vc** and wait for it to finish compiling. If it compiles successfully, you should get mapserver.lib, libmap.dll, mapserv.exe, and other .EXE files. That's it for the compilation process. If you run into problems, read section 4 about compiling errors. You can also ask for help from the helpful folks in the MapServer-dev e-mail list.
fr: Maintenant exécuter la commande: **nmake /f Makefile.vc** et attendez qu'elle finisse de compiler. Si elle compile avec succès, vous devriez obtenir les fichiers mapserver.lib, libmap.dll, mapserv.exe, et d'autres .EXE. C'est tout pour le processus de compilation. Si vous rencontrez des problèmes, lisez la section 4 sur les erreurs de compilation. Vous pouvez aussi demander de l'aide aux sympathiques abonnés de la liste de diffusion MapServer-dev.

source: Compiling MapServer with PostGIS support
fr: Compiler MapServer avec le support de PostGIS

source: To compile PostGIS support into MapServer, here's what you need to do:
fr: Pour compiler le support de PostGIS dans MapServer, voici ce que vous aurez besoin de faire:
