Repository: geographika/MapServer-documentation
Catalog: translated/*/installation.po
Languages: fr

source: Your PHP CGI executable is probably not linked to support loading shared libraries. The MapServer configure script must have given you a message about a flag to add to the PHP Makefile to enable shared libs.
fr: Votre exécutable CGI PHP n'est probablement pas lié à la gestion du chargement des bibliothèques partagées. Le script configure de MapServer aurait dû vous donner un message à propos d'une option à ajouter au Makefile PHP pour activer les bibliothèques partagées.

source: Edit the main PHP Makefile and add "-rdynamic" to the LDFLAGS at the top of the Makefile, then relink your PHP executable.
fr: Éditez le Makefile PHP principal et ajoutez "-rdynamic" au LDFLAGS en haut du Makefile, puis compilez de nouveau l'exécutable PHP.

source: **Note:** The actual parameter to add to LDFLAGS may vary depending on the system you're running on. On Linux it is "-rdynamic", and on \*BSD it is "-export-dynamic".
fr: **Note :** Le paramètre actuel pour ajouter LDFLAGS peut être différent en fonction du système sur lequel vous travaillez. Sous Linux c'est "-rdynamic", et sur \*BSD c'est "-export-dynamic".

source: **What are the best combinations of MapScript and PHP versions?**
fr: **Quelles sont les meilleurs combinaisons entre les versions de MapScript et PHP?**

source: The best combinations are:
fr: Les meilleures combinaisons sont:

source: **I am dynamically loading gd.so and php_mapscript.so and running into problems, why?**
fr: **J'ai chargé dynamiquement gd.so et php_mapscript.so et je tombe sur des problèmes, pourquoi ?**

source: The source of the problems could be a mismatch of GD versions. The PHP GD module compiles its own version of libgd, and if the GD library is loaded before the mapscript library, mapscript will use the php-specific version. Wherever possible you should use a gd.so built with the same GD as PHPMapScript. A workaround is to load the php_mapscript module before the GD module.
fr: module GD

source: Download
fr: Téléchargement

source: Setup
fr: Configuration

source: Build
fr: Compilation

source: Compiling on Unix
fr: Compiler sous Unix

source: The University of Minnesota's MapServer is an open-source and freely available map rendering engine for the web. Due to its open-source nature, it can be compiled on a wide variety of platforms and operating systems. We will focus on how to obtain, compile and install MapServer on UNIX-like platforms.
fr: Mapserver de l'Université du Minnesota est un moteur de rendu cartographique pour le web, open-source et librement disponible. Par sa nature open-source, il peut être compilé sur sur une large variété de plateformes et de systèmes d'exploitation. Nous allons nous concentrer sur comment obtenir, compiler et installer MapServer sur des plateformes de type UNIX.

source: Detailed configuration options are maintained in the `INSTALL.CMAKE`_ file packaged at the root of the source directory:
fr: Les options détaillées de configuration sont maintenu dans le fichier `INSTALL.CMAKE`_ packagé à la racine du répertoire source.

source: You might also check the `MapServerCompilation`_ wiki page for additional information.
fr: Vous devriez peut-être vérifier la page de wiki ``MapServerCompilation`_ pour des informations supplémentaires.

source: Obtaining the necessary software
fr: Obtenir le logiciel nécessaire

source: You can obtain the MapServer source code as well as the demo package from the :ref:`download` section.
fr: Vous pouvez obtenir le code source de MapServer aussi bien le paquet de démo depuis la section :ref:`Téléchargement <download>`.

source: You can also get the latest MapServer source code from :ref:`git`.
fr: Vous pouvez aussi obtenir la dernière version du code source de MapServer depuis le :ref:`git`.

source: Required External Libraries
fr: Bibliothèques externes requises

source: `libpng`_: libpng should be on your system by default. 1.2.12 is the current release with security patches, although versions all the way back to 1.2.7 should work.
fr: `libpng`_ : libpng devrait être sur votre système par défaut. 1.2.12 est la version courante avec les patches de sécurité, bien que les versions antérieures jusqu'à 1.2.7 devrait fonctionner.

source: `freetype`_: Version 2.x or above is required.
fr: `freetype`_ : la version 2.x ou supérieure est requise.

source: `libjpeg`_: libjpeg allows MapServer to render images in JPEG format. A sufficient version should be installed by default on your system. Version 6b is the current version and dates back to 1998.
fr: `libjpeg`_ : libjpeg permet à MapServer de générer les images en format JPEG. Une version suffisante devrait être installée par défaut sur votre système. La version 6b est la version courante et remonte à 1998.

source: Direct JPEG support is deprecated in MapServer 5.8+, and you should now depend on GDAL for raster read support in MapServer. JPEG support is however still required for producing (i.e. writing) images.
fr: La gestion direct du JPEG est dépréciée dans MapServer 5.8 et vous devez maintenant dépendre de GDAL pour la JPEG est cependant encore nécessaire pour produire (i.e. écrire) ce type d'images.

source: `zlib`_: Zlib should be on your system by default. 1.2.1 is the current release with security patches. Though not used directly by mapserver, it's a mandatory dependency of libpng.
fr: `zlib`_ : Zlib devrait être par défaut sur votre système. La 1.2.1 est la version courante avec les patches de sécurité. Bien que pas utilisée directement par Mapserver, c'est une dépendance obligatoire pour libpng

source: Highly Recommended Libraries
fr: Bibliothèques fortement recommandées

source: `libproj`_: libproj provides projection support for MapServer. Version 4.4.6 or greater is required.
fr: `libproj`_ : libproj fournit le support des projections pour MapServer. La version 4.4.6 ou supérieure est requise.

source: `libcurl`_: libcurl is the foundation of OGC (WFS/WMS/WCS) client and server support. Version 7.10 or greater is required. Installing libcurl::
fr: `libcurl`_ : libcurl est la base pour le support du client et du serveur OGC (WFS/WMS/WCS). La version 7.10 ou supérieure est requise. Installation de libcurl::

source: `OGR`_: OGR provides access to at least 18 different vector formats.
fr: `OGR`_ : OGR fournit l'accès à au moins 18 formats vecteur différents.

source: `GDAL <http://www.gdal.org/>`__: GDAL provides access to at least 42 different raster formats.
fr: `GDAL <http://www.gdal.org/>`__: GDAL forunit l'accès à au moins 42 formats raster différents.

source: Optional External Libraries
fr: Bibliothèques externes optionnelles

source: `libtiff`_: libtiff provides TIFF (Tagged Image File Format) reading support to MapServer.
fr: `libtiff`_ : libtiff fournit la gestion de lecture du TIFF (Tagged Image File Format) pour MapServer.

source: Direct libtiff support is deprecated in MapServer 5.8+, and you should now depend on GDAL for raster read support in MapServer.
fr: La gestion directe de libtiff est déprécié dans MapServer 5.8+ et vous devez maintenant dépendre de GDAL pour la gestion de la lecture de ces raster dans MapServer.

source: `libgeotiff`_: libgeotiff provides support to read GeoTIFF files (TIFF files with geographic referencing).
fr: `libgeotiff`_ libgeotiff fournit la gestion pour lire les fichiers GeoTIFF (des fichiers TIFF avec une référence géographique).

source: Direct GeoTIFF support is deprecated in MapServer 5.8+, and you should now depend on GDAL for raster read support in MapServer.
fr: La gestion directe de geotiff est déprécié dans MapServer 5.8+ et vous devez maintenant dépendre de GDAL pour la gestion de la lecture de ces raster dans MapServer.

source: `GEOS`_: GEOS allows MapServer to do spatial predicate and algebra operations (within, touches, etc & union, difference, intersection).
fr: `GEOS`_ : GEOS permet à MapServer de faire des prédicats spatiaux et des opérations algébriques (A l'intérieur, touches, etc & union, différence, intersection).

source: `libxml`_: libxml is required to use :ref:`OGC SOS <sos_server>` support in MapServer
fr: `libxml`_ : libxml est requis pour utiliser le support :ref:`SOS OGC <sos_server>` dans MapServer

source: `SDE Client Library`_: The client libraries for your platform should be part of the ArcSDE media kit. They are *not* publicly available for download.
fr: `SDE Client Library`_ : Les bibliothèques clientes pour votre plateforme devraient faire partie du kit media ArcSDE. Elles *ne* sont pas disponibles publiquement au téléchargement.

source: `Oracle Spatial OCI`_: The client libraries for your platform are available for download from Oracle's website. Ideally, your client library matches the database you are querying from, but this is not a hard requirement.
fr: `Oracle Spatial OCI`_ : Les bibliothèques clientes pour votre plateforme sont disponibles au téléchargement depuis le site de Oracle. Idéalement, votre bibliothèque cliente correspond à la version de la base de données que vous interrogez, mais ce n'est pas une exigence contraignante.

source: `libpq`_: libpq is required to support the use of PostGIS geometries within the PostgreSQL database. Ideally, your client library matches the database you are querying from.
fr: `libpq`_ : libpq est requis pour gérer l'usage des géométries PostGIS dans la base de données PostgreSQL. Idéalement, votre bibliothèque cliente correspond à la version de la base de données que vous interrogez.

source: `libgif-dev`_: giflib is is used for reading GIF files used as PIXMAP symbols.
fr: `libgif-dev`_ : giflib est utilisé pour la lecture des fichiers GIF utilisés comme symboles PIXMAP.

source: `FastCGI`_: FastCGI is a popular protocol for interfacing MapServer with various web servers. You will need to install the development package. More details on how to use this feature in MapServer is here :ref:`fastcgi`. On Ubuntu, that would be::
fr: `FastCGI`_ : FastCGI est un protocole populaire pour interfacer MapServer avec plusieurs serveurs web. Vous devrez installer le paquet de développement. Plus de détails sur la manière d'utiliser cette fonctionnalité dans MapServer se trouve ici :ref:`fastcgi`. Sous Ubuntu, ce pourrait être : ::

source: `cairo (svg, pdf) support`_: This library is required to produce PDF and SVG outputs. If you're on an ubuntu system, it can be installed with "apt-get install -y libcairo2-dev"
fr: `cairo (svg, pdf) support`_ : cette bibliothèque est nécessaire pour produire des fichiers PDF et SVG. Si vous êtes sur une machine Ubuntu, elle peut être installée avec "apt-get install -y libcairo2-dev".

source: `kml support`_: This renderer is has no external dependency.
fr: `kml support`_ : ce moteur de rendu n'a pas de dépendance externe.

source: `GD`_: libgd is used by MapServer for rendering images. Version 2.0.28 or greater required. Version 2.0.29 or later is required to use curved (following) labels, and version 2.0.34 is required for antialiasing (1 pixel wide lines/outlines).
fr: `GD`_ : libgd est utilisé par MapServer pour générer les images. La version 2.0.28 ou supérieure est requise. La version 2.0.29 ou supérieure est requise pour l'utilisation des étiquettes courbes (comme suivant), et la version 2.0.34 est requise pour l'anticrênelage (1 pixel de large pour les lignes/contours).

source: Optional Features
fr: Fonctionnalités optionnelles

source: `cairo svg parser support`_: The WITH_SVGCAIRO option is part of a proposal to improve SVG support. Using this feature requires installing the libsvg-cairo library available here: http://cairographics.org/snapshots/ . You will need to compile and install cairo, libsvg, and libsvg-cairo.
fr: `cairo svg parser support`_ : l'option "WITH_SVGCAIRO" fait partie d'une proposition d'amélioration de la gestion du SVG. Utiliser cette fonctionnalité nécessite l'installation de la bibliothèque libsvg-cairo disponible ici : http://cairographics.org/snapshots/ . Vous devez compiler et installer cairo, libsvg et libsvg-cairo.

source: SVG support can be enabled either through the unmaintained libsvg / libsvg-cairo combo, or through librsvg at the cost of more dependencies. Use librsvg if your distro provides a package for it, or fall back to libsvgcairo if the cost of compiling the librsvg dependencies is too important.
fr: La gestion du SVG peut être activé soit via le couple non maintenu libsvg / libsvg-cairo soit via librsvg avec la contrainte de dépendances supplémentaires. Utilisez librsvg si votre distribution fournie un package pour celui-ci, ou repartez de libsvgcairo si le coût de compilation les dépendances de librsvg est trop important.

source: It is not recommended to enable the GD renderer unless you know what you are doing. It suffers from major rendering limitations, and will be completely removed in version 7.0
fr: Il n'est pas recommandé d'activer le moteur de rendu GD sauf si vous savez ce que vous faîtes. Celui-ci souffre de limitations majeures de rendu et sera complètement supprimé dans la version 7.0.

source: There are a number of issues that you should be aware of when using GD in combination with MapServer.
fr: Il y a un certain nombre de problèmes dont vous devriez être conscients quand vous utiliser GD en combinaison avec MapServer.

source: Minimum libgd versions
fr: Versions de libgd minimum

source: MapServer aggressively takes advantage of new features and bug fixes in the latest versions of libgd. The minimum required version to run MapServer is 2.0.29. Upgrading to at least 2.0.34 is advised as it includes an important bug fix for antialiased lines. Configure should detect which version of libgd you have installed, but you can quickly check yourself by issuing the following command:
fr: MapServer prend aggressivement avantages des nouvelles fonctionnalités et des corrections de bugs dans les dernières versions de libgd. La version minimale requise pour lancer MapServer est la 2.0.29. La mise à jour vers au moins la version 2.0.34 est conseillée comme elle inclut une correction de bug importante pour l'anticrênelage des lignes. L'instruction configure devrait détecter quelle version de libgd vous avez d'installé, mais vous pouvez rapidement vérifier par vous-même en exécutant la commande suivante:

source: If you intend to use international character sets, your version of libgd *must* be compiled against the GNU iconv libraries. If you are using a pre-packaged version, it is very likely that this is the case. To check for yourself, issue the following command and look for '-liconv' in the output:
fr: Si vous prévoyez d'utiliser des jeux de caractères internationaux, votre version de libgd *doit* être compilée avec les bibliothèques iconv GNU. Si vous utilisez une version pré-packagé, il est fort probable que ce soit le cas. Pour vérifier vous-même, exécuter la commande suivante et regardez pour avoir '-liconv' dans la sortie:

source: Pre-packaged/system libraries
fr: Bibliothèques précompilées/système

source: If you intend to use your system's libgd, ensure that you have the development package also installed so MapServer can find and use the appropriate headers.
fr: Si vous prévoyez d'utiliser votre version système de libgd, assurez-vous d'avoir les paquets de développement installés aussi afin que MapServer puisse trouver les en-têtes appropriés.

source: A useful FAQ on for libgd on OSX is available at `GD on OSX`_.
fr: Une FAQ utile pour libgd sur OSX est disponible sur `GD on OSX`_.

source: FreeType support
fr: Support FreeType

source: The GD you compile MapServer against MUST be compiled against the FreeType library in order to use TrueType fonts. MapServer no longer uses it's own interface to FreeType, using it through GD instead.
fr: La bibliothèque GD avec laquelle vous compilez MapServer DOIT être compilé avec la bibliothèque FreeType pour pouvoir utiliser les polices de type TrueType. MapServer n'utilise pas une interface propre pour FreeType mais utilise FreeType via GD à la place.

source: When you run your "configure" script, look for the following output:
fr: Quand vous lancez votre script "configure", regardez la sortie suivante:

source: If your GD is built against FreeType, you will see either "-DUSE_GD_TTF" (Or "-DUSE_GD_FT" for Freetype 2.x) part. If it's missing, you will need to recompile your GD to make sure you include FreeType support. See the GD documentation for more information.
fr: Si votre bibliothèque GD est compilé avec le support de FreeType, vous verrez une partie "-DUSE_GD_TTF" (Ou "-DUSE_GD_FT" pour Freetype 2.x). Si elle est manquante, vous aurez besoin de recompiler votre GD pour vous assurez d'inclure le support de FreeType. Voir la documentation de GD pour plus d'informations.

source: Also note that the configure script looks for the FreeType library separately as well, generating output looking somewhat like this:
fr: Notez aussi que le script configure regarde également la présence de la bibliothèque FreeType séparément, en générant une sortie ressemblant à ceci:

source: Even though you have FreeType installed on your system *and* the configure script finds it, does *NOT* mean you will have TrueType font support. GD *MUST* be compiled against FreeType either way.
fr: Même si vous avez FreeType installé sur votre système *et* que le script configure le trouve, cela ne veut *PAS* dire que vous aurez le support des polices TrueType. GD *DOIT* être compilé d'une manière ou d'une autre avec le support FreeType.

source: 1px Anti-Aliasing and segfaults
fr: Anticrênelage 1 pixel et erreurs de segmentation

source: Versions of libgd earlier than 2.0.34 contain a one very significant bug and will *always* cause a segfault if you attempt to do one pixel wide antialiasing. You can manually patch older gd's, or better yet upgrade to at least GD 2.0.34.
fr: Les versions de libgd plus anciennes que la version 2.0.34 contiennent un bug significatif et causeront *toujours* une erreur de segmentation si vous tentez de faire un anticrênelage ave un pixel de large. Vous pouvez patcher manuellement ces anciennes versions ou mieux encore faire une mise à jour vers un GD au moins en version 2.0.34.

source: In gd.c, function gdImageSetAAPixelColor() change:
fr: Dans gd.c, le changement de la fonction gdImageSetAAPixelColor():

source: to
fr: vers

source: More detail about this patch (if you need any) was described by Steve Lime in a `post to mapserver-users`_.
fr: Plus de détails sur ce patch (si vous en avez besoin) est décrit par Steve Lime dans une `billet de la liste mapserver-users <post to mapserver-users>`_.

source: Curved label support
fr: Support des étiquettes incurvées

source: ANGLE FOLLOW, a new feature that allows MapServer to draw curved labels about a linear feature like a road, requires libgd 2.0.29 and TrueType font support. Configure should autodetect if you have a sufficient libgd and TrueType support to be able to use this feature.
fr: ANGLE FOLLOW, une nouvelle fonctionnalité qui permet à MapServer de dessiner des étiquettes courbes le long d'un objet linéaire comme une route, requiert libgd 2.0.29 et le support des polices TrueType. Configure devrait auto-détecter si vous avez une version suffisante de libgd et le support de TrueType activé pour être capable d'utiliser cette fonctionnalité.

source: Anti-Grain Geometry Support
fr: Support de Anti-Grain Geometry (AGG)

source: Since version 5.0 MapServer supports the AGG rendering backend. MapServer 5.6+ embeds it directly in the source tree and you do not have to do anything special to have support for it.
fr: Depuis la version 5.0 MapServer gère le moteur de rendu AGG. MapServer 5.6 et supérieur l'inclut directement dans ses sources et vous n'avez plus rien à faire de spécifique pour le gérer.

source: OGC Support
fr: Support OGC

source: MapServer provides support for many `OGC`_ specifications. For an overview, see :ref:`ogc_support`.
fr: MapServer fourni la gestion de plusieurs spécifications `OGC`_ . Pour un aperçu, lisez :ref:`ogc_support`.

source: WMS support
fr: Support WMS

source: WMS Server
fr: Serveur WMS

source: Support for `WMS server` is automatically enabled.
fr: La gestion du `WMS server` est automatiquement activée.

source: You can check it by looking for the following in your configure output::
fr: Vous pouvez vérifier ceci par vous-même en cherchant ce genre de votre sortie "configure":

source: If, for some reason you don't want WMS support, you can force it off using "-DWITH_WMS=OFF".
fr: Si, pour une raison quelconque vous ne voulez pas du support WMS, vous pouvez forcez sa désactivation en utilisant "-DWITH_WMS=OFF".

source: More information on using this feature is available in :ref:`wms_server`.
fr: Plus d'informations pour utiliser cette fonctionnalité est disponible dans :ref:`wms_server`.

source: WMS Client
fr: Client WMS

source: Cascading is also supported. This allows mapserver to transparently fetch remote layers over WMS, basically acting like a client, and combine them with other layers to generate the final map.
fr: Le fonctionnement en cascade est aussi supporté. Il permet à Mapserver de récupérer de manière transparente des couches distantes via le WMS, en jouant basiquement le rôle d'un client, et en les combinant avec d'autres couches pour générer la carte finale.

source: In order to enable this feature, you will need to pass the WITH_CLIENT_WMS option to the configure script. MapServer will automatically look for libcurl, which is also required.
fr: Afin d'activer cette fonctionnalité, vous aurez besoin de passer l'option WITH_CLIENT_WMS au script configure. MapServer essayera automatiquement de chercher libcurl, qui est aussi requis.

source: To verify that this feature is enabled, check the configure output for::
fr: Pour vérifier que cette fonctionnalité est activée, vérifiez que la sortie de configure contient::

source: This feature is disabled by default, you have to specifically request it.
fr: Notez que cette fonctionnalité est désactivée par défaut, vous devez l'activez volontairement.

source: More information on using this feature is available in :ref:`wms_client`.
fr: Plus d'informations pour utiliser cette fonctionnalité est disponible sur :ref:`wms_client`.

source: WFS support
fr: Support WFS

source: WFS Server
fr: Serveur WFS

source: Support for `WFS server` is enabled by default. OGR and PROJ.4 support is required.
fr: Le support pour le `WFS server` est activé par défaut. Le support de OGR et PROJ.4 est requis.

source: If, for some reason you don't want WFS support, you can force it off using "-DWITH_WFS=OFF".
fr: Si, pour une raison quelconque vous ne voulez pas du support WFS, vous pouvez forcez sa désactivation en utilisant "-DWITH_WFS=OFF".

source: More information on using this feature is available in :ref:`wfs_server`.
fr: Plus d'informations pour utiliser cette fonctionnalité est disponible sur :ref:`wfs_server`.

source: WFS Client
fr: Client WFS

source: MapServer can also act as a WFS client. This effectively means that MapServer reads it's data from a remote server's WFS output and renders it into a map, just like it would when reading data from a shapefile.
fr: MapServer peut aussi fonctionner comme un client WFS. Cela veut dire effectivement que MapServer lit des données depuis la sortie d'un serveur WFS distant et génère depuis celle-ci une carte, comme il le ferait en lisant la donnée depuis un fichier shapefile.
