Repository: geographika/MapServer-documentation
Catalog: translated/*/installation.po
Languages: fr

source: download the PostgreSQL 8.0.1 (or later) source from: ftp://ftp.heanet.ie/pub/postgresql/source/
fr: télécharger les sources de PostgreSQL 8.0.1 (ou plus récent) depuis: ftp://ftp.heanet.ie/pub/postgresql/source/

source: I extracted them to C:\projects\postgresql-8.0.1
fr: Je les ai extrait dans C:\projects\postgresql-8.0.1

source: download the `Microsoft Platform SDK <http://www.microsoft.com/downloads/details.aspx?familyid=E6E1C3DF-A74F-4207-8586-711EBE331CDC&displaylang=en>`__ otherwise you get link errors on shfolder.lib.
fr: télécharger `le SDK de la plateforme Microsoft <http://www.microsoft.com/downloads/details.aspx?familyid=E6E1C3DF-A74F-4207-8586-711EBE331CDC&displaylang=en>`__ sinon vous aurez des erreurs de liens sur shfolder.lib.

source: compile libpq under C:\projects\postgresql-8.0.1\src\interfaces\libpq using the win32.mak makefile
fr: compiler libpq sous C:\projects\postgresql-8.0.1\src\interfaces\libpq en utilisant le makefile win32.mak

source: copy everything from C:\projects\postgresql-8.0.1\src\interfaces\libpq\release to C:\projects\postgresql-8.0.1\src\interfaces\libpq as the MapServer makefile will try to find it there
fr: copier tout de C:\projects\postgresql-8.0.1\src\interfaces\libpq\release vers C:\projects\postgresql-8.0.1\src\interfaces\libpq comme le makefile de MapServer cherchera à le trouver ici

source: Define the following in the nmake.opt for MapServer: POSTGIS =-DUSE_POSTGIS POSTGIS_DIR =c:/projects/postgresql-8.0.1/src
fr: Définir ce qui suit dans le fichier nmake.opt pour MapServer: POSTGIS =-DUSE_POSTGIS POSTGIS_DIR =c:/projects/postgresql-8.0.1/src

source: don't forget to copy libpq.dll (from C:\projects\postgresql-8.0.1\src\interfaces\libpq\release) into a location where MapServer can find it.
fr: n'oubliez pas de copier libpq.dll (depuis C:\projects\postgresql-8.0.1\src\interfaces\libpq\release) dans un emplacement où MapServer pourra le trouver.

source: Common Compiling Errors
fr: Erreurs de compilation communes

source: Following are a few common errors you may encounter while trying to build MapServer.
fr: Ce qui suit donne quelques unes des erreur courantes que vous êts susceptibles de rencontrer en essayant de compiler MapServer.

source: Visual C++ Tools Not Properly Initialized. ::
fr: Outils de Visual C++ incorrectement initialisés ::

source: This occurs if you have not properly defined the path and other environment variables required to use MS VisualC++ from the command shell. Invoke the VCVARS32.BAT script, usually with the command **C:\Program Files\Microsoft Visual Studio\VC98\bin\vcvars32.bat** or something similar if visual studio was installed in an alternate location. To test if VC++ is available, just type "nmake" or "cl" in the command shell and ensure it is found.
fr: Cela a lieu si vous n'avez pas correctement défini le chemin et les autres variables d'environnement requises pour utiliser MS VisualC++ depuis la ligne de commande. Invoquez le script VCVARS32.BAT, habituellement avec la commande **C:\Program Files\Microsoft Visual Studio\VC98\bin\vcvars32.bat** ou quelque chose de similaire si visual studio est installé dans un emplacement alternatif. Pour tester si VC++ est disponible, tapez juste "nmake" ou "cl" dans la ligne de commande et assurez-vous qu'il est trouvé.

source: Regex Build Problems. ::
fr: Problèmes de compilation des Regex

source: This occurs if you use the stock regex-0.12 we referenced. I work around this by commenting out the "extern" statement for the printchar() function, and replacing it with a stub implementation in regex-0.12\regex.c.
fr: Cela a lieu si vous utilisez le regex-0.12 que nous avons référencé. J'ai contourné ça en commentant la déclaration "extern" pour la fonction printchar(), et en la remplaçant par l'implémentation d'un bouchon dans regex-0.12\regex.c.

source: GD Import Library Missing. ::
fr: Import de la bibliothèque GD manquant::

source: If you are using the pre-built GD binaries, you still need to run the **makemsvcimport.bat** script in the gdwin32 directory to create a VC++ compatible stub library (bgd.lib).
fr: Si vous utilisez les binaires précompilés de GD, vous aurez toujours besoin de lancer le script **makemsvcimport.bat** dans le répertoire gdwin32 pour créer une bibliothèque bouchon compatible avec VC++ (bgd.lib).

source: The file we are most interested in is mapserv.exe. The other executable files are the MapServer utility programs.
fr: Le fichier qui nous intérese le plus est mapserv.exe. Les autres fichiers exécutables sont les programmes utilitaires MapServer.

source: :ref:`MapServer Utilities <utilities>`
fr: :ref:`Utilitaires MapServer <utilities>`

source: to learn more about these utilities.
fr: pour en savoir plus sur ces utilitaires

source: To test that the CGI program is working, type mapserv.exe at the command prompt. You should see the following message:
fr: Pour tester que votre programme CGI fonctionne, tapez mapserv.exe dans la ligne de commande. Vous devriez voir le message suivant:

source: You may instead get a popup indicating that a DLL (such as bgd.dll) is missing. You will need to copy all the required DLLs (ie. bgd.dll, and proj.dll) to the same directory as the mapserv.exe program.
fr: Vous aurez peut être à la place une popup indiquant qu'une DLL(comme bgd.dll) est manquante. Vous devrez copier toutes les DLLS requises (c'est à dire bgd.dll, et proj.dll) dans le même répertoire que le programme mapserv.exe.

source: Now type mapserv -v at the command prompt to get this message:
fr: Maintenant, tapez mapserv -v dans la ligne de commande pour avoir ce message:

source: This tells us what data formats and other options are supported by mapserv.exe. Assuming you have your web server set up, copy mapserv.exe, libmap.dll, bgd.dll, proj.dll and any other required DLLs to the cgi-bin directory.
fr: Cela nous dit quels formats de données et autres opions sont supportées par mapserv.exe. En assumant que vous avez un serveur web configuré, copiez mapserv.exe, libmap.dll, bgd.dll, proj.dll et les autres DLLs requises dans votre répertoire cgi-bin.

source: You are now ready to download the demo application and try out your own MapServer CGI program. If you wish, you can also create a directory to store the utility programs. I'd suggest making a subdirectory called "bin" under the directory "projects" and copy the executables to that subdirectory. You might find these programs useful as you develop MapServer applications.
fr: Vous êtes maintenant prêts à télécharger l'application de démo et à essayer votre propre programme CGI MapServer. Si vous le souhaitez, vous pouvez aussi créer un répertoire pour stocker les programmes utilitaires. Je vous suggérerait de créer un sous-répertoire appelé "bin" sous le dossier "projects" et de copier les exécutables dans ce répertoire. Vous trouverez peut être ces programmes utiles lors du développement d'applications MapServer.

source: Other Helpful Information
fr: Autres Informations utiles

source: The MapServer Unix Compilation and Installation HOWTO has good descriptions of some MapServer compilation options and library issues. I will write more about those options and issues on the next revision of this HOWTO.
fr: Les HOWTO de l'installation et de la compilation Unix donnent de bonnes descriptions de quelqu'unes des options de compilation de MapServer et ses problèmes de bibliothèques. J'écrirais plus sur ces options et problèmes dans une nouvelle révision de ce HOWTO.

source: The README documents of each of the supporting libraries provide compilation instructions for Windows.
fr: Les documents README de chaque bibliothèque supportée fournissent les instructions de compilation pour Windows.

source: The MapServer User community has a collective knowledge of the nuances of MapServer compilation. Seek their advice wisely.
fr: La communauté d'utilisateurs de MapServer a une connaissance collective des nuances de la compilation sous MapServer. Cherchez leur conseils à bon escient.

source: Acknowledgements
fr: Remerciements

source: Thanks to Assefa Yewondwossen for providing the Makefile.vc. I would not have been able to write this HOWTO without that file.
fr: Merci à Assefa Yewondwossen pour avoir fourni le fichier Makefile.vc. Je n'aurais pas été capable d'écrire ce HOWTO sans cela.

source: Thanks to Bart van den Eijnden for the libcurl and PostGIS compilation info.
fr: Merci à Bart van den Eijnden pour les informations de compilation de libcurl et PostGIS.

source: Thanks to the Steve Lime for developing MapServer and to the many developers who contribute time and effort in order to keep the MapServer project successful.
fr: Merci à Steve Lime pour le développement de MapServer et aux nombreux développeurs qui contribuent par leur temps et leurs efforts à faire du projet MapServer une réussite.
