Repository: geographika/MapServer-documentation
Catalog: translated/*/installation.po
Languages: fr

source: Check if you have PHP already installed (several Linux distributions have it built in).
fr: Vérifiez si vous avez déjà PHP d'installé (de nombreuses distributions Linux l'ont, installé par défaut).

source: If not, see the PHP manual's "`Installation on Unix systems`_" section.
fr: Si ce n'est pas le cas, voir la section "`Installation sous les systèmes Unix <Installation on Unix systems>`_" du manuel de PHP.

source: `MS4W (MapServer For Windows)`_ is a package that contains Apache, PHP, and PHP/MapScript ready to use in a simple zipfile. Several Open Source applications are also available for use in MS4W.
fr: `MS4W (MapServer pour Windows) <MS4W (MapServer For Windows)>`_ est un paquet qui contient Apache, PHP, et PHP/MapScript prêt à utiliser dans un simple fichier zip. Plusieurs applications Open Source sont aussi disponibles pour être utilisées dans MS4W.

source: Windows users can follow steps in the `Installing Apache, PHP and MySQL on Windows tutorial`_ to install Apache and PHP manually on their system.
fr: Les utilisateurs Windows peuvent suivre les étapes dans `le tutoriel installer Apache, PHP et MySQL Windows <Installing Apache, PHP and MySQL on Windows tutorial>`_ pour installer Apache et PHP manuellement sur leur système.

source: Window users running PWS/IIS can follow `php.net's howto`_ for installing PHP for PWS/IIS 3, PWS 4 or newer, and IIS 4 or newer.
fr: Les utilisateurs Windows faisant fonctionner PWS/IIS peuvent suivre le `howto php.net <php.net's howto>`_ pour installer PHP pour PWS/IIS 3, PWS 4 ou plus récent, et IIS 4 ou plus.

source: When setting up PHP on Windows, make sure that PHP is configured as a CGI and not as an Apache module because php_mapscript.dll is not thread-safe and does not work as an Apache module (See the :ref:`Example Steps of a Full Windows Installation <php_install_example_steps>` section of this document).
fr: Quand vous configurez PHP sous Windows, bérifiez bien que PHP est configuré comme un module CGI pas comme un module Apache parce que php_mapscript.dll n'est pas "thread-safe" et ne marche pas comme un module Apache (Voir la section :ref:`Exemple d'étapes d'une installation complète sous Windows <php_install_example_steps>` de ce document).

source: Build/Install the PHP/MapScript Module
fr: Compiler/installer le module PHP/MapScript

source: **Building on a Linux Box**
fr: **Compiler sur une machine Linux**

source: NOTE: For UNIX users, see the README.CONFIGURE file in the MapServer source, or see the :ref:`unix` HowTo.
fr: NOTE : Pour les utilisateurs UNIX, lisez le fichier README.CONFIGURE dans les sources MapServer ou voir le HowTo :ref:`unix`.

source: The main MapServer configure script will automatically setup the main makefile to compile php_mapscript.so if you pass the *--with-php=DIR* argument to the configure script.
fr: Le script "configure" principal de MapServer configurera automatiquement le makefile principal pour compiler php_mapscript.so si vous passez l'argument *--with-php=DIR* au script configure.

source: Copy the php_mapscript.so library to your PHP extensions directory, and then use the dl() function to load the module at the beginning of your PHP scripts. See also the PHP function `extension_loaded()`_ to check whether an extension is already loaded.
fr: Copiez la bibliothèque php_mapscript.so dans votre répertoire d'extensions PHP, et ensuite utilisez la fonction dl() pour charger le module au début de vos scripts PHP. Voir aussi la fonction PHP `extension_loaded()`_ pour vérifier si une extension est déjà chargée.

source: The file *mapscript/php3/examples/phpinfo_mapscript.phtml* will test that the php_mapscript module is properly installed and can be loaded.
fr: Le fichier *mapscript/php3/examples/phpinfo_mapscript.phtml* testera que le module php_mapscript est correctement installé et chargé.

source: If you get an error from PHP complaining that it cannot load the library, then make sure that you recompiled and reinstalled PHP with support for dynamic libraries. On RedHat 5.x and 6.x, this means adding "-rdynamic" to the CLDFLAGS in the main PHP3 Makefile after running ./configure Also make sure all directories in the path to the location of php_mapscript.so are at least r-x for the HTTPd user (usually 'nobody'), otherwise dl() may complain that it cannot find the file even if it's there.
fr: Si vous avez une erreur de PHP qui se plaint que la bibliothèque ne peut être chargée, alors assurez-vous que vous avez recompilé et réinstallé PHP avec le support des bibliothèques dynamiques. Sur RedHat 5.x et 6.x, cela signifie d'ajouter "-rdynamic" au CLDFLAGS dans le Makefile PHP3 principal après avoir lancé ./configure Vérifier aussi que tous les répertoires dans le chemin vers l'emplacement de php_mapscript.so sont au moins à r-x pour l'utilisateur du service Apache (habituellement 'nobody'), autrement dl() risque de se plaindre qu'il ne trouve pas le fichier même s'il est présent.

source: **Building on Windows**
fr: **Compiler sous Windows**

source: For Windows users, it is recommended to look for a precompiled binary for your PHP version on the :ref:`MapServer download page <download>` or on `MapTools.org`_.
fr: Pour les utilisateurs Windows, il est recommandé de regarder pour avoir un binaire précompilé pour votre version de PHP sur la :ref:`page de téléchargement de MapServer <download>` ou sur `MapTools.org`_.

source: If for some reason you really need to compile your own Windows binary then see the README.WIN32 file in the MapServer source (good luck!).
fr: Si pour une raison donnée, vous avez vraiment besoin de compiler votre propre binaire Windows, alors regardez ke fichier README.WIN32 dans les sources de MapServer (bonne chance!).

source: Installing PHP/MapScript
fr: Installer PHP/MapScript

source: Simply copy the file php4_mapscript.dll to your PHP4 extensions directory (pathto/php/extensions)
fr: Copier simplement le fichier php4_mapscript.dll dans votre répertoire d'extensions PHP4 (pathto/php/extensions)

source: Using phpinfo()
fr: Utiliser phpinfo()

source: To verify that PHP and PHP/MapScript were installed properly, create a '.php' file containing the following code and try to access it through your web server:
fr: Pour vérifier que PHP et PHP/MapScript ont été installés correctement, créez un fichier '.php' contenant le code suivant et essayez d'y accéder via votre serveur web:

source: If PHP and PHP/MapScript were installed properly, several tables should be displayed on your page, and 'MapScript' should be listed in the 'Extensions' table.
fr: Si PHP et PHP/MapScript sont installés correctement, plusieurs tables devraient être affichées dans votre page, et 'MapScript' devrait être listé dans la table 'Extensions'.

source: Example Steps of a Full Windows Installation
fr: Exemple d'étapes d'une installation complète sous Windows

source: **Using MS4W (MapServer for Windows)**
fr: **Utiliser MS4W (MapServer pour Windows)**

source: Download the latest `MS4W base package`_.
fr: Télécharger la dernière version du `paquet MS4W <MS4W base package>`_.

source: Extract the files in the archive to the root of one of your drives (e.g. C:/ or D:/).
fr: Extraire les fichiers de l'archive dans le répertoire racine d'un de vos lecteurs disque (comme. C:/ ou D:/).

source: Double-click the file /ms4w/apache-install.bat to install and start the Apache Web server.
fr: Faire un double-clic sur le fichier /ms4w/apache-install.bat pour installer et démarrer le serveur web Apache.

source: In a web browser goto http://127.0.0.1. You should see an MS4W opening page. You are now running PHP, PHP/MapScript, and Apache.
fr: Dans un navigateur web, allez sur http://127.0.0.1. vous devriez voir une page d'ouverture pour MS4W. Vous faites maintenant fonctionner PHP, PHP/MapScript, et Apache.

source: You can now optionally install other applications that are pre-configured for MS4W, which are located on the `MS4W download page`_.
fr: Vous pouvez en option installer d'autres applications qui sont préconfigurées pour MS4W, qui sont situées dans sur la `page de téléchargement de MS4W <MS4W download page>`_.

source: **Manual Installation Using Apache Server**
fr: **Installation manuelle en utilisant le serveur web Apache**

source: Download the `Apache Web Server`_ and extract it to the root of a directory (eg. D:/Apache).
fr: Télécharger le `serveur web Apache <Apache Web Server>`_ et l'extraire à la racine d'une répertoire (par exemple D:/Apache).

source: Download `PHP4`_ and extract it to your Apache folder (eg. D:/Apache/PHP4).
fr: Télécharger `PHP4`_ et l'extraire dans votre dossier Apache (par exemple D:/Apache/PHP4).

source: Create a temp directory to store MapServer created GIFs. NOTE: This directory is specified in the IMAGEPATH parameter of the WEB Object in the :ref:`mapfile` reference. For this example we will call the temp directory "ms_tmp" (eg. E:/tmp/ms_tmp).
fr: Créer un répertoire temporaire pour stocker les GIF créés par MapServer. NOTE: Ce répertoire est spécifié dans le paramètre IMAGEPATH de l'objet WEB dans la référence du :ref:`mapfile`. Pour cet exemple, nous appellerons le répertoire temporaire "ms_tmp" (par exemple E:/tmp/ms_tmp).

source: Locate the file *httpd.conf* in the conf directory of Apache, and open it in a text viewer (eg. TextPad, Emacs, Notepad).
fr: Identifier l'emplacement du fichier *httpd.conf* dans le répertoire conf de Apache, et l'ouvrir dans un éditeur de texte (comme TextPad, Emacs, Notepad).

source: In the *Alias* section of this file, add aliases to the ms_tmp folder and any other folder you require (for this example we will use the *msapps* folder):
fr: Dans la section *Alias* de ce fichier, ajouters des alias au dossier ms_tmp et tout autre dossier dont vous avez besoin (pour cet exemple, nous utiliserons le dossier *msapps*):

source: In the *ScriptAlias* section of this file, add an alias for the PHP4 folder.
fr: Dans la section *ScriptAlias* de ce fichier, ajouter un alias pour le dossier PHP4.

source: In the *AddType* section of this file, add a type for php4 files.
fr: Dans la section *AddType* de ce fichier, ajouter un type pour les fichiers php4.

source: In the *Action* section of this file, add an action for the php.exe file.
fr: Dans la section *Action* de ce fichier, ajouter une action pour le fichier php.exe.

source: Copy the file *php4.ini-dist* located in your Apache/php4 directory and paste it into your WindowsNT folder (eg. c:/winnt), and then rename this file to *php.ini* in your WindowsNT folder.
fr: Copier le fichier *php4.ini-dist* situé dans votre répertoire Apache/php4 et le copier dans votre dossier WindowsNT folder (comme c:/winnt), et ensuite, renommer ce fichier en *php.ini* dans votre dossier WindowsNT.

source: If you want specific extensions loaded by default, open the *php.ini* file in a text viewer and uncomment the appropriate extension.
fr: Si vous voulez des extensions spécifiques chargées par défaut, ouvrir le fichier *php.ini* dans l'éditeur de texte et décommenter l'extension appropriée.

source: Place the file php_mapscript.dll into your Apache/php4/extensions folder.
fr: Placer le fichier php_mapscript.dll dans votre dossier Apache/php4/extensions

source: **Installation Using Microsoft's IIS**
fr: **Installation en utilisant Microsoft IIS**

source: (please see the :ref:`iis` document for uptodate steps)
fr: (merci de voir le document sur :ref:`iis` pour avoir les différentes étapes)

source: Install IIS if required (see the `IIS 4.0 installation procedure`_).
fr: Installer IIS si il est requis (voir la `procédure d'installation de IIS 4.0 <IIS 4.0 installation procedure>`_).

source: Install PHP and PHP/MapScript (see above).
fr: Installer PHP et PHP/MapScript (voir ci-dessus).

source: Open the Internet Service Manager (eg. C/WINNT/system32/inetsrv/inetmgr.exe).
fr: Ouvrir le gestionnaire de service Internet (c'est à dire' C/WINNT/system32/inetsrv/inetmgr.exe).

source: Select the Default web site and create a virtual directory (right click, select New/Virtual directory). For this example we will call the directory *msapps*.
fr: Sélectionner le site web par défaut et créer un répertoire virtuel (faire un clic droit, sélectionner Nouveau/Répertoire virtuel). Pour cet exemple, nous appelerons le répertoire *msapps*.

source: In the Alias field enter *msapps* and click Next.
fr: Dans le champ Alias, entrer *msapps* et cliquer sur Suivant.

source: Enter the path to the root of your application (eg. "c:/msapps") and click Next.
fr: Entrer le chemin de la racine de votre application (c'est à dire "c:/msapps") et cliquer sur Suivant.

source: Set the directory permissions and click Finish.
fr: Définir les permisions du répertoire Set the directory et cliquer sur Terminer.

source: Select the msapps virtual directory previously created and open the directory property sheets (by right clicking and selecting properties) and then click on the Virtual directory tab.
fr: Sélectionner le répertoire virtuel msapps précédemment créé et ouvrez les propriétés du répertoire (en cliquant droit et sélectionnant propriétés) puis cliquez sur l'onglet Répertoire virtuel.

source: Click on the Configuration button and then click the App Mapping tab.
fr: Cliquez sur le bouton Configuration puis cliquez l'onglet "Mapping App".

source: Click Add and in the Executable box type: *path/to/php4/php.exe %s %s*. You MUST have the *%s %s* on the end, PHP will not function properly if you fail to do this. In the Extension box, type the file name extension to be associated with your PHP scripts. Usual extensions needed to be associated are phtml and php. You must repeat this step for each extension.
fr: Cliquez sur Ajouter et dans la boîte Exécutable entrez : *path/to/php4/php.exe %s %s*. Vous DEVEZ avoir *%s %s* à la fin, PHP ne fonctionnera pas correctement si vous ne réalisez pas ceci. Dans la boîte Extension, entrez l'extension du nom du fichier à associer avec vos scripts PHP. Les extensions habituels qui doivent être associées sont phtml et php. Vous devez répéter cette étape pour chaque extension.

source: Create a temp directory in Explorer to store MapServer created GIFs.
fr: Créer un répertoire temporaire dans Explorateur pour stocker les GIF créés par MapServer.

source: This directory is specified in the IMAGEPATH parameter of the WEB Object in the :ref:`mapfile`. For this example we will call the temp directory *ms_tmp* (eg. C:/tmp/ms_tmp).
fr: Ce répertoire est définie dans le paramètre IMAGEPATH de l'objet WEB dans le :ref:`mapfile`. Pour cet exemple nous appellerons le répertoire temp *ms_tmp* (eg. C:/tmp/ms_tmp).

source: Open the Internet Service Manager again.
fr: Ouvrir le gestionnaire de service Internet à nouveau.

source: Select the Default web site and create a virtual directory called *ms_tmp* (right click, select New/Virtual directory). Set the path to the ms_tmp directory (eg. C:/tmp/ms_tmp) . The directory permissions should at least be set to Read/Write Access.
fr: Sélectionner le site web par défaut et créer un répertoire virtuel (faites un clic droit, sélectionner Nouveau/Répertoire virtuel). Définissez le chemin au répertoire ms_tmp (eg. C:/tmp/ms_tmp) . Les permissions du répertoire doivent au moins être permettre les accès en Lecture/Écriture.

source: FAQ / Common Problems
fr: FAQ / Problèmes communs

source: Questions Regarding Documentation
fr: Questions à propos de la documentation

source: **Is there any documentation available?**
fr: **Il y a une documentation disponible?**

source: The main reference document is the :ref:`PHP MapScript reference <php_mapscript>`, which describes all of the current classes, properties and methods associated with the PHP/MapScript module.
fr: Le principal document de référence est la :ref:`référence PHP MapScript <php_mapscript>`, qui décrit toutes les classes actuelles, propriétés et méthodes associées avec le module PHP/MapScript.

source: To get a more complete description of each class and the meaning of their member variables, see the :ref:`MapScript reference <mapscript>` and the :ref:`MapFile reference <mapfile>`.
fr: Pour obtenir une description plus complète de chaque classe et la signification de leurs variables membres, lisez la :ref:`Référence de MapScript <mapscript>` et la :ref:`référence du MapFile <mapfile>`.

source: **Where can I find sample scripts?**
fr: **Où puis-je trouver des scripts exemple

source: Some examples are included in directory *mapserver/mapscript/php3/examples/* in the MapServer source distribution. A good one to get started is *test_draw_map.phtml*: it's a very simple script that just draws a map, legend and scalebar in an HTML page.
fr: Plusieurs exemples sont inclus dans le dossier *mapserver/mapscript/php3/examples/* dans les sources de la distribution MapServer. Un bon exemple pour démarrer est *test_draw_map.phtml* : c'est un script très simple qui dessine juste une carte, légende et une barre d'échelle dans une page HTML.

source: A good intermediate example is the :ref:`PHP MapScript By Example guide <php_example>` (note that this document was created for an earlier MapServer version but the code might be still useful).
fr: Un bon exemple intermédiaire est le :ref:`Guide par l'exemple de PHP MapScript <php_example>` (notez que ce document a été créé pour une version plus ancienne de MapServer mais le code est toujours utile).

source: The next example is the `GMap demo`_. You can download the whole source and data files from the `MapTools.org download page`_.
fr: Le prochain exemple est la `démo GMap`_. Vous pouvez télécharger l'ensemble du code source et les fichiers donnés à partir de la `MapTools.org download page`_.

source: Questions About Installation
fr: Questions à propos de l'installation

source: **How can I tell that the module is properly installed on my server?**
fr: **Comment puis-je dire que le module est correctement installé sur mon serveur ?**

source: Create a file called phpinfo.phtml with the following contents:
fr: Créer un fichier appelé phpinfo.phtml avec le contenu suivant :

source: Make sure you replace the php_mapscript.so with the name under which you installed it, it could be php_mapscript_46.so on Unix, or php_mapscript_46.dll on Windows
fr: Assurez-vous que vous remplacez le php_mapscript.so avec le nom sous lequel vous l'avez installé, il pourrait être php_mapscript_46.so sous Unix ou sous Windows php_mapscript_46.dll

source: You can then try the second test page *mapserver/mapscript/php3/examples/test_draw_map.phtml*. This page simply opens a MapServer .map file and inserts its map, legend, and scalebar in an HTML page. Modify the page to access one of your own MapServer .map files, and if you get the expected result, then everything is probably working fine.
fr: Vous pouvez alors essayer la seconde page de test *mapserver/mapscript/php3/examples/test_draw_map.phtml*. Cette page ouvre simplement un fichier .map de MapServer et insère une carte, une légende, et une barre d'échelle dans une page HTML. Modifiez la page pour accéder à l'un de vos fichier .map pour MapServer et si vous obtenez le résultat expéré, alors tout fonctionne probablement correctement.

source: **I try to display my .phtml or .php page in my browser but the page is shown as it would it Notepad.**
fr: **J'essaie d'afficher ma page .phtml ou .php dans mon navigateur mais la page s'affiche comme elle le ferait dans Notepad.**

source: The problem is that your PHP installation does not recognize ".phtml" as a PHP file extension. Assuming you're using PHP4 under Apache then you need to add the following line with the other PHP-related AddType lines in the httpd.conf:
fr: Votre problème est que votre installation de PHP ne reconnaît pas l'extension de fichier ".phtml" comme extension PHP. En supposant que vous utilisez PHP4 sous Apache vous devez alors ajouter la ligne suivante avec les autres lignes AddType lié à PHP dans le fichier httpd.conf :

source: For a more detailed explanation, see the :ref:`Example Steps of a Full Windows Installation <php_install_example_steps>` section of this document.
fr: Pour des informations plus détaillées, lisez la section :ref:`Étapes sous forme d'exemples d'une installation sous Windows complète <php_install_example_steps>` de ce document.

source: **I installed the PROJ.4, GDAL, or one of the support libraries on my system, it is recognized by MapServer's "configure" as a system lib but at runtime I get an error: "libproj.so.0: No such file or directory".**
fr: **J'ai installé PROJ.4, GDAL ou l'un des bibliothèques des dépendances sur mon système, elle est reconnu par le configure de MapServer comme bibliothèque système mais au lancement j'obtiens : "libproj.so.0: No such file or directory".**

source: You are probably running a RedHat Linux system if this happened to you. This happens because the libraries install themselves under /usr/local/lib but this directory is not part of the runtime library path by default on your system.
fr: Vous êtes probablement sous un système Linux Red Hat si cela vous arrive. En effet les bibliothèques s'installent dans le répertoire /usr/local/lib mais ce répertoire ne fait pas partie du chemin des bibliothèques lors du lancement par défaut sur votre système.

source: (I'm still surprised that "configure" picked proj.4 as a system lib since it's not in the system's lib path...probably something magic in autoconf that we'll have to look into)
fr: (je suis toujours surpris que le configure récupère proj.4 en tant que bibliothèque système puisqu'elle n'est pas dans le chemin des bibliothèques du système ... Probablement quelque chose de magique dans autoconf que nous devons regarder).

source: There are a couple of possible solutions:
fr: Il y a plusieurs solutions possibles :

source: Add a "setenv LD_LIBRARY_PATH" to your httpd.conf to contain that directory
fr: Ajouter un "setenv LD_LIBRARY_PATH" à votre httpd.conf pour contenir ce répertoire

source: Edit /etc/ld.so.conf to add /usr/local/lib, and then run "/sbin/ldconfig". This will permanently add /usr/local/lib to your system's runtime lib path.
fr: Éditez le fichier /etc/ld.so.conf pour ajouter /usr/local/lib, puis lancez la commande "/sbin/ldconfig". Cela ajoutera de manière permanente le répertoire /usr/local/lib au chemin des bibliothèques à votre système.

source: Configure MapServer with the following options:
fr: Configurez MapServer avec les options suivantes :

source: and the /usr/local/lib directory will be hardcoded in the exe and .so files
fr: et le répertoire /usr/local/lib sera codé en dur dans les fichiers .so et exe.

source: I (Daniel Morissette) personally prefer option #2 because it is permanent and applies to everything running on your system.
fr: I (Daniel Morissette) préfère personnellement l'option #2 parce qu'elle est permanente et s'applique à tout ce qui fonctionne sur votre système.

source: **Does PHP/MapScript have to be setup as a CGI? If so, why?**
fr: **Est ce que PHP/MapScript doit être définie en tant que CGI ? Si oui, pourquoi ?**

source: Yes, please see the `PHP/MapScript CGI page`_ in the MapServer Wiki for details.
fr: Oui, s'il vous plait lisez la `PHP/MapScript CGI page`_ dans le wiki MapServer pour les détails.

source: **I have compiled PHP as a CGI and when PHP tries to load the php_mapscript.so, I get an "undefined symbol: _register_list_destructors" error. What's wrong?**
fr: **j'ai compilé PHP en tant que CGI et quand PHP tente de charger le fichier php_mapscript.so, j'obtiens une erreur "undefined symbol: _register_list_destructors" error. Qu'est ce qui ne va pas ?**
