Repository: geographika/MapServer-documentation
Catalog: translated/*/installation.po
Languages: fr

source: In order to enable this feature, you will need to make sure you have OGR (built with Xerces support) and PROJ.4 support, and pass the WITH_CLIENT_WFS option to your configure script. MapServer will automatically look for libcurl, which is also required.
fr: Afin d'activer cette fonctionnalité, vous aurez besoin de vous assurer d'avoir le support de OGR (avec Xerces activé) et de PROJ.4 et de passer l'option WITH_CLIENT_WFS à votre script configure. MapServer essayera automatiquement de chercher libcurl, qui est aussi requis.

source: More information on using this feature is available in :ref:`wfs_client`.
fr: Plus d'informations pour utiliser cette fonctionnalité est disponible sur :ref:`wfs_client`

source: WCS Server
fr: Serveur WCS

source: Support for `WCS server` is enabled by default. WCS must be compiled against certain libraries. More information on this service is available in :ref:`wcs_server`.
fr: Le support pour le `WCS server` est activé par défaut. WCS doit être compilé avec certaines bibliothèques. Plus d'information sur ce service est disponible dans :ref:`wcs_server`.

source: If, for some reason you don't want WCS support, you can force it off using "-DWITH_WCS=OFF".
fr: Si, pour une raison quelconque vous ne voulez pas du support WCS, vous pouvez forcez sa désactivation en utilisant "-DWITH_WCS=OFF".

source: SOS Server
fr: Serveur SOS

source: Support for SOS is enabled by using the WITH_SOS option. More information on this service is available in :ref:`sos_server`.
fr: Le support de SOS est activé en utilisant l'option WITH_SOS. Plus d'information sur ce service est disponible dans :ref:`sos_server`.

source: Spatial Warehousing
fr: Entrepôts de données spatiales

source: MapServer can use a wide variety of sources of data input. One of the solutions growing in popularity is to use spatially enabled databases to store data, and to use them directly to draw maps for the web.
fr: MapServer peut utiliser une large variété de données en entrée. Une des solutions qui grandit en popularité est d'utiliser des bases de données avec une cartouche spatiale pour stocker la donnée, et de les utiliser directement pour dessiner les cartes pour le web.

source: Here you will find out how to enable mapserver to talk to one of these products. Please refer to the MapFile reference for more details on how to use these. This section only details how to compile MapServer for their use.
fr: Ici, vous trouverez comment activer Mapserver pour qu'il se connecte sur l'un de ces produits. Merci de vous référer à la référence MapFile pour plus de détails comment les utiliser. Cette section détaille seulement comment compiler Mapserver pour leur utilisation.

source: `PostGIS`_ adds support for geographic objects to the `PostgreSQL`_ object-relational database. In effect, PostGIS "spatially enables" the PostgreSQL server, allowing it to be used as a backend spatial database for geographic information systems (GIS), much like ESRI's SDE or Oracle's Spatial extension. PostGIS is included in many distributions' packaging system, but you can also roll your own if needed.
fr: `PostGIS`__ ajoute le support des objets géographiques dans la base de données realtionnelle `PostgreSQL`__ . En fait,PostGIS "rend spatial" le serveur PostgreSQL, lui permettant d'être utilisé comme un base données spatial "backend" pour les systèmes d'information géographique (SIG), à la manière de SDE de ESRI'ou de l'extension spatiale de Oracle. PostGIS est inclus dans de nombreuses distributions, mais vous pouvez aussi faire tourner votre propre version si c'est nécessaire.

source: MapServer can use PostGIS as a data source. PostGIS support is enabled by default.
fr: MapServer peut utiliser PostGIS comme source de données. Le support de PostGIS est activé par défaut.

source: If, for some reason you don't want PostGIS support, you can force it off using "-DWITH_POSTGIS=OFF". To help cmake find your PostGIS installation, you can use the CMAKE_PREFIX_PATH option (for instance "-DCMAKE_PREFIX_PATH=/usr/local/pgsql").
fr: Si, pour une raison quelconque vous ne voulez pas du support PostGIS, vous pouvez forcez sa désactivation en utilisant "-DWITH_POSTGIS=OFF". Pour aider cmake à trouver votre installation de PostGIS, vous pouvez utiliser l'option CMAKE_PREFIX_PATH (par exemple "-DCMAKE_PREFIX_PATH=/usr/local/pgsql").

source: MapServer allows you to use SDE as a data source both for geometry and attributes. In order to achieve this, you must have the SDE client libraries at your disposition, and have them installed on the machine running MapServer.
fr: MapServer vous permet d'utiliser SDE comme source de données à la fois pour la géométrie et les attributs. Pour réaliser ceci, vous devez obligatoirement avoir les bibliothèques clientes SDE à votre disposition, et les avoir installées sur la machine qui fait tourner MapServer.

source: In order to enable SDE support in MapServer, you have to use the following options: WITH_SDE ("-dWITH_SDE=ON") and SDE_VERSION (for example "-DSDE_VERSION=91").
fr: Pour activer SDE dans MapServer, vous devez utiliser les options suivantes : WITH_SDE ("-dWITH_SDE=ON") et SDE_VERSION (par exemple "-DSDE_VERSION=91").

source: Oracle's Spatial is also supported by MapServer. In order to connect to it, you will need to compile MapServer against the Oracle libraries by using the WITH_ORACLESPATIAL option. You will very likely need an ORACLE_HOME environment variable set to have it configure things correctly.
fr: La cartouche spatiale de Oracle est aussi gérée par MapServer. Pour vous connecter dessus, vous devez compiler MapServer avec les bibliothèques Oracle en définissant l'option WITH_ORACLESPATIAL. Vous aurez probablement besoin que la variable d'environnement ORACLE_HOME soit définie pour avoir une configuration des choses correcte.

source: Compiling
fr: Compiler

source: First prepare the ground by making sure all of your required and/or recommended libraries are installed before attempting to compile MapServer. This will make your life much less complicated ;). Here is the order that I usually use:
fr: En premier, préparez le terrain en vous assurant que toutes les bibliothèques requises et/ou recommandées sont installées avant de tenter de compiler MapServer. Cela vous rendra la vie beaucoup moins compliquée ;). Voici l'ordre que j'utilise habituellement:

source: Compile GD. This often means acquiring libjpeg, libpng, zlib, and freetype before actually compiling the library. You shouldn't have too much trouble finding binaries of the libraries that GD requires, and often, they will already be installed with your system. On unix, I've had very little luck finding pre-compiled binaries of the required GD library. See `libgd`_ section for notes about patching libgd if you plan to use antialiasing.
fr: Compilez GD. Cela signife souvent que vous devez obtenir libjpeg, libpng, zlib, et freetype ava,t de compiler la bibliothèque. Vous ne devriez pas avoir trop de problèmes à trouver les binaires nécessaires à GD, et souvent, ils seront déjà installés sur votre système. Sur unix, j'ai eu très peu de chance pour trouver des binaires pré-compilés de la bibliothèque GD. Voir la section `libgd`_ pour des notes sur comment patcher libgd si vous prévoyez d'utiliser l'anticrênelage.

source: Compile GDAL/OGR. Describing how to compile GDAL/OGR is beyond the scope of this document. If you have requirements for lots of different formats, make sure to install those libraries first. I often find that building up a GDAL/OGR library often takes as long as compiling MapServer itself!
fr: Compilez GDAL/OGR. Décrire comment compiler GDAL/OGR est au delà du cadre de ce document. Si vous avez des besoins pour de nombreux formats, assurez-vous d'installer ces bibliothèques en premier. Je trouve souvent que compiler GDAL/OGR prend autant de tant que MapServer lui-même!

source: Compile Proj.4. Proj.4 is a straight-forward configure/make/make install library.
fr: Compilez Proj.4. Proj.4 est une bibliothèque qui s'installe avec une suite directe de configure/make/make install.

source: Compile libcurl. libcurl is a straight-forward configure/make/make install library. This library is only used along with other features, so "--with-curl-config" won't do anything unless something like "--with-wmsclient" or "--with-wfsclient" is also selected.
fr: Compiler libcurl. libcurl est une bibliothèque qui s'installe simplement avec les étapes configure/make/make install. Cette bibliothèque est seulement utilisée avec d'autres fonctionnalités, donc "--with-curl-config" ne fera rien sauf si quelque chose comme "--with-wmsclient" ou "--with-wfsclient" sont aussi sélectionnés.

source: If you want to configure MapServer to use SSL when accessing a WMS/WFS server libcurl must be configured / compiled with the "--with-ssl" option. Details about how to set this up is available in :ref:`wxs_secure`.
fr: Si vous voulez configurer MapServer pour utiliser SSL lors de l'accès au serveur WMS/WFS libcurl doit être configuré / compilé avec l'option "--with-ssl". Les détails sur la manière de réaliser cela sont indiqués sur :ref:`wxs_secure`.

source: Compile/install optional libraries. These might include SDE, PostGIS, Oracle Spatial, AGG, Ming, PDFlib, or MyGIS. Mix and match as you need them.
fr: Compilez/installez les bibliothèques optionnelles. cela peut inclure SDE, PostGIS, Oracle Spatial, AGG, Ming, PDFlib, ou MyGIS. Mixez et faites les correspondre à vos besoins.

source: Unpack the MapServer tarball and cd into the mapserver directory::
fr: Décompressez le tarball MapServer et allez dans le répertoire mapserver:

source: Create the build directory and configure your environment.
fr: Créez le répertoire build et configurez votre environnement.

source: Create the build directory::
fr: Créez le répertoire de compilation::

source: Configure your environment using "cmake" (this is an example)::
fr: Configurez votre environnement avec "cmake" (c'est un exemple)::

source: The following options are enabled by default (version 6.4): WITH_CAIRO, WITH_FCGI, WITH_FRIBIDI, WITH_GDAL, WITH_GEOS, WITH_GIF, WITH_ICONV, WITH_LIBXML2, WITH_OGR, WITH_POSTGIS, WITH_PROJ, WITH_WCS, WITH_WFS, WITH_WMS.
fr: Les options suivantes sont activées par défaut (version 6.4): WITH_CAIRO, WITH_FCGI, WITH_FRIBIDI, WITH_GDAL, WITH_GEOS, WITH_GIF, WITH_ICONV, WITH_LIBXML2, WITH_OGR, WITH_POSTGIS, WITH_PROJ, WITH_WCS, WITH_WFS, WITH_WMS.

source: If you want to also build a static version of the library, the BUILD_STATIC and LINK_STATIC_LIBMAPSERVER options can be used,
fr: Si vous voulez aussi générer une version statique de la librairie, les options BUILD_STATIC et LINK_STATIC_LIBMAPSERVER peut être utilisées,

source: There are a number of other options available. For an up-to-date list of available cmake options, refer to the CMakeLists.txt.
fr: Il y a de nombreuses autres options disponibles. Pour une liste à jour des options disponibles pour cmake, veuillez vous référer au fichier CMakeLists.txt.

source: It can be a good idea to place the configuration commands in a file and change its mode to executable (+x) to save typing and have a record of how MapServer was configured.
fr: Cela peut être une bonne idée de mettre les commandes de configuration dans un fichier et de le rendre exécutable (+x). Cela permet d'éviter de les saisir à nouveau et aussi de pouvoir retrouver comment MapServer a été configuré.

source: Now that you have configured your build options and selected all the libraries you wish mapserver to use, you're ready to compile the source code.
fr: Maintenant que vous avez configuré vos options de compilation et sélectionné les librairies que vous voulez que MapServer puisse utiliser, vous êtes prêt à compiler le code source.

source: This is actually quite simple, just execute "make"::
fr: C'est actuellement plutôt simple, exécutez seulement "make":

source: Install the Mapserver libraries::
fr: Installer les bibliothèques MapServer::

source: To make sure all went well, look for the file called *mapserv*::
fr: Pour s'assurer que tout a bien fonctionné, regardez le fichier appelé *mapserv*

source: A simple test is to try and run it::
fr: Un test simple pour l'essayer et le lancer

source: The message above is perfectly normal, and means exactly what it says. If you get anything else, something went terribly wrong.
fr: Le message ci-dessus est tout à fait normal, et signifie exactement ce qu'il dit. Si vous avez un autre message, quelque chose ne s'est pas du tout bien passé.

source: MapServer binary
fr: Binaire Mapserver

source: The MapServer program itself consists of only one file, the "mapserv" binary executable. This is a CGI executable, meant to be called and run by your web server.
fr: Le programme MapServer lui-même consiste en un seul fichier, le binaire exécutable "mapserv". C'est un exécutable CGI, destiné à être appelé et lancé par votre serveur web.

source: In this section, we will assume you are running Apache under its default directory structure in /usr/local/apache2. You may need to have privileges to edit your httpd.conf (the main apache configuration file), or have someone (such as your webmaster) help you with the configuration details.
fr: Dans cette section, nous assumerons que vous faites tourner Apache sous son répertoire par défaut dans /usr/local/apache2. Vous aurez peut-être besoin de privilèges pour éditer votre httpd.conf (le fichier principal de configuration de apache), ou quelqu'un (comme votre webmaster) pour vous aider avec les détails de configuration.

source: If you don't have apache installed, and you want apache, php, fastcgi, etc, that might look something like this::
fr: Si vous n'avez pas Apache installé et que vous le voulez ainsi que php, fastcgi, etc cela sera fait avec quelques choses comme cela : ::

source: The main goal is to get the "mapserv" binary installed in a publicly accessible directory that is configured to run CGI programs and scripts.
fr: Le but principal est d'obtenir le binaire "mapserv" installé dans dans un répertoire accessible publiquement qui soit configuré pour lancer des scripts et des programmes CGI.

source: Locate your cgi-bin directory. Under a default configuration, the CGI directory is "/usr/local/apache2/cgi-bin" (RedHat: "/home/httpd/cgi-bin", Debian: "/usr/lib/cgi-bin"). If you're using apache, there should be a ScriptAlias directive in your http.conf, or default site, something like::
fr: Localiser votre répertoire cgi-bin. Avec une configuration par défaut, le répertoire CGI est "/usr/local/apache2/cgi-bin" (Les utilisateurs RedHat utiliseront "/home/httpd/cgi-bin", ceux de Debian : "/usr/lib/cgi-bin"). Si vous utilisez Apache, il devrait y avoir une directive ScriptAlias dans votre http.conf, ou dans le site par défaut quelque chose comme cela :

source: Locate the installation path of your freshly compiled mapserv executable. This is shown when you run "make install", something like this::
fr: Localisez le chemin d'installation de votre exécutable fraîchement installé. Cela est affiché quand vous lancez "make install", quelque chose comme cela : ::

source: You'll want to setup a symlink to that executable from your cgi-bin directory::
fr: Vous voudrez mettre en place un lien symbolique vers l'exécutable de votre répertoire cgi-bin::

source: Make sure you are linking against the installed mapserv file (after running 'make install') and NOT against where it was compiled in your source tree.
fr: Assurez vous de vous lier avec un fichier mapserv installé (après avoir lancé 'make install') et PAS avec l'endroit où il a été compilé.

source: Testing your new Install
fr: Tester votre nouvelle installation

source: Placing the mapserv file in this directory makes it accessible by the following URL: "http://yourhostname.com/cgi-bin/mapserv". When accessing this URL through your web client, you should expect the following output if all has worked well: "No query information to decode. QUERY_STRING is set, but empty." If you get this message, you're done installing MapServer.
fr: Placer le fichier mapserv dans ce répertoire le rend accessible par l'URL suivante : "http://yourhostname.com/cgi-bin/mapserv". Quand vous accédez à cette URL via votre client web, vous devriez attendre la sortie suivante si tout a bien fonctionné: "No query information to decode. QUERY_STRING is set, but empty.". Si vous avez ce message, vous avez fini avec l'installation de MapServer.

source: Common problems
fr: Problèmes communs

source: File permissions
fr: Permissions de fichier

source: The most common problem one is likely to encounter when attempting to install the binary are permissions issues:
fr: Le problème le plus courant que vous êtes susceptible de rencontrer est que quand vous tentez d'installer le binaire est le problème des droits:

source: You do not have write permissions into your web server's CGI Directory. Ask your webmaster to install the file for you.
fr: Vous n'avez pas les droits d'écriture sur le répertoire CGI de votre serveur web. Demandez à votre webmaster d'installer le fichier pour vous.

source: The web server gives you a "403 Permission denied" error. Make sure the user the web server runs as (usually "nobody") has execute permission on the binary executable. Making the file world executable is perfectly fine and safe: ::
fr: Le serveur web vous renvoie une erreur "403 Permission denied". Assurez-vous que l'utilisateur qui fait fonctionner le serveur web (habituellement "nobody") a les droits d'exécution sur le binaire exécutable. Rendre le fichier exécutable par tous est très bien et sûr: ::

source: Apache errors
fr: Erreurs Apache

source: You may receive a few different type of errors as well if your web server configuration isn't right:
fr: Vous recevrez peut-être quelques différents types d'erreurs également si votre configuration de serveur web n'est pas bonne:

source: 500 Internal server error: This is a fairly generic error message. All it basically tells you is that the web server was unsuccessful in running the program. You will have to consult the web server's error log to find out more, and may need to enlist the help of your webmaster/system administrator. The apache docs also have pointers on `setting up cgi-bin`_.
fr: "500 Internal server error" : c'est un message d'erreur très générique. Tous ce qu'il vous dit c'est que le serveur web n'a pas réussi à lancer le programme. Vous devriez consulter les logs d'erreurs du serveur web pour essayer d'en savoir plus, et peut être solliciter l'aide de votre webmaster/administrateur système. La documentation Apache a aussi des indications sur la configuration "cgi-bin" à l'adresse http://httpd.apache.org/docs/2.2/howto/cgi.html

source: Check your server logs $ tail /var/log/apache2/error.log
fr: Vérifier les logs de votre serveur $ tail /var/log/apache2/error.log

source: Where to go once you've got it compiled
fr: Où allez après que vous ayez réussi à le compiler

source: The :ref:`introduction` document provides excellent coverage of getting started with MapServer.
fr: Le document :ref:`introduction` fournit une excellente couverture pour bien débuter avec MapServer.

source: V8 MapScript Support
fr: Gestion de MapScript V8

source: The V8/MapScript cannot be used as its own like other mapscripts. V8 is currently used internally to add 2 functionalities:
fr: V8/MapScript ne peut être utilisé seul comme les autres mapscripts. V8 est pour le moment utilisé en interne pour ajouter 2 fonctionnalités :

source: Javascript Styleitem: :ref:`rfc102`
fr: Styleitem Javascript : :ref:`rfc102`

source: Javascript Geomtransform: :ref:`rfc106`
fr: Geomtransform avec Javascript : :ref:`rfc106`

source: These instructions are for Unix/Linux users.
fr: Ces instructions sont pour les utilisateurs Unix/Linux :

source: Version of V8 supported
fr: Version de V8 géré

source: You have to use v8 3.20, which is the version of the nodejs release:0.11.7. For future compatibility, this is a good thing to be synchronized to nodejs project.
fr: Vous devez utiliser la version 3.20 de V8, qui est la version de la release:0.11.7 de nodejs. Pour une compatibilité ultérieure, cela est une bonne chose d'être synchrone avec le projet nodejs.

source: Obtaining, Compiling, and Installing V8 and V8/MapScript
fr: Obtenir, compiler et installer V8 et V8/MapScript

source: Download and Compile V8
fr: Télécharger et compiler V8

source: The V8 source can be obtained from the `v8 website`_.
fr: Les sources de V8 peuvent être obtenues à partir du `site de V8`_.

source: **Download v8:**
fr: **Télécharger v8 :**

source: **Compile the v8 library:**
fr: **Compiler la bibliothèque V8 :**

source: Use ia32.release if you are using a 32bits machine.
fr: Utilisez la release ia32 si vous utiliser une machine 32bits.

source: **Install the v8 library and include headers:**
fr: **Installation de la bibliothèque V8 et inclusion des headers :**

source: Modify the library path if needed (32bits)
fr: Modifiez le chemin de la bibliothèque si nécessaire (32bits)

source: **Setup the v8 lib in the system paths:**
fr: **Configurez la bibliothèque V8 dans les chemins du système :**

source: Compile MapServer with V8 Support
fr: Compilez MapServer avec la gestion de V8

source: **Configure:**
fr: **Configurer :**

source: **Compile and install:** (from the build directory)
fr: **Compilation et installation :** (à partir du répertoire de compilation)

source: **Verify the V8 support:**
fr: **Vérifier la gestion de V8 :**

source: You should see: **SUPPORTS=V8**. You can now refer to the following pages to try the javascript functionalities:
fr: Vous devez voir : **SUPPORT=V8**. Vous pouvez maintenant lire les pages suivantes pour tester les fonctionnalités javascript :

source: Javascript Styleitem: :ref:`styleitemjs`
fr: Styleitem avec Javascript : :ref:`styleitemjs`

source: Javascript Geomtransform: :ref:`geomtransformjs`
fr: Geomtransform avec Javascript : :ref:`geomtransformjs`

source: Compiling on Win32
fr: Compiler sous Win32

source: This document provides a simple set of compilation procedures for MapServer on Win32 platforms.
fr: Ce document fournit un simple jeu de procédures de compilation pour MapServer sur les plateformes Win32.

source: If you've made it this far, chances are you already know about MapServer and are at least tempted to try compiling it for yourself. Pre-compiled binaries for MapServer are available from a variety of sources. Refer to :ref:`windows`. Building MapServer for win32 platforms can be a daunting task, so if existing binaries are sufficient for your needs, it is strongly advised that they be used in preference to trying to build everything from source.
fr: Si vous êtes allé aussi loin, il y a des chances que vous connaissiez déjà MapServer et et que vous soyez au moins tentéd'essayer de le compiler vous-même. Les binaires précompilés pour MapServer sont disponibles depuis une variété de sources différentes. Référez-vous à :ref:`windows`. Compiler MapServer pour les plateformes win32 peut être une tâche ardue, ainsi si des binaires existants sont suffisants pour vos besoins, il est fortement recommandé de les utiliser de préférence plutôt que d'essayer de compiler tout depuis les sources.
