Repository: geographika/MapServer-documentation
Catalog: translated/*/optimization.po
Languages: fr

source: If you have verified that MapServer creates a valid map image through :ref:`shp2img`, you've checked your MapServer log files, and there are no problems noted in your Web server logs, then you should focus your attention on possible application configuration problems. "Application" here means how you are displaying your map images on the Web page, such as with `OpenLayers <http://www.openlayers.org>`__.
fr: Si vous avez vérifié que MapServer crée une image valide de la carte via :ref:`shp2img`, vous avez vérifié vos logs du serveur Web, alors vous devez porter votre attention sur des problèmes potentiels de mauvaises configurations de votre application. "Application" signifie ici comment vous affichez vos images de cartes sur la page Web, tel que `OpenLayers <http://www.openlayers.org>`__.

source: If you are using PHP MapScript in your application, here are some important notes for debugging:
fr: Si vous utilisez PHP MapScript dans votre application, voici plusieurs notes pour le débogage :

source: 1. Make sure your *php.ini* file is configured to show all errors, by setting:
fr: 1. Assurez-vous que votre fichier *php.ini* est configuré pour montrer toutes les erreurs, en définissant :

source: To enable debugging in PHP MapScript, if you are using MapServer 5.6.0 or more recent, make sure to define *ZEND_DEBUG* in the PHP source.
fr: Pour activer le débogage en PHP MapScript, si vous utilisez MapServer 5.6.0 ou plus récent, assurez-vous de définir *ZEND_DEBUG* dans les sources de PHP.

source: If you are using MapServer < 5.6.0, then:
fr: Si vous utilisez MapServer < 5.6.0, alors:

source: open the file */mapscript/php3/php_mapscript.c*
fr: ouvrir le fichier */mapscript/php3/php_mapscript.c*

source: change the following:
fr: changer ce qui suit:

source: Debugging MapServer using Compiler Debugging Tools
fr: Debugger MapServer en utilisant les outils de débuggage du compilateur

source: Running MapServer in GDB (Linux/Unix)
fr: Lancer Mapserver dans GDB (Linux/Unix)

source: Building with Symbolic Debug Info
fr: Compiler avec les informations de debug symboliques

source: It is not strictly necessary to build MapServer with debugging enabled in order to use `GDB <http://www.gnu.org/software/gdb/>`__ on linux, but it does ensure that more meaningful information is reported within GDB. To enable full symbolic information use the *--enable-debug* configure switch. Note that use of this switch disables optimization and so it should not normally be used for production builds where performance is important.
fr: Il n'est pas strictement nécessaire de compiler MapServer avec le debuggage activé afin d'utiliser `GDB <http://www.gnu.org/software/gdb/>`__ sous Linux, mais cela s'assure que des informations plus compréhensibles sont reportées au sein de GDB. Pour activer les informations symboliques complètes, utilisez l'option de configure *--enable-debug*. Notez que l'utilisation de cette option désactive l'optimisation et qu'elle ne doit pas être activée normalement utilisée pour les compilations de production où la performance est importante.

source: Running in the Debugger
fr: Lancer dans le debugger

source: To run either mapserv or shp2img, give the name of the executable as an argument to the "gdb" command. If it is not in the path, you will need to provide the full path to the executable.
fr: Pour exécuter mapserv ou bien shp2img, passez le nom de l'exécutable en tant qu'argument à la commande "gdb". Si il n'est pas dans le chemin, vous devrez fournir le chemin complet vers l'exécutable.

source: Once you are at the "(gdb)" prompt you can use the run command with the arguments you would normally have passed to the mapserv or shp2img executable.
fr: Une fois que vous être dans l'invite "(gdb)", vous pouvez lancer la commande avec les arguments que vous auriez normalement passés à l'exécutable mapserv ou shp2img.

source: If the program is crashing, you will generally get a report like the above indicating the function the crash occurred in, and some minimal information on why. It is often useful to request a traceback to see what functions led to the function that crashed. For this use the "where" command.
fr: Si le programme plante, vous obtiendrez généralement un rapport comme celui ci-dessus indiquant la fonction qui occasionne le crash et des informations minimalistes sur la cause. Il est souvent utile de demander une traceback pour voir quels fonctions amènent à la fonction qui a plantée. Pour cela, utilisez la commande "where".

source: It may also be helpful to examine variables used in the line where the crash occured. Use the print command for this.
fr: Il peut être aussi utile d'examiner les variables utilisées à la ligne où l'erreur est apparue. Utilisez la commande print pour cela.

source: In this case we see that the program crashed because poOpenInfo was NULL (zero). Including a traceback like the above in bug report can help the developers narrow down a problem more quickly, especially if it is one that is difficult for the developers to reproduce themselves.
fr: Dans ce cas nous voyons que le programme a planté parce que poOpenInfo est NULL (zéro). Inclure une traceback comme ci-dessus dans un rapport de bug peut aider les développeurs à s'approcher du problème plus rapidement, spécialement si c'est un problème difficile à reproduire pour les développeurs.

source: Debugging Older Versions of MapServer (before 5.0)
fr: Debugger des anciennes versions de MapServer (avant la 5.0)

source: Make sure that MapServer is compiled in debug mode (on unix this is enabled through *./configure --enable-debug*).
fr: Assurez-vous que Mapserver est compilé en mode debug (sous unix, c'est activé par *./configure --enable-debug*).

source: You can verify that your build was compiled in debug mode, by executing the following at the commandline (look for "DEBUG=MSDEBUG"):
fr: Vous pouvez vérifier que votre compilation a été faite en mode debug, en exécutant ce qui suit dans la ligne de commande (regardez si vous avez "DEBUG=MSDEBUG"):

source: Set the *MS_ERRORFILE* variable is in your mapfile, within the :ref:`MAP` object, such as:
fr: Définir la variable *MS_ERRORFILE* dans votre mapfile, à l'intérieur de l'objet :ref:`MAP`, comme ceci :

source: If you don't use the *MS_ERRORFILE* variable, you can use the LOG parameter in your :ref:`WEB` object of the mapfile, such as:
fr: Si vous n'utilisez pas la variable *MS_ERRORFILE*,vous pouvez utiliser le paramètre LOG dans l'objet :ref:`WEB` de votre mapfile, comme ceci :

source: Specify *DEBUG ON* in your MAP object, or in your LAYER objects, such as:
fr: Spécifier *DEBUG ON* dans votre objet MAP object, ou dans vos objets LAYER, comme ceci :

source: Note that only errors will be written to the log file; all DEBUG output goes to stderr, in the case of Apache that is Apache's *error_log* file. If you are using Microsoft IIS, debug output is routed to *stdout* (i.e. the browser), so be sure to remove *DEBUG ON* statements if using IIS on a production server.
fr: Notez que seules les erreurs seront écrites dans les fichiers de log ; toutes les sorties DEBUG iront vers la sortie standard, dans le cas d'Apache c'est le fichier d'*error_log* d'Apache. Si vous utilisez Microsoft IIS, la sortie debug est envoyé vers *stdout* (i.e. le navigateur), assurez vous de supprimer le paramètre *DEBUG ON* si vous utilisez IIS sur un serveur de production.

source: Debugging
fr: Debugger

source: Debug levels
fr: Niveaux de debug

source: FastCGI is a protocol for keeping cgi-bin style web applications running as a daemon to take advantage of preserving memory caches, and amortizing other high startup costs (like heavy database connections) over many requests.
fr: FastCGI est un protocole pour garder les applications web de style cgi-bin lancé sous forme de démon pour optimiser la préservation des caches mémoires, et amortir les coûts important de démarrage (comme les coût de connections à la base de données) pour de nombreuses requêtes.

source: Obtaining the necessary software
fr: Obtenir le logiciel nécessaire

source: There are three pieces to the MapServer FastCGI puzzle. First, you need the actual FastCGI library. This can be downloaded from `http://www.fastcgi.com/ <http://www.fastcgi.com/>`__. This library does the usual *configure, make, make install* dance. One added complication is that it installs by default in /usr/local, and you might give the *configure* command a --prefix=/usr to put it in a location that is already visible to ldconfig.
fr: Il y a 3 pièces dans le puzzle FastCGI de MapServer. D'abord, vous avez besoin de la bibliothèque FastCGI. Elle peut être téléchargée à partir de `http://www.fastcgi.com/ <http://www.fastcgi.com/>`__. Cette bibliothèque nécessite l'ensemble habituel *configure, make, make install*. Une complication supplémentaire est qu'il s'installe par défaut dans /usr/local par conséquent vous avez besoin d'ajouter à la commande *configure* un --prefix=/usr pour le placer au bon endroit qui est déjà visible dans ldconfig.

source: Assuming you are running `Apache <http://httpd.apache.org>`__, the next piece you need is the fastcgi module. There are two fastcgi implementations for apache:
fr: En assumant que vous avez `Apache <http://httpd.apache.org>`__ , la prochaine pièce dont vous avez besoin est le module fastcgi. Il existe deux implémentations de fastcgi pour apache :

source: *mod_fcgid*: mod_fcgid is the newer and recommended way to run fastcgi programs under recent apache versions. It can be downloaded from the `Apache fcgid homepage <http://httpd.apache.org/mod_fcgid/>`__
fr: *mod_fcgid*: mod_fcgid est la manière la plus récente et recommandée pour lancer des programmes fastcgi pour des versions apache récente. Il peut être téléchargé à partir de la `page fcgid d'Apache <http://httpd.apache.org/mod_fcgid/>`__

source: **deprecated** *mod_fcgi*: Mod_fcgi depends on the version of Apache you are running, so make sure to download the correct fork (Apache 1.3 vs. Apache 2).
fr: **déprécié** *mod_fcgi* : mod_fcgi dépens de la version d'Apache que vous utilisez, assurez vous donc de télécharger le fork correct (Apache 1.3 vs. Apache 2).

source: The third and final piece is to compile MapServer with FastCGI support. This is pretty straightforward, and all you need to do is tell *configure* where the FastCGI library is installed. If you changed the prefix variable as described above, this would be:
fr: La troisième et dernière étape est de compiler MapServer avec la gestion de FastCGI. C'est assez aisé, et tout ce dont vous avez besoin est de dire à "configure" où est installé la bibliothèque FastCGI. Si vous avez changé la variable prefix comme décrit plus haut, cela devrait être :

source: With those pieces in place, the MapServer CGI (mapserv) should now be FastCGI-enabled. You can verify this by testing it on with the command line:
fr: Avec ces deux étapes en place, le CGI de MapServer (mapserv) doit posséder l'activation FastCGI. Vous pouvez vérifier cela en le testant avec la ligne de commande :

source: mod_fcgid Configuration
fr: Configuration de mod_fcgid

source: Modify http.conf to load the FastCGI module.
fr: Modifier http.conf pour charger le module FastCGI

source: Add an Apache handler for FastCGI applications.
fr: Ajouter un handler Apache pour les applications FastCGI.

source: Set FastCGI processing information
fr: Définir les informations de traitement FastCGI

source: Deprecated mod_fcgi Configuration
fr: Déprécié Configuration mod_fcgi

source: This section is left for reference. The recommended way to run fastcgi programs under apache is to use mod_fcgid, as detailed above.
fr: Cette section est laissée pour référence. La façon recommandée de lancer le programme fastcgi sous apache est d'utiliser mod_fcgi, comme décrit plus haut.

source: Common mod_fcgid/mod_fcgi Configuration
fr: Configuration commune mod_fcgid/mod_fcgi

source: Install a copy of the mapserv executable (originally **mapserv** or **mapserv.exe**) into the cgi-bin directory with the extension **.fcgi** (ie. **mapserv.fcgi**). Use this executable when you want to utilize fastcgi support.
fr: Installez une copie de l'exécutable mapserv (initialement **mapserver** ou **mapserv.exe**) dans le répertoire cgi-bin avec l'extension **.fcgi** (ie. **mapserv.fcgi**). Utilisez cet exécutable quand vous souhaitez utiliser fastcgi.

source: For some platforms, the MapServer link would then have to changed from:
fr: Pour certaines plate-formes, le lien MapServer devrait être ensuite changé depuis:

source: To:
fr: Par:

source: For other platforms, the MapServer link would then have to changed from:
fr: Pour les autres plate-formes, le lien MapServer devrait être ensuite changé depuis :

source: In your mapfile, set a PROCESSING directive to tell FastCGI to cache the connections and layer information on all layers for which connection caching is desired - ie. all slow layers.
fr: Dans votre mapfile, définissez une directive PROCESSING pour informer FastCGI de mettre en cache les informations de connections et des couches de toutes les couches pour lesquelles le cache de connections est désiré - ie. toutes les couches lentes.

source: Common Problems
fr: Problèmes communs

source: File permissions
fr: Permissions fichier

source: Fedora Core 3 doesn't allow FastCGI to write to the process logs (when you use RedHat's Apache 2 rather than your own). This is described `here <http://www.fastcgi.com/archives/fastcgi-developers/2005-March/003638.html>`__.
fr: Fedorac Core 3 n'autorise pas FastCGI d'écrire dans les logs des processus (quand vous utilisez la version d'Apache 2 de Red Hat plutôt que la votre). Cela est décrit `ici <http://www.fastcgi.com/archives/fastcgi-developers/2005-March/003638.html>`__.

source: Also, FastCGI needs to write its socket information somewhere. This can be directed with the *FastCgiIpcDir* directive.
fr: FastCGI a besoin d'écrire ses informations de sockets quelque part. Cela peut être définie avec la directive "FastCgilpcDir".

source: FastCGI on Win32
fr: FastCGI sur Win32

source: MS4W Users
fr: Utilisateurs MS4W

source: `MS4W (MapServer for Windows)`_ >= version 2.2.2 contains MapServer compiled with FastCGI support. MS4W version >= 2.2.8 also contains the required Apache module (mod_fcgid), and users must follow the `README instructions`_ to setup FastCGI with their application.
fr: `MS4W (MapServer pour Windows)`_ >= version 2.2.2 contient MapServer compilé avec la gestion de FastCGI. La version de MS4W >= 2.2.8 contient également le module Apache nécessaire (mod_fcgid), et les utilisateurs doivent suivre les `instructions du README`_ pour paramétrer FastCGI avec leur application.

source: Building fcgi-2.4.0
fr: Compiler fcgi-2.4.0

source: I used libfcgi-2.4.0 for use with Apache2 from http://www.fastcgi.com.
fr: J'ai utilisé libfcgi-2.4.0 pour utiliser avec Apache2 depuis le site http://www.fastcgi.com.

source: Binary IO Patch
fr: Patch binaire IO

source: It is critical that stdio be in binary mode when PNG and other binary images are written to it. To accomplish this for stdio handled through the FastCGI library, I had to do the following hack to libfcgi/fcgi_stdio.c within the fcgi-2.4.0 distribution.
fr: Il est critique que stdio soit en mode binaire quand les images PNG et autres formats soit écrit. Pour accomplir cela avec la version de stdio utilisée par la bibliothèque FastCGI, J'ai dû réaliser cette modification dans le fichier libfcgi/fcgi_stdio.c au sein de la distribution fcgi-2.4.0.

source: In FCGI_Accept() made he following change
fr: Dans FCGI_Accept(), faire les changements suivant

source: Also, add the following just before the FCGI_Accept() function
fr: Ajouter également ce qui suit juste avant la fonction FCGI_Accept()

source: I'm sure there is a better way of accomplishing this. If you know how, please let me know!
fr: Je suis sûr qu'il y a une meilleure façon d'y parvenir. Si vous savez comment, s'il vous plaît faites le moi savoir !

source: Building libfcgi
fr: Compiler libfcgi

source: The makefile.nt should be fine. Just ensure you have run VCVARS32.BAT (as is needed for building MapServer) and then issue the command::
fr: Le fichier makefile.nt devrait convenir. Assurez vous juste que vous avez lancé VCVARS32.BAT (puisque nécessaire pour compiler MapServer) puis lancez la commande ::

source: Then the .lib and .dll will be in libfcgi/Debug?. Make sure you copy the DLL somewhere appropriate (such as your cgi-bin directory).
fr: Puis les fichiers .lib et .dll seront dans libfcgi/Debug?. Assurez vous de copier les DLL quelque part d'approprié (tel que le répertoire cgi-bin).

source: Other Issues
fr: Autres problèmes

source: 1) FastCGI's receive a very limited environment on win32, seemingly even more restricted than normal cgi's started by apache. Make sure that all DLLs required are either in the fastcgi directory or in windows\system32. Any missing DLLs will result in very cryptic errors in the error_log, including stuff about Overlapping read requests failing or something like that.
fr: 1) FastCGI reçoit un environnement très limité sur win32, apparemment même plus restreint que le cgi normal démarré par Apache. Assurez vous que toutes les DLL nécessaires sont soit dans le répertoire cgi-bin soit dans windows\system32. Une seule DLL manquante entraînerait des erreurs incompréhensible dans les logs d'erreur, dont des choses liées à des requêtes de lectures en overlapping en échec ou quelque chose comme ca.

source: 2) Make sure you use a libfcgi.dll built against the same runtime library as your mapserv.exe (and possibly libmap_fcgi.dll) or you will suffer a world of pain! Different runtime libraries have different "environ" variables (as well as their own stdio and heaps). You can check that everything is using MSVCRT.DLL (or all using MSVCRTD.DLL) using the MS SDK Dependency Walker.
fr: 2) Assurez vous d'utiliser un fichier libfcgi.dll compilé avec la même bibliothèque d'exécution que pour mapserver.exe (et également libmap_fcgi.dll) ou vous souffrirez ! Différentes bibliothèques d'exécution ont différentes variables "d'environnement" (ainsi que leur propre stdio et heaps). Vous pouvez vérifier que tous utilisent MSVCRT.DLL (ou tous utilisent MSVCRTD.DLL) en utilisant le SDK MS Dependency Walker.

source: Optimization
fr: Optimisation

source: The contents of a Map File are used by MapServer for configuration, data access, projection, and more. Because the Map File is parsed every time a map image is requested, it is important to think about what you include in the file in order to optimize performance. The optimal Map File is one that doesn't include or reference anything that isn't needed.
fr: Le contenu d'un fichier Map est utilisé par MapServer pour la configuration, l'accès aux données, la projection et beaucoup d'autres choses. Parce que le fichier Map est lu à chaque fois une image de carte est demandée, il est important de réfléchir ce que vous incluez dans le fichier afin d'optimiser les performances. Le fichier Map optimal est celui qui n'inclus rien d'autres que ce qui est nécessaire.

source: There are two ways to define projections in a Map File. You can either use inline projection parameters or specify an EPSG code for that projection. If you use the :term:`EPSG` code method, :term:`Proj.4` looks up the projection parameters in the Proj4 database using the EPSG code as an ID. This database lookup takes significantly more resources than when the projection parameters are defined inline. This lookup takes place for each projection definition using EPSG codes in a Map File.
fr: Il existe deux façons de définir des projections dans un fichier de la carte . Vous pouvez soit utiliser les paramètres de projection inline ou spécifier un code EPSG pour cette projection. Si vous utilisez le : terme: `Méthode code EPSG` , : terme: ` Proj.4` regarde les paramètres de projection dans la base de données Proj4 utilisant le code EPSG comme ID . Cette recherche de base de données prend beaucoup plus de ressources que lorsque les paramètres de projection sont définies inline . Cette recherche a lieu pour chaque définition de projection utilisant des codes EPSG dans un fichier de la carte .

source: **Projection defined using inline projection parameters**
fr: **Projection définie en utilisant des paramètres de projection "en ligne"**

source: **Projection defined using EPSG Code**
fr: **Projection définie en utilisant un code EPSG**

source: **Optimization Suggestions**
fr: **Suggestions d'optimisation**

source: Use inline projection parameter definitions in place of EPSG codes.
fr: Utiliser des définitions de paramètres de projection "en ligne" au lieu des codes EPSG.

source: If you want to use EPSG codes, remove all unneeded projection definition records from the Proj.4 :term:`EPSG` database.
fr: Si vous voulez utiliser les codes EPSG, enlever tous les enregistrements de projections inutiles de la base de données :term:`EPSG` Proj.4.

source: 2. Layers
fr: 2. Couches

source: For every layer in a Map File that has a status of ON or DEFAULT, MapServer will load that layer and prepare it for display, even if that layer never gets displayed.
fr: Pour chaque couche dans un fichier map qui a un statut à ON ou à DEFAULT, MapServer chargera cette couche et la préparera pour l'affichage, même si cette couche n'est jamais affichée.

source: Build lean Map Files, only include layers that you plan to use.
fr: Construire des mapfiles les plus minimaux, inclure seulement des couches que vous avez prévu d'utiliser.

source: Turn off unnecessary layers; the more layers MapServer is displaying, the more time it takes. Have your opening map view show only the minimum necessary to orient the user, and allow them to turn on additional layers as needed. This is particularly true of remote WMS or very large rasters.
fr: Éteignez les couches inutiles ; Plus Les couches affiche par MapServer , plus le temps qu'il faut. Ayez votre carte ouverture vue c'est le minimum nécessaire pour orienter l'utilisateur , et leur permettre de tourner sur des couches supplémentaires au besoin. Cela est particulièrement vrai de WMS distants ou de très grandes trames .

source: Related to turning off layers, is turning them on but using MINSCALEDENOM and MAXSCALEDENOM to determine at what zoomlevels the layer is available. If a map's display is outside of the layer's MINSCALEDENOM and MAXSCALEDENOM range, then MapServer can skip processing that layer. It also makes for a really cool effect, that the national boundaries magically change to state boundaries.
fr: Liée à la désactivation des couches , est de les activer , mais en utilisant MINSCALEDENOM et MAXSCALEDENOM de déterminer à quel zoomlevels la couche est disponible . Si l'affichage de la carte est en dehors de MINSCALEDENOM de la couche et la gamme de MAXSCALEDENOM , MapServer peut ignorer le traitement de cette couche. Il rend également pour un effet vraiment cool , que les frontières nationales changent magiquement au frontières de l'Etat .

source: If you have a complex application, consider using multiple simple and specific Map Files in place of one large 'do everything' Map File.
fr: Si vous avez une application complexe, considérez l'usage de plusieurs mapfiles simples et spécifiques plutôt qu'un seul gros fichier mapfile 'tout en un'.
