Repository: geographika/MapServer-documentation
Catalog: translated/*/optimization.po
Languages: fr

source: Debugging MapServer
fr: Debugger Mapserver

source: Table of Contents
fr: Table des matières

source: When developing an application for the Internet, you will inevitably across problems many problems in your environment. The goal of this guide is to assist you with locating the problem with your MapServer application.
fr: Quand vous développez une application pour Internet, vous rencontrerez inévitablement parmi les problèmes cerains liés à votre environnement. Le but de ce guide est de vous assister dans la localisation du problème avec votre application MapServer.

source: Links to Related Information
fr: Liens vers les informations associées

source: :ref:`RFC 28: Redesign of LOG/DEBUG output mechanisms <rfc28>`
fr: :ref:`RFC 28: Redesign des mechanismes de sortie des LOG/DEBUG <rfc28>`

source: :ref:`MapServer Errors <errors>`
fr: :ref:`Erreurs MapServer <errors>`

source: Steps to Enable MapServer Debugging
fr: Etapes pour activer le debug Mapserver

source: Starting with MapServer 5.0, you are able to control the levels of debugging/logging information returned to you by MapServer, and also control the location of the output log file.
fr: A partir de la version de MapServer 5.0, vous êtes capables de contrôler les niveaux d'information de debug/log retournés par MapServer, et aussi contrôler l'emplacement du fichier de log en sortie.

source: In technical terms, there are msDebug() calls in various areas of the MapServer code that generate information that may be useful in tuning and troubleshooting applications.
fr: En termes techniques, il y a plusieurs appels à msDebug() à différents endroits dans le code de MapServer qui génère une information qui peut s'avérer utile pour optimiser et débugger des applications.

source: Step 1: Set the MS_ERRORFILE Variable
fr: Etape 1: définir la variable MS_ERRORFILE

source: The **MS_ERRORFILE** variable is used to specify the output of debug messages from MapServer. You can pass the following values to **MS_ERRORFILE**:
fr: La variable **MS_ERRORFILE** est utilisée pour spécifier la sortie des messages de debug de MapServer. Vous pouvez passer les valeurs suivantes à **MS_ERRORFILE** :

source: **[filename]**
fr: **[nom_de_fichier]**

source: Full path and filename of a log file, to contain MapServer's debug messages. Any file extension can be used, but *.log* or *.txt* is recommended. The file will be created, if it does not already exist.
fr: Chemin complet et nom d'un fichier de log pour récupérer les messages de debug de Mapserver. N'importe quelle extension de fichier peut-être utilisée mais *.log* ou *.txt* sont recommandés. Le fichier sera créé si il n'existe pas déjà.

source: Starting with MapServer 6.0, a filename with relative path can be passed via the CONFIG MS_ERRORFILE directive, in which case the filename is relative to the mapfile location. Note that setting MS_ERRORFILE via an environment variable always requires an absolute path since there would be no mapfile to make the path relative to.
fr: A partir de MapServer 6.0, un nom de fichier avec un chemin relatif peut être passé par la directive CONFIG MS_ERRORFILE, et dans ce cas, le nom du fichier est relatif à l'emplacement du mapfile. Notez que définir MS_ERRORFILE via une variable d'environnement nécessite toujours un chemin absolu étant donné qu'il n'y a pas de mapfile pour définir un chemin relatif.

source: Use this to send MapServer's debug messages to the Web server's log file (i.e. "standard error"). If you are using Apache, your debug messages will be placed in the Apache *error_log* file. If you are using Microsoft IIS, your debug messages will be sent to *stdout* (i.e. the browser), so its use is discouraged. With IIS it is recommended to direct output to a file instead.
fr: Utiliser ceci pour envoyer des messages de debug MapServer au fichier de log du serveur web (c'est à dire "standard error"). Si vous utilisez Apache, vos messages de debug seront placés dans le fichier *error_log* de Apache. Si vous utilisez Microsoft IIS, vos messages de debug seront envoyées à *stdout* (c'est à dire le navigateur), ainsi son utilisation est déconseillée. Avec IIS, il est recommandé de renvoyer la sortie directe vers un fichier à la place.

source: Use this to send MapServer's debug messages to the standard output (i.e. the browser), combined with the rest of MapServer's output.
fr: Utiliser ceci pour envoyer les messages de debug Mapserver vers la sortie standard (c'est à dire le navigateur) combiné avec le reste de la sortie de Mapserver.

source: Use this to send MapServer's debug messages to the Windows OutputDebugString API, allowing the use of external programs like SysInternals debugview to display the debug output.
fr: Utilisez ceci pour envoyer des messages de debug MapServer à l'API OutputDebugString de Windows, permettant l'utilisation de programmes externes comme debugview de SysInternals pour afficher la sortie de debug.

source: Through the Mapfile
fr: Via le Mapfile

source: The recommended way to set the **MS_ERRORFILE** variable is in your mapfile, within the :ref:`MAP` object, such as:
fr: La manière recommandée de définir la variable **MS_ERRORFILE** est dans votre mapfile, à l'intérieur de l'objet :ref:`MAP`, comme:

source: Through an Environment Variable
fr: Via une variable d'environnement

source: You can also set the **MS_ERRORFILE** variable as an environment variable on your system. Apache users can set the environment variable in Apache's *httpd.conf* file, such as:
fr: Vous pouvez aussi définir la variable **MS_ERRORFILE** comme variable d'environnement sur votre système. Les utilisateurs Apache peuvent définir la variable d'environnement dans le fichier *httpd.conf* de Apache, comme ceci :

source: Windows users can alternatively set the environment variable through the Windows System Properties; but make sure to set a SYSTEM environment variable.
fr: Les utilisateurs Windows peuvent de manière alternative définir la variable d'environnement via les Propriétés du système; mais assurez vous de définir la variable d'environnement dans SYSTEM.

source: If both the *MS_ERRORFILE* environment variable is set and a *CONFIG MS_ERRORFILE* is also set, then the CONFIG directive takes precedence.
fr: Si les deux variables d'environnement *MS_ERRORFILE* et *CONFIG MS_ERRORFILE* sont définies,alors la directive CONFIG à la précédence.

source: Step 2: Set the DEBUG Level
fr: Etape 2: définir le niveau de DEBUG

source: You can retrieve varying types of debug messages by setting the *DEBUG* parameter in the :ref:`mapfile`. You can place the *DEBUG* parameter in any LAYER in the mapfile for layer-specific debug information, or instead, set it once in the MAP object to get general debug information. Use the value of the *DEBUG* parameter to set the type of information returned, as follows:
fr: Vous pouvez récupérer divers types de de messages de debug en configurant le paramètre *DEBUG* dans le :ref:`mapfile`. Vous pouvez placer le paramètre *DEBUG* dans n'importe quel bloc LAYER dans le mapfile pour les informations de debug spécifiques aux couches, ou à la place, définissez le une seule fois dans l'objet MAP pour obtenir les informations de debug générales. Utilisez la valeur du paramètre *DEBUG* pour définir le type d'information retournée, comme cela suit:

source: DEBUG Levels
fr: Niveaux de DEBUG

source: **Level 0**
fr: **Niveau 0**

source: Errors only (DEBUG OFF, or DEBUG 0)
fr: Erreurs seulement (DEBUG OFF, ou DEBUG 0)

source: In level 0, only msSetError() calls are logged to MS_ERORFILE. No msDebug() output at all. This is the default and corresponds to the original behavior of MS_ERRORFILE in MapServer 4.x
fr: Au niveau 0, seulement les appels msSetError() sont loggués au MS_ERRORFILE. Pas de sortie msDebug() du tout. C'est le comportement par défaut et correspond au comportement original de MS_ERRORFILE dans MapServer 4.x

source: **Level 1**
fr: **Niveau 1**

source: Errors and Notices (DEBUG ON, or DEBUG 1)
fr: Erreurs et notifications (DEBUG ON, ou DEBUG 1)

source: Level 1 includes all output from Level 0 plus msDebug() warnings about common pitfalls, failed assertions or non-fatal error situations (e.g. missing or invalid values for some parameters, missing shapefiles in tileindex, timeout error from remote WMS/WFS servers, etc.)
fr: Le niveau 1 inclut toutes les sorties du niveau Level 0 avec les avertissements msDebug() à propos de des erreurs communes, des assertions échouées ou des situations d'erreur non-fatales (c'est à dire les valeurs manquantes ou invalides pour certains paramètres, les shapefiles manquants dans l'index de tuiles, les erreurs de délai depuis les serveurs distants WMS/WFS servers, etc.)

source: **Level 2**
fr: **Niveau 2**

source: Map Tuning (DEBUG 2)
fr: Optimisation de la carte (DEBUG 2)

source: Level 2 includes all output from Level 1 plus notices and timing information useful for tuning mapfiles and applications. *this is the recommended minimal debugging level*
fr: Le niveau 2 inclut toutes les sorties du niveau 1 avec les notifications et les informations de timing, utiles pour optimiser les mapfiles et les applications. *C'est le niveau de debug minimal recommandé*

source: **Level 3**
fr: **Niveau 3**

source: Verbose Debug (DEBUG 3)
fr: Debug verbeux (DEBUG 3)

source: All of Level 2 plus some debug output useful in troubleshooting problems such as WMS connection URLs being called, database connection calls, etc.
fr: Tout le niveau 2 avec quelques sorties de debug utiles pour diagnostiquer des problèmes comme les URLs de connexion WMS qui sont appelées, les appels de connexion aux bases de données, etc.

source: **Level 4**
fr: **Niveau 4**

source: Very Verbose Debug (DEBUG 4)
fr: Debug très verbeux (DEBUG 4)

source: Level 3 plus even more details...
fr: Level 3 avec encore plus de détails...

source: **Level 5**
fr: **Niveau 5**

source: Very Very Verbose Debug (DEBUG 5)
fr: Debug très très verbeux (DEBUG 5)

source: Level 4 plus any msDebug() output that might be more useful to developers than to users.
fr: Le niveau 4 plus toutes les sorties msDebug() qui pourraient être utiles plus aux développeurs qu'aux utilisateurs.

source: Mapfile Example: Map-Level Debug
fr: Exemple de Mapfile: Debug au niveau du bloc MAP

source: The following example is the recommended method to set the *DEBUG* parameter for the map-level:
fr: L'exemple suivant est la méthode recommandée pour définir le paramètre *DEBUG* au niveau du bloc MAP:

source: Mapfile Example: Layer-Level Debug
fr: Exemple de Mapfile: Debug au niveau du bloc LAYER

source: The following example is the recommended method to set the *DEBUG* parameter for a layer:
fr: L'exemple suivant est la méthode recommandée pour définir le paramètre *DEBUG* pour une couche:

source: The MS_DEBUGLEVEL Environment Variable
fr: La variable d'environnement MS_DEBUGLEVEL

source: Instead of setting the *DEBUG* Debug level in each of your mapfiles, you can also be set the level globally by using the *MS_DEBUGLEVEL* environment variable.
fr: Au lieu de définir le niveau de *DEBUG* dans chacun de vos mapfiles, vous pouvez aussi définir le niveau de manière globale en utilisant la variable d'environnement *MS_DEBUGLEVEL*.

source: When set, this value is used as the default debug level value for all map and layer objects as they are loaded by the mapfile parser. This option also sets the debug level for any msDebug() call located outside of the context of a map or layer object, for instance for debug statements relating to initialization before a map is loaded. If a DEBUG value is also specified in the mapfile in some map or layer objects then the local value (in the mapfile) takes precedence over the value of the environment variable.
fr: Quand elle est définie, cette valeur est utilisée comme la valeur de debug par défaut pour tous les objets MAP et LAYER quand ils sont chargés par le parseur de mapfile. Cette option définit aussi le niveau de debug pour n'importe quel appel msDebug() effectué en dehors du contexte d'un objet MAP ou LAYER, par exemple, pour des instructions de debug relative à l'initialisation avant qu'un mapfile soit chargé. Si une valeur `DEBUG` est spécifiée aussi dans le mapfile au niveau d'un objet MAP ou LAYER alors la valeur locale (dans le mapfile) a la précédence sur la valeur provenant de la variable d'environnement.

source: Apache users can set the environment variable in Apache's *httpd.conf* file, such as:
fr: Les utilisateurs Apache peuvent définir la variable d'environnement dans le fichier *httpd.conf* Apache, comme ceci :

source: Step 3: Turn on CPL_DEBUG (optional)
fr: Etape 3: activer CPL_DEBUG (optionnel)

source: MapServer relies on the `GDAL <http://www.gdal.org/>`__ library to access most data layers, so you may wish to turn on GDAL debugging, to hopefully get more information on how GDAL is accessing your data file. This could be very helpful for problems with accessing raster files and PostGIS tables. You can trigger this GDAL output by setting the **CPL_DEBUG** variable in your mapfile, within the :ref:`MAP` object, such as:
fr: MapServer repose sur la bibliothèque `GDAL <http://www.gdal.org/>`__ pour accéder à la plupart des types de données, alors vous pouvez avoir l'idée d'activer le debugging GDAL, pour éventuellement récupérer plus d'information sur comment GDAL accède à vos fichiers. Cela peut être très utile lors de problèmes d'accès à des fichiers raster ou des tables PostGIS. Vous pouvez activer cette option GDAL en réglant la variable **CPL_DEBUG** dans votre mapfile, dans l'objet :ref:`MAP` de cette manière:

source: Step 4: Turn on PROJ_DEBUG (optional)
fr: Etape 4: activer PROJ_DEBUG (optionnel)

source: MapServer relies on the `PROJ.4 <http://trac.osgeo.org/proj/>`__ library to handle data projections, so you may wish to turn on PROJ debugging, to hopefully get more information back from the PROJ library. You can trigger this PROJ output by setting the **PROJ_DEBUG** variable in your mapfile, within the :ref:`MAP` object, such as:
fr: MapServer repose sur la bibliothèque `PROJ.4 <http://trac.osgeo.org/proj/>`__ pour la gestion des projections, vous pouvez donc avoir envie d'activer le debugging de PROJ pour récupérer plus d'information directement de la bibliothèque PROJ. Vous pouvez activer cette option en réglant la variable **PROJ_DEBUG** dans votre fichier .map, au sein de l'objet :ref:`MAP`, ainsi :

source: Step 5: Test your Mapfile
fr: Etape 5: tester votre Mapfile

source: Once you have set the *MS_ERRORFILE* and *DEBUG* level in your mapfile, you should now test your mapfile and read your generated log file.
fr: Une fois défini *MS_ERRORFILE* et le niveau de *DEBUG* dans votre mapfile, vous devriez maintenant tester votre mapfile et lire le fichier de log généré.

source: Using shp2img
fr: Utiliser shp2img

source: The recommended way to test your mapfile is to use the MapServer commandline utility :ref:`shp2img`, to verify that your mapfile creates a valid map image. :ref:`shp2img` should be included in your MapServer installation (`MS4W <http://www.ms4w.com>`__ users need to execute *setenv.bat* before using the utility).
fr: La manière recommandée pour tester votre mapfile est d'utiliser la commande de mapServer :ref:`shp2img`, , afin de vérifier que votre mapfile créé une image valide d'une carte. :ref:`shp2img` devrait être inclus dans votre installation MapServer (les utilisateurs de `MS4W <http://www.ms4w.com>`__ devront lancer *setenv.bat* avant d'utiliser cette commande).

source: You can set the *DEBUG* level by passing the :ref:`shp2img` following parameters to your commandline call:
fr: Vous pouvez configurer le niveau de *DEBUG* en passant les paramètres suivant à la ligne de commande :ref:`shp2img` :

source: If you have already set *MS_ERRORFILE* in your mapfile, you must comment this out in order to use these :ref:`shp2img` options
fr: Si vous avez déjà défini *MS_ERRORFILE* dans votre mapfile, vous devez commenter ceci dans le but d'utiliser ces options de :ref:`shp2img`

source: When using :ref:`shp2img` to debug, your layer's STATUS should be set to ON or DEFAULT. If the layer's STATUS is set to OFF, you must additionally pass the layer name to :ref:`shp2img` by using the "``-l layername``" syntax
fr: Lorsque vous utilisez :ref:`shp2img` pour débuguer, le paramètre STATUS de votre couche doit être à ON ou à DEFAULT. Si ce paramètre est définie à OFF, vous devez passer le nom de la couche dans la commande :ref:`shp2img` en utilisant la syntaxe "``-l layername``".

source: Use this setting to set the debug level for the MAP object and all layers. *this is the recommended switch to use*
fr: Utiliser cette configuration pour définir le niveau de debug pour l'objet MAP et toutes les couches. *C'est la manière recommandée de procéder*.

source: Use this setting to set the debug level for the MAP object only.
fr: Utiliser cette configuration pour définir le niveau de debug pour l'objet MAP uniquement.

source: Use this setting to set the debug level for one layer object only.
fr: Utiliser cette configuration pour définir le niveau de debug pour un seul objet LAYER.

source: Set CPL_DEBUG
fr: Définir CPL_DEBUG

source: At the commandline execute the following:
fr: Dans la ligne de commande, exécuter ce qui suit

source: Reading Errors Returned by shp2img
fr: Lire les erreurs retournées par shp2img

source: If there is a problem with your mapfile, :ref:`shp2img` should output the line number in your mapfile that is causing the trouble. The following tells us that there is a problem on line 85 of my mapfile:
fr: S'il y a un problème avec votre mapfile, :ref:`shp2img` devrait retourner le numéro de ligne dans votre mapfile qui cause le problème. Ce qui suit indique qu'il y a un soucis à la ligne 85 de mon mapfile :

source: If you are using mapfile :ref:`INCLUDEs <include>`, it may be tricky to track down this line number, but most of the time the line number is useful.
fr: Si vous utilisez des :ref:`INCLUDE <include>` dans vos mapfiles, il sera parfois plus difficile d'identifier le numéro de ligne, mais la plupart du temps, le numéro de ligne est utile.

source: Using mapserv CGI
fr: Utiliser le programme CGI mapserv

source: Another handy way to test your mapfile is to call the mapserv CGI executable at the :ref:`commandline <mapserv>`, such as the following:
fr: Une autre manière pratique pour tester votre mapfile est d'appeler l'exécutable CGI mapserv par :ref:`la ligne de commande <mapserv>`, comme ce qui suit :

source: If you are using tile indexes to access your data, you should also be aware of the configuration settings added in MapServer 5.4 that allow you to tell MapServer how to handle missing data in tile indexes. Please see the *CONFIG* parameter's *ON_MISSING_DATA* setting in the :ref:`map` object for more information.
fr: Si vous utilisez des tuiles indexées pour accéder à vos données, vous devez aussi considérer les paramètres de configuration ajoutés dans MapServer 5.4 qui vous permettent d'indiquer à MapServer comment traiter les données manquantes dans les tuiles indexées. Regardez le réglage *ON_MISSING_DATA* du paramètre *CONFIG* dans l'objet :ref:`map` pour plus d'info.

source: You can check the attributes in the tileindex by executing "*ogrinfo -al*" on your data file
fr: Vous pouvez vérifier les attributs dans un index de tuiles (tileindex) en exécutant la commande "*ogrinfo -al*" sur votre fichier de données

source: Step 6: Check your Web Server Logs
fr: Etape 6: vérifier vos logs de serveur web

source: Once you have verified that there are no problems with you mapfile, next you should check your Web server log files, for any related information that may help you narrow down your problem.
fr: Une fois que vous avez vérifié qu'il n'y a pas de problèmes avec votre mapfile, vous devez ensuite vérifier les fichiers de log du serveur Web qui apporteront des informations vous permettant de vous rapprocher du problème.

source: Unix users will usually find Apache's *error_log* file in a path similar to:
fr: Les utilisateurs Unix trouveront les fichiers *error_log* de Apache dans un chemin similaire à :

source: Windows users will usually find Apache's log files in a path similar to:
fr: Les utilisateurs Windows trouveront habituellement les fichiers de log Apache dans un chemin similaire à :

source: MapServer for Windows (`MS4W <http://www.ms4w.com>`__) users will find Apache's log files at:
fr: Les utilisateurs de MapServer pour Windows (`MS4W <http://www.ms4w.com>`__) trouveront les fichiers de logs d'Apache à :

source: IIS log files can be located by:
fr: Les fichiers de log IIS log peuvent retrouvés par:

source: Go to Start -> Control Panel -> Administrative Tools
fr: Allez à Démarrer -> Panneau de configuration -> Outils d'administration

source: Open the Internet Information Services (IIS) Manager.
fr: Ouvrir le gestionnaire de "Internet Information Services (IIS)"

source: Find your Web site under the tree on the left.
fr: Trouver votre site web dans l'arborescence sur la gauche.

source: Right-click on it and choose Properties.
fr: Faire un clic-droit dessus et choisir Propriétés.

source: On the Web site tab, you will see an option near the bottom that says "Active Log Format." Click on the Properties button.
fr: Sous l'onglet "Site web" vous verrez une option vers le bas précisant "Active Log Format". Cliquez sur le bouton Propriétés.

source: At the bottom of the General Properties tab, you will see a box that contains the log file directory and the log file name. The full log path is comprised of the log file directory plus the first part of the log file name, for example::
fr: En bas de l'onglet Propriétés Générales, vous verrez une boîte qui contient le répertoire du fichier de log et le nom du fichier de log. Le chemin complet du log comprend le répertoire du fichier de log plus la première partie du nom du fichier de log, par exemple ::

source: You may also want to check the Windows Event Viewer logs, which is located at:
fr: Vous pouvez aussi cocher le paramètre logs de visualisation des événements Windows, qui est localisé ici :

source: Computer Management
fr: Gestion de l'ordinateur

source: Event Viewer
fr: Visualiseur d'événement

source: As mentioned previously, in IIS the MapServer *stderr* debug output is returned to the client instead of routed to the Web Server logs, so be sure to log the output to a file, using:
fr: Comme dit précédemment, dans IIS la sortie de débug *stderr* de MapServer est renvoyé vers le client au lieu d'être dirigé vers les logs du serveur Web, assurez vous donc de loguer la sortie vers un fichier, en utilisant :

source: CGI Error - The specified CGI application misbehaved by not returning a complete set of HTTP headers
fr: Erreur CGI - L'application CGI définie ne fonctionne pas correctement et ne retourne pas les en-têtes HTTP complètes.

source: This error is often caused by missing DLL files. You should try to execute "*mapserv -v* at the commandline, to make sure that MapServer loads properly.
fr: Cette erreur est souvent causée par l'absence de fichiers DLL. Vous devriez essayer d'exécuter la ligne de commande "*mapserv -v*, afin de s'assurer que MapServer charge correctement.

source: Step 7: Verify your Application Settings
fr: Etape 7: vérifier les paramétrages de votre application
