Repository: geographika/MapServer-documentation
Catalog: translated/*/optimization.po
Languages: fr

source: In a similar vein, each class also supports MINSCALEDENOM and MAXSCALEDENOM. If your dataset has data that are relevant at different zoomlevels, then you may find this a very handy trick. For example, give a MINSCALEDENOM of 1:1000000, county roads a MINSCALEDENOM of 1:100000, and streets a MAXSCALEDENOM of 1:50000. You get the cool effect of new data magically appearing, but you don't have MapServer trying to draw the nation's roads when the entire nation is in view!
fr: Dans la même veine , chaque classe prend également en charge MINSCALEDENOM et MAXSCALEDENOM . Si votre ensemble de données contient des données qui sont pertinentes à différents zoomlevels , alors vous pouvez trouver ça comme une astuce très pratique . Par exemple , donner un MINSCALEDENOM de 1: 1000000 , routes départementales un de MINSCALEDENOM de 1: 100000 , et les rues un MAXSCALEDENOM de 1: 50000 . Vous obtenez l'effet fraîcheur de nouvelles données qui apparaissent comme par magie , mais vous n'avez pas MapServer essayant pour attirant les routes du pays où toute la nation est en vue !

source: Classes are processed in order, and a feature is assigned to the first class that matches. So try placing the most commonly-used classes at the top of the class list, so MapServer doesn't have to try as many classes before finding a match. For example, if you wanted to highlight the single state of Wyoming, you would probably do this:
fr: Les classes sont traitées dans l'ordre , et une fonctionnalité est affectée à la première classe qui correspond . Donc, essayez de placer les classes les plus couramment utilisés dans le haut de la liste de classe , alors MapServer n'a pas avoir à essayer autant de classes avant de trouver un match . Par exemple , si vous voulez mettre en évidence l'état unique de Wyoming, vous auriez probablement le faire.

source: But it would be a lot more efficient to do this, since 98% of cases will be matched on the first try:
fr: Mais cela sera beaucoup plus efficace de faire ceci, comme 98% des cas seront vérifiés au premier essai :

source: Use :ref:`tile indexes <tileindex>` instead of multiple layers.
fr: Utiliser les :ref:`index de tuiles <tileindex>` au lieu de plusieurs couches.

source: 3. Symbols
fr: 3. Symboles

source: When the Map File is loaded, each raster symbol listed in the symbols file is located on the filesystem and loaded.
fr: Quand un mapfile est chargé, chaque symbole raster listé dans le fichier de symboles est récupéré depuis le système de fichiers et chargé.

source: Only include raster symbols in your symbols file if you know that they will be used by your application.
fr: Inclure seulement les symboles raster dans votre fichier de symboles si vous savez qu'ils seront utilisés par votre application.

source: 4. Fonts
fr: 4. Polices

source: To load a font, MapServer opens up the fonts.list :ref:`fontset` file which contains an alias for the font and the path for that font file. If you have a fonts.list file with a long list of fonts, it will take more time for MapServer to locate and load the font that you need.
fr: Pour charger une police, MapServer ouvre le fichier fonts.list: ref: `fontset` qui contient un alias pour la police et le chemin pour ce fichier de police. Si vous avez un fichier fonts.list avec une longue liste de polices, il faudra plus de temps pour MapServer pour localiser et charger la police que vous avez besoin.

source: Limit the entries in fonts.list to fonts that you actually use.
fr: Limiter les entrées dans le fichier fonts.list aux polices que vous utilisez véritablement.

source: Mapfile tuning
fr: Customisation de Mapfile

source: Layers
fr: Couches

source: Symbols
fr: Symboles

source: Fonts
fr: Polices

source: Overviews
fr: Aperçus

source: Tileindexes and Internal Tiling
fr: Index de tuiles et tuilage interne

source: Tiling is mostly effective for cases where one commonly requests only a very small area of the image.
fr: Le tuilage est le plus efficace pour les cas où les requêtes couvrent seulement une très petite aire de l'image.

source: Image formats
fr: Formats d'image

source: For TIFFs larger than 1 GB, ECW images tend to render faster than TIFFs, since decompressing the data (CPU and RAM) is faster than reading the uncompressed data (disk). The downside is that ECW is not open-source, and the licensing is often prohibitive.
fr: Pour les TIFF de tailles supérieurs à 1 GB, les images ECW tendent à être rendues plus rapidement que les TIFF, comme la décompression de de données (CPU et RAM) est plus rapide que la lecture des données non compressées (disque). La contre-partie est que le format ECW n'est pas open-source, et que la licence est souvent chère à acquérir.

source: JPEG2000 is a very slow image format, as is JPEG.
fr: Le JPEG2000 est un format d'image très lent, comme l'est le JPEG.

source: Remote WMS
fr: WMS distant

source: Tiling
fr: Tuilage

source: Tile Indexes
fr: Index de tuiles

source: What is a tileindex and how do I make one?
fr: Qu'est ce qu'un index de tuiles et comment en faire un?

source: For example, to make a mosaic of several TIFFs:
fr: Par exemple, pour faire une mosaïque de plusieurs TIFFs :

source: And to make a mosaic of vectors:
fr: Et pour faire une mosaïque de vecteurs :

source: Using the tileindex in your mapfile
fr: Utiliser l'index de tuiles (tileindex) dans votre mapfile

source: Using a tileindex as a layer is best explained by an example:
fr: L'utilisation d'un index de tuiles (indextile) comme une couche s'explique plus facilement avec un exemple :

source: Two important notes about the pathnames:
fr: Deux choses importantes à retenir sur les noms des chemins :

source: The path to TILEINDEX follows the same conventions as for any other data source, e.g. using the SHAPEPATH or else being relative to the location of the mapfile.
fr: Le chemin de TILEINDEX suit les mêmes conventions que les autres sources de données, c'est à dire en utilisant le SHAPEPATH ou le chemin relatif à l'emplacement du mapfile.

source: Tileindexes may make your map faster
fr: Les index de tuiles (tileindex) pourraient rendre votre carte plus rapide

source: A tileindex is often a performance boost for two reasons:
fr: Un index de tuiles (tileindex) est souvent un moyen d'améliorer les performances pour deux raisons :

source: It's more efficient than having several separate layers.
fr: C'est plus efficace que d'avoir plusieurs couches séparées.

source: The ideal case for a tileindex is when the most typically requested map areas fall into very few tiles. For example, if you're showing state and larger regions, try fitting your data into state-sized blocks instead of county-sized blocks; and if you're showing cities and counties, go for county-sized blocks.
fr: Le cas idéal pour un index de tuiles (tileindex) est quand les aires de carte les plus souvent demandées tombent dans quelques tuiles. Par exemple, si vous montrez des états et des régions plus larges, essayez de faire rentrer vos données dans des blocs de la taille d'un Etat au lieu de blocs de la taille de comtés (américains); et si vous montrez des villes et des comtés, faites plutôt des blocs de la taille des comtés.

source: You'll just have to experiment with it and see what works best for your use cases.
fr: Vous aurez juste à faire vos expérimentations et voir ce qui marche le mieux pour vos cas d'utilisation.

source: Tileindexes with tiles in different projections
fr: Tileindexes avec des tuiles dans différentes projections

source: e.g:
fr: c'est à dire:

source: MapServer will then be able to proceed to on-the-fly mosaicing and reprojection.
fr: MapServer sera capable de réaliser la reprojection et le mosaïcage à la volée.

source: Note: this support of tileindex with mixed projections is only available for raster layers for now.
fr: Note: le support de tileindex avec des projections mixtes est seulement disponible pour les couches raster pour le moment.

source: Tile indexes
fr: Index de tuiles

source: Vector
fr: Vecteur

source: Splitting your data
fr: Découper votre donnée

source: If you find yourself making several layers, all of them using the same dataset but filtering to only use some of the records, you could probably do it better. If the criteria are static, one approach is to pre-split the data.
fr: Si vous vous retrouvez à utiliser plusieurs couches et qu'elles utilisent toutes la même source de données mais que que vous faites un filtre pour n'avoir que quelques enregistrements, vous pouvez surement faire mieux. Si le critère est statique, une approche est de pré-découper les données.

source: The *ogr2ogr* utility can select on certain features from a datasource, and save them to a new data source. Thus, you can split your dataset into several smaller ones that are already effectively filtered, and remove the FILTER statement.
fr: L'utilitaire *ogr2ogr* peut sélectionner certains objets d'une source de données, et les sauver dans une nouvelle source. Ainsi, vous pouvez découper votre jeu de données en plusieurs autres plus petits qui sont déjà filtrés, et enlever l'instruction FILTER.

source: Use :ref:`shptree` to generate a spatial index on your shapefile. This is quick and easy ("shptree foo.shp") and generates a .qix file. MapServer will automagically detect an index and use it.
fr: Utilisez :ref:`shptree` pour générer un index spatial sur votre shapefile. C'est rapide et facile ("shptree foo.shp") et génère un fichier .qix. MapServer le détectera et l'utilisera automatiquement.

source: MapServer also comes with the :ref:`sortshp` utility. This reorganizes a shapefile, sorting it according to the values in one of its columns. If you're commonly filtering by criteria and it's almost always by a specific column, this can make the process slightly more efficient.
fr: MapServer vient aussi avec l'utilitaire :ref:`sortshp`. Il réorganise un shapefile, en le triant suivant les valeurs d'une de ces colonnes. Si vous effectuez souvent des filtrespar critères et que c'est presque toujours suivant une colonne spécifique, cela peut rendre le processus un peu plus efficace.

source: Although shapefiles are a very fast data format, :ref:`PostGIS <input_postgis>` is pretty speedy as well, especially if you use indexes well and have memory to throw at caching.
fr: Malgré le fait que les shapefiles soit un format avec un accès très rapide, :ref:`PostGIS <input_postgis>` est plutôt rapide également, particulièrement si vous utilisez les index judicieusement et avez assez de mémoire pour le cache.

source: The single biggest boost to performance is indexing. Make sure that there's a GIST index on the geometry column, and each record should also have an indexed primary key. If you used shp2pgsql, then these statements should create the necessary indexes:
fr: La plus grosse augmentation de performance se fait via l'indexation. Assurez-vous qu'il y a un index GIST sur la colonne géométrie, et que chaque enregistrement a aussi une clé primaire indexée. Si vous utilisez shp2pgsql, alors ces instructions devrait créer les index nécessaires :

source: PostgreSQL also supports reorganizing the data in a table, such that it's physically sorted by the index. This allows PostgreSQL to be much more efficient in reading the indexed data. Use the CLUSTER command, e.g.
fr: PostgreSQL supporte aussi la réorganisation des données dans une table, de manière à ce qu'elle soit physiquement triée par index. Cea permet à PostgreSQL d'être plus efficace dans la lecture des données indexées. Utiliser la commande CLUSTER, c'est à dire.

source: Then there are numerous optimizations one can perform on the database server itself, aside from the geospatial component. The easiest is to increase *max_buffers* in the *postgresql.conf* file, which allows PostgreSQL to use more memory for caching. More information can be found at the `PostgreSQL website`_.
fr: Ensuite, il y a de nombreuses optimisations que vous pouvez effectuer sur le serveur de base de données lui-même, indépendamment de sa cartouche spatiale. La manière la plus simple est d'augmenter la valeur de *max_buffers* dans le fichier *postgresql.conf*, qui permet à PostgreSQL d'utiliser plus de mémoire pour le cache. Plus d'informations peuvent être trouvées sur le `site web de PostgreSQL <http://www.postgresql.org>`_.

source: Databases in General (PostGIS, Oracle, MySQL)
fr: Bases de données en général (PostGIS, Oracle, MySQL)

source: By default, MapServer opens and closes a new database connection for each database-driven layer in the mapfile. If you have several layers reading from the same database, this doesn't make a lot of sense. And with some databases (Oracle) establishing connections takes enough time that it can become significant.
fr: Par défaut, MapServer ouvre et ferme une nouvelle connexion à la base de données pour chacune des couches dans le mapfile ayant pour source une base. Si vous lisez plusieurs couches à partir d'une même base de données, ce comportement n'a aucun sens. Et avec certaines bases de données (Oracle), établir des connections prend sufffisamment de temps pour que ce soit significatif.

source: Try adding this line to your database layers:
fr: Essayer d'ajouter cette ligne dans vos couches de base de données :

source: This causes MapServer to not close the database connection for each layer until after it has finished processing the mapfile and this may shave a few seconds off of map generation times.
fr: Cela indique à MapServer de na pas fermer la connexion à la base de données pour chaque couche après qu'il ait fini de parcourir le mapfile et cela pourra parfois vous faire gagner quelques secondes sur les temps de générations de cartes.

source: Shape datasets
fr: Jeux de données Shape

source: Databases
fr: Base de données
