Repository: geographika/MapServer-documentation
Catalog: translated/*/products.po
Languages: fr, sq

source: MapServer Suite Products
fr: Produits de la Mapserver Suite
sq: MapServer Paketë Produktesh

source: Since the MapServer 6.0 release, the MapServer project includes a suite of Open Source products, to provide a full set of online mapping tools to the community. The MapServer Project Steering Committee maintains all of these products under the single umbrella of MapServer.
fr: Depuis la publication de Mapserver 6.0, le projet Mapserver inclut une suite de produis Open Source, pour fournir un jeu complet d'outils pour la cartographie en ligne à la communauté. Le Comité de Gouvernance de Projet de Mapserver maintient tous ces produits sous la même dénomination Mapserver.
sq: Që prej lëshimit të versionit MapServer 6.0, projekti MapServer përfshin një paketë të produkteve Burim i Hapur, për të siguruar një seri të plotë të mjeteve në internet të hartës për komunitetin. Komiteti Drejtues i Projektit MapServer mban të gjitha këto produkte nën çadër të vetme të MapServer.

source: Developers looking to contribute to the Github projects should review MapServer's :ref:`Github guidelines <git>`
fr: Les développeurs souhaitant contribuer aux projets sur Github peuvent revoir les règles du :ref:`guide Github <git>` de Mapserver
sq: Zhvillues në kërkim për të kontribuar në projektet Github duhet të rishikojnë MapServer's :ref:`Github udhëzimet <git>`

source: MapServer Core
fr: Coeur de Mapserver
sq: Bërthama MapServer

source: The mapServer core source code, written in C, and consistently is one of the fastest and most configurable online mapping engines in the world.
sq: Burimi i kodit bërthamë i mapServer , shkruar në C, dhe në vazhdimësi është një nga më të shpejtët dhe më konfigureshmit motorë e hartës në internet në botë.

source: :ref:`Documentation home <documentation>`
fr: :ref:`Accueil de la documentation <documentation>`
sq: :ref:`Dokumentacion shtëpi <documentation>`

source: :ref:`Download <source>`
fr: :ref:`Téléchargement <source>`
sq: :ref:`Shkarko <burim>`

source: `Github home <https://github.com/mapserver/mapserver/>`__
fr: `Accueil Github <https://github.com/mapserver/mapserver/>`__
sq: `Github shtëpi <https://github.com/mapserver/mapserver/>`__

source: MapCache
sq: KafazMap

source: As of MapServer 6.0, MapServer also includes powerful tile caching capabilities through the MapCache project.
fr: Depuis la version de 6.0 de MapServer, MapServer inclut aussi des fonctionnalités de mise en cache très puissantes par l'intermédiaire du projet MapCache.
sq: Që nga MapServer 6.0, MapServer gjithashtu përfshin aftësitë të fuqishme depozitimi kalimi përmes projektit MapCache.

source: :ref:`Documentation home <mapcache>`
fr: :ref:`Accueil de la documentation <mapcache>`
sq: :ref:`Dokumentacion shtëpi <mapcache>`

source: `Github home <https://github.com/mapserver/mapcache/>`__
fr: `Accueil Github <https://github.com/mapserver/mapcache/>`__
sq: `Github shtëpi <https://github.com/mapserver/mapcache/>`__

source: TinyOWS
sq: OWSvockël

source: As of MapServer 6.0, MapServer also includes the much needed ability to perform transactional requests (online editing of features) through the WFS specification, using the TinyOWS project.
fr: Depuis la version de 6.0 de MapServer, MapServer a aussi la capacité d'effectuer des requêtes transactionnelles (édition géographique en ligne) via la spécification WFS-T grâce au projet TinyOWS.
sq: Që nga MapServer 6.0, MapServer gjithashtu përfshin aftësi shumë të nevojshme për të kryer kërkesat transaksionare (redaktimi në internet i karakteristikave të) nëpërmjet specifikimit WFS, duke përdorur projektin TinyOWS.

source: :ref:`Documentation home <tinyows>`
fr: :ref:`Accueil de la documentation <tinyows>`
sq: :ref:`Dokumentacion shtëpi <tinyows>`

source: `Github home <https://github.com/mapserver/tinyows/>`__
fr: `Accueil Github <https://github.com/mapserver/tinyows/>`__
sq: `Github shtëpi <https://github.com/mapserver/tinyows/>`__

source: The MapServer core source code, written in C, and consistently is one of the fastest and most configurable online mapping engines in the world.
fr: Le code source du coeur de Mapserver, écrit en C, et de manière consistante est l'un des moteurs de rendu de cartographie en ligne parmi les plus rapides et les plus configurables dans le monde.
